{
  "last_updated": "2026-02-25T13:12:24.484224+00:00",
  "articles": [
    {
      "title": "India’s AI boom pushes firms to trade near-term revenue for users",
      "link": "https://techcrunch.com/2026/02/24/india-ai-boom-pushes-firms-to-trade-near-term-revenue-for-users/",
      "author": "Jagmeet Singh",
      "date": "2026-02-24T18:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/chatgpt-india-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "AI",
      "content": "Tech giants’ efforts to ramp up AI adoption in India may be about to hit a turning point, as companies end free promotions with hopes to convert the world’s fourth-largest economy into a windfall of paid subscribers.\n\nIndia became the world’s largest market for generative AI app downloads in 2025, according to market intelligence firm Sensor Tower, widening its lead over the U.S. as installs jumped 207% year-over-year.\n\nCompanies includingOpenAI,Google, andPerplexityrolled out extended free premium offers to accelerate user growth in the price sensitive market. Leading AI firms have also backed India in its push to become a global artificial intelligence hub. Amajor AI summit in New Delhilast week wasattended by leadersincluding OpenAI’s Sam Altman, Anthropic’s Dario Amodei, and Alphabet CEO Sundar Pichai — a sign of the country’s growing weight in the global AI race.\n\nNow, some of those early promotional pushes are winding down. Perplexityendedits bundled Pro offer with Indian telco Airtel in January, while OpenAI’s free ChatGPT Go access in India isno longer available, potentially setting the stage for a clearer test of how many newly acquired users convert to paying subscribers.\n\nDespite strong download growth, India still generates a disproportionately small share of AI app revenue, accounting for about 1% of in-app purchases even as it drives roughly 20% of global GenAI app downloads, according to the Sensor Tower data shared with TechCrunch, highlighting the monetization challenge in one of the industry’s fastest-growing markets.\n\nGenAI app adoption in India accelerated sharply through 2025, with downloads peaking in September and October at year-over-year growth rates of about 320% and 260%, respectively, according to the data. Yet the surge in usage did not fully translate into revenue gains. In November and December 2025, AI app in-app purchase revenue in India fell 22% and 18% month over month, respectively. ChatGPT’s revenue dropped even more sharply — down 33% and 32% over the same period following the November launch of free sub-$5 ChatGPT Go access — reflecting the near-term impact of aggressive promotional pushes.\n\nChatGPT still commands more than 60% of GenAI in-app revenue in India, meaning shifts in its pricing strategy can significantly influence overall market performance.\n\nAlongside promotional pushes, Sensor Tower attributed the surge in GenAI app adoption in India last year to a mix of new product launches, including the debut of platforms such as DeepSeek, Grok, and Meta AI, as well asupgrades to major chatbotslike ChatGPT, Gemini, Claude, and Perplexity. Viral interest in AI-generated content also helped fuel adoption, with content creation and editing tools accounting for seven of the 20 most downloaded GenAI apps in India in 2025.\n\nThe user surge has been equally pronounced. India accounted for about 19% of the global user base of leading AI assistant apps in 2025, ahead of the U.S. at 10%, Sensor Tower said. ChatGPT continues to dominate the Indian market by monthly active users, though rivals including Google’s Gemini and Perplexity have also seen rapid growth following promotional offers. ChatGPT was themost downloaded GenAI appin India and globally in 2025, according to earlier Sensor Tower data. Earlier this month, OpenAI’s CEO said that the chatbot now hasmore than 100 million weekly active usersin India.\n\nThe promotional push in India reflects a broader strategy by AI firms to reduce pricing friction in a highly value-conscious market, betting that early user adoption and engagement will translate into stronger long-term retention once free access periods expire, said Sneha Pandey, insights analyst at Sensor Tower.\n\nIndia’s appeal lies in its massive digital base. The country has more than a billion internet users and around 700 million smartphone owners, making it one of the largest potential markets for AI services globally and a critical battleground for user growth.\n\nNonetheless, user engagement in India still trails more mature markets. In 2025, users of leading AI chatbot apps in the U.S. spent about 21% more time per week on the apps than their counterparts in India and logged 17% more sessions on average, per Sensor Tower.\n\n“AI in-app revenues will likely see meaningful but gradual improvement as users become more deeply integrated into these platforms, making sustained engagement paramount,” Pandey told TechCrunch.\n\nShe added that pricing pressure in India is likely to remain elevated given the country’s young and value-conscious user base, making lower-cost tiers, telecom bundles, and micro-transaction models important for long-term retention.\n\nChatGPT remained the clear market leader in India entering 2026, with 180 million monthly active users in January, per Sensor Tower, followed by Google’s Gemini with 118 million, Perplexity with 19 million, and Meta AI with 12 million. The figures underline both the scale of India’s AI opportunity and the growing challenge for firms to convert rapid user adoption into sustained revenue.\n\nGoogle, OpenAI, and Perplexity did not respond to requests for comments.",
      "excerpt": "Tech giants’ efforts to ramp up AI adoption in India may be about to hit a turning point, as companies end free promotions with hopes to convert the world’s fourth-largest economy into a windfall of paid subscribers.\n\nIndia became the world’s largest market for generative AI app downloads in 2025, a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Self-driving tech startup Wayve raises $1.2B from Nvidia, Uber, and three automakers",
      "link": "https://techcrunch.com/2026/02/24/self-driving-tech-startup-wayve-raises-1-2b-from-nvidia-uber-and-three-automakers/",
      "author": "Kirsten Korosec",
      "date": "2026-02-24T16:37:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Wayve-Germany-02.jpg?resize=1200,675",
      "category": "Transportation",
      "content": "Wayve’s self-driving tech has attracted a diverse set of investors in the company’s latest $1.2 billion funding round, including three automakers, top venture and institutional firms, and returning backers Microsoft, Nvidia, and Uber. The total raise could reach $1.5 billion thanks to another $300 million from Uber contingent on deploying robotaxis, beginning in London.\n\nEveryone, it seems, wants a piece of the U.K. startup, which is now valued at $8.6 billion. The funding round illustrates the eagerness among Big Tech, legacy automakers, and the investor community to profit from the burgeoning automated driving industry.\n\nWayve provides what founder and CEO Alex Kendall calls the “contrarian” option in automated driving — contrarian both in its approach to tech and its business model, he told TechCrunch in an interview Tuesday.\n\n“I think the technology chessboard is set around where different companies have invested on the technology strategy, and now the commercial chessboard is being arranged,” Kendall said. “We took a very contrarian view on the technology side. We were the first to build end-to-end deep learning for autonomous driving, and we pioneered this approach. Now, when it comes to this phase of moving into commercialization, we’re also taking a contrarian business model approach.”\n\nWayve, which launched in 2017, uses a self-learning approach to its software. The company developed a software layer using an end-to-end neural network that doesn’t require high-definition maps and only uses data to teach the vehicle how to drive.\n\nThis data-driven learning approach underpins two products: an “eyes on” assisted-driving system and an “eyes off” fully automated-driving system that could be applied to robotaxis or consumer vehicles that can handle all of the driving in certain environments.\n\nThe company’s pitch to customers is the agnostic nature of its technology, which is not reliant on specific sensors or maps. The automated-driving software captures data from whatever sensors are on the vehicle and directs the system’s driving decisions. Wayve’s software can also run on whatever chip its OEM partners already have in their vehicles.\n\nIt should be noted, however, that Nvidia, which is also a backer, has had a close development relationship with Wayve since 2018. The startup’s Gen 3 platform, which was unveiled last fall, uses an in-vehicle compute autonomous vehicle development kit called Nvidia Drive AGX Thor. The Gen 3 platform will allow Wayve to offer eyes-off advanced driving-assistance systems and Level 4 — or fully driverless — features that will work on city streets and highways.\n\nThe company’s tech is somewhat similar to how Tesla has approached automated driving, although there are key differences in their business models.\n\nWayve doesn’t want to be the operator of its hands-free driving-assistance system or its “eyes-off” fully automated-driving system. (For comparison, Waymo is largely the operator of its robotaxis, although it does have partners.) Nor does Wayve want to build vehicles bundled with its own software, as Tesla does. Instead, it is selling its “embodied AI” to automakers and other tech companies like Uber.\n\nKendall argues that this is the business model with the largest addressable market, but he says it’s only viable because Wayve built an AI that generalizes across different hardware and environments.\n\n“If you build an autonomy stack that’s specific to a sensor or compute architecture, [or] if you build it where it requires mapping or something like this, then you can’t take option three,” Kendall said, referring to the business model his company has chosen.\n\nNissan and Uber are both Wayve customers. Nissan said the startup’s self-driving software will be used to beef up the advanced driver-assistance system in its carsstarting in 2027. Meanwhile, later this year, Uber plans to launch commercial trials in vehicles equipped with Wayve’s software.\n\nIts relationship with Uber appears poised to stretch well beyond a pilot program, though. Uber CEO Dara Khosrowshahi’s statement Tuesday hints at the scope of its partnership with and investment in Wayve.\n\n“We are very proud to continue to deepen our partnership with Wayve, with plans to deploy together in more than 10 markets around the world. Wayve’s powerful end-to-end approach is purpose-built for scale, safety, and effectiveness, and we’re excited to work with them across multiple OEMs and geographies, which we’ll share more about soon.”\n\nThe round was led by Eclipse, Balderton, and SoftBank Vision Fund 2. New investors include the Ontario Teachers’ Pension Plan, Baillie Gifford, British Business Bank, Icehouse Ventures, Schroders Capital, and other global institutional investors, the company said.\n\nGlobal automakers Mercedes-Benz, Nissan, and Stellantis — all of which plan to use Wayve’s technology — also participated. Nvidia, which participated in Wayve’s$1.05 billion Series C round,said last year it was evaluating a $500 million strategic investment in Wayve’s next raise. While Nvidia did participate, Kendall wouldn’t disclose the exact amount of its investment or whether it came close to that $500 million figure.\n\nUpdated to include more information on the $300 million in additional funding from Uber.",
      "excerpt": "Wayve’s self-driving tech has attracted a diverse set of investors in the company’s latest $1.2 billion funding round, including three automakers, top venture and institutional firms, and returning backers Microsoft, Nvidia, and Uber. The total raise could reach $1.5 billion thanks to another $300 m",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic won’t budge as Pentagon escalates AI dispute",
      "link": "https://techcrunch.com/2026/02/24/anthropic-wont-budge-as-pentagon-escalates-ai-dispute/",
      "author": "Rebecca Bellan",
      "date": "2026-02-24T13:18:45-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2194795244.jpg?w=1024",
      "category": "Government & Policy",
      "content": "Anthropic has until Friday evening to either give the U.S. military unrestricted access to its AI model or face the consequences, reportsAxios.\n\nDefense Secretary Pete Hegseth told Anthropic CEO Dario Amodei in ameeting Tuesday morningthat the Pentagon will either declare Anthropic a “supply chain risk” — a designation usually reserved for foreign adversaries — or invoke the Defense Production Act (DPA) to force the company to tailor a version of the model to the military’s needs.\n\nThe DPA gives the president the authority to force companies to prioritize or expand production for national defense. It was recently invoked during the COVID-19 pandemic to compel companies like General Motors and 3M to produce ventilators and masks, respectively.\n\nAnthropic has long stated that it doesn’t want its technology used for mass surveillance of Americans or for fully autonomous weapons — and is refusing to compromise on these points.\n\nPentagon officials have argued the military’s use of technology should be governed by U.S. law and constitutional limits, not by the usage policies of private contractors.\n\nUsing the DPA in a dispute over AI guardrails would mark a significant expansion of the law’s modern use. It would also reflect an expansion of a broader pattern of executive branch instability that has intensified in recent years, according to Dean Ball, senior fellow at the Foundation for American Innovation and former senior policy advisor on AI in Trump’s White House.\n\n“It would basically be the government saying, ‘If you disagree with us politically, we’re going to try to put you out of business,’” Ball said.\n\nThe dispute unfolds against a backdrop of ideological friction, with some in the administration — including AI czar David Sacks — publicly criticizingAnthropic’s safety policies as “woke.”\n\n“Any reasonable, responsible investor or corporate manager is going to look at this and think the U.S. is no longer a stable place to do business,” Ball said. “This is attacking the very core of what makes America such an important hub of global commerce. We’ve always had a stable and predictable legal system.”\n\nIt’s a serious game of chicken, and Anthropic may not be the one to blink first. According toReuters, Anthropic doesn’t plan on easing its usage restrictions.\n\nAnthropic is the only frontier AI lab with classified DOD access, according to several reports. The Department of Defense doesn’t have a backup option currently in play — though the Pentagon hasreportedlyreached a deal to use xAI’s Grok in classified systems.\n\nThat lack of redundancy may help explain the Pentagon’s aggressive posture, Ball argued.\n\n“If Anthropic canceled the contract tomorrow, it would be a serious problem for the DOD,” he told TechCrunch, noting the agency appears to be falling short of aNational Security Memorandumfrom the late Biden administration that directs federal agencies to avoid dependence on a single classified-ready frontier AI system.\n\n“The DOD has no backups. This is a single-vendor situation here,” he continued. “They can’t fix that overnight.”\n\nTechCrunch has reached out to Anthropic and the DOD for comment.",
      "excerpt": "Anthropic has until Friday evening to either give the U.S. military unrestricted access to its AI model or face the consequences, reportsAxios.\n\nDefense Secretary Pete Hegseth told Anthropic CEO Dario Amodei in ameeting Tuesday morningthat the Pentagon will either declare Anthropic a “supply chain r",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Instagram head pressed on lengthy delay to launch teen safety features, like a nudity filter, court filing reveals",
      "link": "https://techcrunch.com/2026/02/24/instagram-head-pressed-on-lengthy-delay-to-launch-teen-safety-features-like-a-nudity-filter-court-filing-reveals/",
      "author": "Sarah Perez",
      "date": "2026-02-24T12:35:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1237098710.jpeg?resize=1200,800",
      "category": "Social",
      "content": "Prosecutors in a lawsuit focused on whether or not social media apps, like Instagram, are addictive and harmful, wanted to know why it took so long for Meta to roll out basic safety tools, like a nudity filter for private messages sent to teens. In April 2024, Metaintroduceda feature that would automatically blur explicit images in Instagram DMs — something the company reportedly understood to be an issue nearly six years prior.\n\nIn a newly unsealed deposition in a federal lawsuit, Instagram head Adam Mosseri was asked about an August 2018 email chain with Meta VP and Chief Information Security OfficerGuy Rosen, where he mentioned that “horrible” things could happen via Instagram private messages, also known as DMs. Those horrible things could include dick pics, the plaintiff’s lawyer said, and Mosseri agreed.\n\nHowever, the Meta exec pushed back at the line of questioning that suggested the company should have informed parents that its messaging system wasn’t monitored, beyond removing CSAM (Child Sexual Abuse Material).\n\n“I think that it’s pretty clear that you can message problematic content in any messaging app, whether it’s Instagram or otherwise,” Mosseri said. He said the company tried to balance people’s interest in privacy with its own interests in safety.\n\nThe testimony also revealed new stats about harmful activity on Instagram, revealing that 19.2% of survey respondents ages 13 to 15 said they had seen nudity or sexual images on Instagram that they didn’t want to see. In addition, 8.4% of 13- to 15-year-olds said they had seen someone harm themselves or threaten to do so on Instagram over the past seven days they used the app.\n\nWhile a nudity filter is only one of several updates that have been added to Instagram in recent years to protect teens, prosecutors were more interested in its delay to act, rather than whether the app is safer for teens now.\n\nMosseri was also questioned on other topics, like an email from a Facebook intern in 2017, who said that he wanted to find “addicted” Facebook users and figure out if there were ways to help them.\n\nThe 2018 email chain was meant to serve as one example that Meta was aware of the risks to minors, but it took the company until 2024 to release a product that addressed the problem of sexual images sent to teens. This includes those images sent by adults who may have engaged in grooming, a process in which an adult builds trust with a minor over time to manipulate or sexually exploit them.\n\nReached for comment, Meta spokesperson Liza Crenshaw pointed to the other ways the company has worked to keep teens safe over the years, noting that, “for over a decade, we’ve listened to parents, worked with experts and law enforcement, and conducted in-depth research to understand the issues that matter most. We use these insights to make meaningful changes—like introducing Teen Accounts with built-in protections and providing parents with tools to manage their teens’ experiences. We’re proud of the progress we’ve made, and we’re always working to do better,” she said.\n\nThe deposition provided by Mosseri took place during one of what are nowseveral lawsuitslooking to hold big tech accountable for harming teens. Thisparticular case, taking place in the U.S. District Court in the Northern District of California, involves plaintiffs alleging that social media platforms are defective because they’re designed to maximize screen time, which encourages addictive behavior in teens. The defendants include Meta, Snap, TikTok, and YouTube (Google).\n\nSimilar lawsuits are also underwayin the Los Angeles County Superior Courtandin New Mexico.\n\nLawyers across the cases are hoping to prove that the big tech companies prioritized the need for user growth and increased engagement over the potential harms impacting their youngest users.\n\nThe timing of these trials comes amid a growing number of laws restricting social media teen use, both in several U.S. states and abroad.\n\nUpdated after publication with Meta’s comment.",
      "excerpt": "Prosecutors in a lawsuit focused on whether or not social media apps, like Instagram, are addictive and harmful, wanted to know why it took so long for Meta to roll out basic safety tools, like a nudity filter for private messages sent to teens. In April 2024, Metaintroduceda feature that would auto",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Apple rolls out age-verification tools worldwide to comply with growing web of child safety laws",
      "link": "https://techcrunch.com/2026/02/24/apple-rolls-out-age-verification-tools-worldwide-to-comply-with-growing-web-of-child-safety-laws/",
      "author": "Sarah Perez",
      "date": "2026-02-24T15:21:54-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/03/apple-app-store-ios-2021.jpg?w=1180",
      "category": "Apps",
      "content": "Apple is launching new tools to comply with the growing number of age-verification laws both in the U.S. and abroad. As part of the changes, Apple will block the downloads of apps rated 18+ in Brazil, Australia, and Singapore, while also rolling out other features to comply with laws in Utah and Louisiana in the U.S.\n\nThe companyinformed developerson Tuesday that it’s expanding its set of “age assurance” tools, including an updated Declared Age Range API now available for beta testing.\n\nThesetools allow developers to obtain a user’s age rangewithout gaining access to the user’s personal information, like their date of birth. The need for a technical solution like this came about as more governments around the world have created laws to block or restrict certain apps like social media that can only be used by adults 18 and up.\n\nIn Brazil, for example, developers can use the Declared Age Range API to obtain the user’s age category, if the user or their parent or guardian chooses to share it.\n\nIn addition, Apple will block users in Australia, Brazil, and Singapore from downloading apps rated 18+, starting today, until they confirm they are adults. In this case, the App Store will perform the age confirmation automatically, but Apple notes that developers may still have separate compliance requirements they need to meet.\n\nAlso, developers whose games contain loot boxes — a gambling-like mechanism that lets players spend money for a random chance at in-game rewards and that lawmakers believe shouldn’t be available to kids — will see their apps’ age ratings updated to reflect an 18+ audience in Brazil, specifically.\n\nIn the U.S., new users in Utah and Louisiana will soon have their age categories shared with their developers’ apps through the Declared Age Range API as well. The company said it has expanded its other tools around age ratings and permissions to meet its compliance obligations.\n\n“New signals are now available through the Declared Age Range API, including whether age-related regulatory requirements apply to the user and if the user is required to share their age range,” reads the Apple blog post. “The API will also let you know if you need to get a parent or guardian’s permission for significant app updates for a child.”\n\nApple last October worked to comply with similar age-assurance requirements in Texas butput some of its plans on hold back in December,as the state’s law is being fought in court. It alsoupdated its age ratings system last yearwith more granular age ranges than before and added a variety of new questions for developers submitting apps to Apple for review.",
      "excerpt": "Apple is launching new tools to comply with the growing number of age-verification laws both in the U.S. and abroad. As part of the changes, Apple will block the downloads of apps rated 18+ in Brazil, Australia, and Singapore, while also rolling out other features to comply with laws in Utah and Lou",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Final 4 days to save up to $680 on your TechCrunch Disrupt 2026 pass",
      "link": "https://techcrunch.com/2026/02/24/final-4-days-to-save-up-to-680-on-your-techcrunch-disrupt-2026-pass/",
      "author": "TechCrunch Events",
      "date": "2026-02-24T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/TCD26_4Days-16X9-Dark.png?resize=1200,675",
      "category": "Startups",
      "content": "You don’t attendTechCrunch Disruptto sit in the audience. You go to gain leverage. If 2026 is a build year, a fundraise year, a hiring year, or a scale year, this is where momentum compounds.\n\nWith just 4 days left before Super Early Bird pricing ends on February 27 at 11:59 p.m. PT, this is your opportunity to save up to $680 on your pass and secure your spot at the center of the tech ecosystem.Register here to save.\n\nFrom October 13 to 15 at Moscone West, 10,000+ founders, operators, and VCs will converge for three days of high-signal conversations and deal-making. Disrupt is not just content. It is access.\n\nYou get:\n\nLast year alone, more than 20,000 curated meetings took place. In 2026, upgraded networking tools will make those connections even more targeted and efficient. One conversation can change your trajectory. AtDisrupt, that is the point.\n\nDisrupt has long been a stage for founders and investors who define eras. These are the kinds of voices that are candid, tactical, and often unfiltered. Previous speakers have included leaders of category-defining startups and top-tier venture firms, including:\n\nIn 2025, Disrupt featured 200+ onstage conversations with 250+ leaders shaping AI, venture capital, hardware, growth strategy, and more. Expect that same caliber of insight in 2026. Keep an eye on theevent pageas the agenda rolls out.\n\nStartup Battlefieldreturns with 200 pre-Series A companies competing for $100,000 in equity-free funding, global visibility, and direct investor access. Alumni include Discord, Cloudflare, and Trello.\n\nIf you want to see what and who is next, and hear directly from top VCs on what it takes to scale a viable startup, the Disrupt stage is where it happens.\n\nMore than 300 startup exhibitorswill showcase new products across the venue, especially in the Expo Hall, where deal flow and discovery collide. You are not just observing trends. You are seeing them before they scale.\n\nFrom October 11 to 17, TechCrunch Disrupt Side Events take place across the Bay Area, including breakfasts, cocktail hours, panels, and founder meetups that extend the connections beyond the main stage. The main event is powerful. The surrounding ecosystem makes it even stronger.\n\nSuper Early Bird pricing ends February 27 at 11:59 p.m. PT. If you plan to be in the rooms where capital moves, companies scale, and ideas turn into industries, now is the time to lock it in.\n\nRegister now:",
      "excerpt": "You don’t attendTechCrunch Disruptto sit in the audience. You go to gain leverage. If 2026 is a build year, a fundraise year, a hiring year, or a scale year, this is where momentum compounds.\n\nWith just 4 days left before Super Early Bird pricing ends on February 27 at 11:59 p.m. PT, this is your op",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "More startups are hitting $10M ARR in 3 months than ever before",
      "link": "https://techcrunch.com/2026/02/24/more-startups-are-hitting-10m-arr-in-3-months-than-ever-before/",
      "author": "Julie Bort",
      "date": "2026-02-24T11:39:36-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/01/GettyImages-582759168.jpg?resize=1200,800",
      "category": "Startups",
      "content": "AI has brought the startup world the rise of a new phenomenon: startups that almost instantly hit multimillion-dollar ARR (annual recurring revenue).\n\nStories abound of founders going from zero to $10 million, or as much as $100 million, in annual recurring revenuein a matter of months.\n\nTo be fair, this alone isn’t a harbinger of long-term success. VCs say thatdurable growthis far more important than ultra-speedy growth. Investors want to back companies where the rate at which customers cancel or stop paying is low, meaning customers are happy. They want that annual or monthly recurring revenue to stick around and grow, not wobble and crash.\n\nEven so, the phenomenon is real. As part of Stripe’s annual report,releasedon Tuesday, the payments giant revealed that it had more new businesses start using its products in 2025 than ever before, with more than half — specifically 57% — outside the United States. This 2025 cohort grew 50% faster than those who started using Stripe products in 2024, it said. While Stripe did not reveal the hard numbers, it did say that 2025 saw double the number of these fledging startups hit $10 million in ARR within three months compared to the number that did so in 2024.\n\nThe letter also noted that Stripe Atlas —  the company’s business incorporation tool  — saw a 41% increase in company formations last year. Of those new startups, 20% charged their first customer within 30 days, up from just 8% in 2020, further underscoring how quickly this new generation of founders is moving.\n\nIn comparison, in 2024, founders were stillpublicly celebratinghitting $10 million in ARR in three years — which is still, by most business standards, a metric worth boasting about.\n\nSo for all of those on social mediasaying things like, “Bootstrapping to $10M ARR is easier and less risky than creating a VC-backed unicorn, ” orthings like, “the AI-native startups hitting $10M ARR with just three people are rewriting the entire playbook,” well, now there’s a smattering of data to back that up.",
      "excerpt": "AI has brought the startup world the rise of a new phenomenon: startups that almost instantly hit multimillion-dollar ARR (annual recurring revenue).\n\nStories abound of founders going from zero to $10 million, or as much as $100 million, in annual recurring revenuein a matter of months.\n\nTo be fair,",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "It’s time to pull the plug on plug-in hybrids",
      "link": "https://techcrunch.com/2026/02/24/its-time-to-pull-the-plug-on-plug-in-hybrids/",
      "author": "Tim De Chant",
      "date": "2026-02-24T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/porsche-cayenne-plug-in-hybrid.jpg?resize=1200,676",
      "category": "Transportation",
      "content": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’ onboard computers shows that’s often not the case.\n\nUsing that data, the Fraunhofer Institute could determine how much of that energy came from charging when plugged in. Itfound thatless than a third of 1 million PHEVs in Germany plugged in either occasionally or not at all.\n\nU.S. automakers that are pushing future PHEV models as appealing alternatives for American drivers should take note. By blending gas with electricity, these automakers hope to boost fleet-wide efficiency without a wide rollout of EVs.\n\n“We’re looking to make CO2reductions across our lineup, but we’re doing it in a very efficient way,” Ford CEO Jim Farleysaid this monthin an earnings call.\n\nYet the new study shows that PHEVs seldom deliver on their efficiency promises.\n\nAt best, Toyota drivers used electricity for 44% of the energy used for driving, suggesting they plugged in the most frequently. The worst? Porsche drivers, at just 0.8%, an average of 7 kilowatt-hours over two years. In other words, the average Porsche PHEV driver charged their battery less than 50% of its capacity — once.\n\nStudies have previously shown that PHEVs produce about3.5 times more emissionsthan their official ratings would suggest. This new study explains why since it directly assesses how much electricity the vehicles gained from charging. (PHEVs, like all hybrids, can operate in a mixed mode, using both gas and electricity. The study used data straight off the vehicles to disentangle the two.)\n\nOne of PHEV’s many shortcomings are their anemic batteries, capable of powering the vehicle for short distances. Some can only traverse a handful of miles, while many sold in recent years can operate on battery power for about 20 to 30 miles. Regulators in Europe and automakers have been proposing longer ranges for future models, hoping that a more capable battery will encourage people to charge their batteries more frequently.\n\nThat’s not guaranteed, though. The vehicles are likely to remain compromised when driving on electrons. That’s because most PHEVs are based on fossil fuel platforms — the electric motors and power electronics aren’t capable of delivering 100% of the vehicle’s power needs. When a driver floors it, the gas engine has to kick in. In other vehicles, the engine turns on in cold weather to heat the cabin. When that happens, “why bother plugging in” is apparently a question most PHEV drivers have asked themselves.\n\nWhich raises another question: Why bother with PHEVs at all?\n\nPHEVs have been touted as a way to ease cautious consumers into full EVs. The argument goes something like this: Drivers will become habituated with plugging in while EV charging networks are built out. By the time they’re ready for their next vehicle, the networks will be ready and customers can ease into an EV.\n\nBut if nobody is plugging in their PHEVs, they’re definitely not developing the habit. Without full charges, the electric drivetrain isn’t benefiting anyone. The public still suffers from worse air pollution, and drivers are carting around hundreds of pounds of weight and enduringmore recallsand costlier service visits as a result of the complex drivetrain.\n\nTweaking the PHEV formula to make them more reliant on batteries could help. The interim solution is called an extended-range electric vehicle (EREV), and it’s designed to run on battery power until the charge is depleted, at which point the fossil fuel engine recharges it. So far, no EREV has required the owner to plug in — they could easily drive the vehicle for its lifetime on gas. BMW used to make an EREV in the i3, but it stopped production years ago. Ford and Stellantis have both announced EREV pickup trucks, which have yet to go on sale.\n\nMeanwhile, EV charging networkscontinue to expand. It’s possible that by the time automakers are making PHEVs and EREVs in large quantities, drivers will no longer need a comfort blanket in the form of a gas engine. (My household came to that conclusion two years ago. After a decade split between a BMW i3 EREV and a Chrysler Pacifica Hybrid PHEV, we traded up for a Kia EV9.)\n\nLegacy automakers, which have second-guessed their electrification strategies more times than I care to count, could be forced to change tack once more.\n\nPHEVs might have been a nifty solution on paper, but they’ve failed to deliver in the real world.",
      "excerpt": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Nvidia challenger AI chip startup MatX raised $500M",
      "link": "https://techcrunch.com/2026/02/24/nvidia-challenger-ai-chip-startup-matx-raised-500m/",
      "author": "Marina Temkin",
      "date": "2026-02-24T16:45:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/09/chip-manufacturing-getty.jpg?w=1200",
      "category": "",
      "content": "MatX, a chip startup founded by two former Google hardware engineers, has raised a $500 million Series B led by Jane Street and Situational Awareness, an investment fund formed by former OpenAI researcher Leopold Aschenbrenner.\n\nThe company’s goal is to make its processors 10 times better at training LLMs and delivering results than Nvidia’s GPUs.\n\nOther investors in the round include Marvell Technology, NFDG, Spark Capital, and Stripe co-founders Patrick Collison and John Collison, the startup’s founder and CEO Reiner Pope announced Tuesday in apost on LinkedIn.\n\nAlthough the company didn’t release its latest valuation, Etched, MatX’s closest competitor, raised a $500 million round at a$5 billion valuation, Bloomberg reported last month. Etched didn’t immediately respond to a request for comment.\n\nMatX’s latest round comes more than a year after its Series A of about $100 million, which was led by Spark Capital. TechCrunch earlier reported that the 2024 round valued the startup at more than$300 million.\n\nBefore co-foundingMatXin 2023, Pope led AI software development for Google’s TPUs, the tech giant’s proprietary AI chips. His co-founder, Mike Gunter, was a lead designer of the TPU hardware before leaving to launch the startup.\n\nThe new funding will help MatX produce its chips with TSMC, with plans to start shipping them in 2027.",
      "excerpt": "MatX, a chip startup founded by two former Google hardware engineers, has raised a $500 million Series B led by Jane Street and Situational Awareness, an investment fund formed by former OpenAI researcher Leopold Aschenbrenner.\n\nThe company’s goal is to make its processors 10 times better at trainin",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Spanish ‘soonicorn’ Multiverse Computing releases free compressed AI model",
      "link": "https://techcrunch.com/2026/02/24/spanish-soonicorn-multiverse-computing-releases-free-compressed-ai-model/",
      "author": "Anna Heim",
      "date": "2026-02-24T15:32:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Multiverse-Computing-Founders-Logo.jpg?resize=1200,800",
      "category": "AI",
      "content": "Large language models have a problem: they are large.Multiverse Computing, a Spanish startup, is addressing this issue with compressed models that aim to close the gap between what frontier models can do and what companies can actually afford to deploy.\n\nThe secret sauce is CompactifAI, a compression technology inspired by quantum computing that the Basque company hasapplied to modelsreleased by OpenAI. As of today, developers can access a newer version of Multiverse’s HyperNova 60B model for free onHugging Face. The company also plans to open source more compressed models in 2026 to support a wider range of use cases.\n\nAccording to Multiverse, its models are smaller, but nearly as potent and accurate. At 32GB, HyperNova 60B is roughly half the size of the model it derives from — OpenAI’s gpt-oss-120b — while boasting lower memory usage and lower latency. The updated version, calledHyperNova 60B 2602, now also better supports ​​tool calling and agentic coding, where inference costs can be high.\n\nOne of the competitors Multiverse claims to have beaten with HyperNova 60B isMistral Large 3, one of the models released byFrench decacorn Mistral AI. But beyond the technological rivalry, the two European AI companies also have a lot in common.\n\nLike Mistral, Multiverse has expanded beyond its home country, with offices in the United States, Canada, and across Europe. Both companies also have enterprise customers. In Multiverse’s case, it names Iberdrola, Bosch, and the Bank of Canada.\n\nAnd while Multiverse is not officially a unicorn yet, it is nowrumored to be raising a fresh €500 million funding roundat a valuation of more than €1.5 billion. In a statement shared with TechCrunch, the company confirmed that active discussions with potential investors toward a new funding round are ongoing, but added it would be premature to comment on valuation or funding size at this stage. Multiverse also declined to comment on reports that its annual recurring revenue (ARR) reached €100 million in January.\n\nIf confirmed, this would still only be a fraction ofOpenAI’s $20 billion ARR; but not that far from Mistral’s, whose ARRsoared to over $400 million, owing in part to growing demand for alternatives to U.S. tech. Similarly, Multiverse positions itselfin its latest press releaseas a company that can “deliver sovereign solutions across the AI stack.”\n\nThese geopolitical undertones recently helped Multiverse securea collaboration with the regional government of Aragón, in northeastern Spain. The Spanish Agency for Technological Transformation (SETT) also participated in the AI startup’s$215 million Series Blast year.Since its inception, Multiverse has also benefited from support from the Basque region — which could very soon count its first unicorn.",
      "excerpt": "Large language models have a problem: they are large.Multiverse Computing, a Spanish startup, is addressing this issue with compressed models that aim to close the gap between what frontier models can do and what companies can actually afford to deploy.\n\nThe secret sauce is CompactifAI, a compressio",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}