{
  "last_updated": "2026-03-01T19:25:11.448900+00:00",
  "articles": [
    {
      "title": "OpenAI reveals more details about its agreement with the Pentagon",
      "link": "https://techcrunch.com/2026/03/01/openai-shares-more-details-about-its-agreement-with-the-pentagon/",
      "author": "Anthony Ha",
      "date": "2026-03-01T08:30:10-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2170386424.jpg?w=1024",
      "category": "Government & Policy",
      "content": "By CEO Sam Altman’s own admission, OpenAI’s deal with the Department of Defense was “definitely rushed,” and “the optics don’t look good.”\n\nAfternegotiations between Anthropic and the Pentagon fell throughon Friday, President Donald Trump directed federal agencies to stop using Anthropic’s technology aftera six-month transition period, and Secretary of Defense Pete Hegseth said he was designating the AI company as a supply-chain risk.\n\nThen,OpenAI quickly announcedthat it had reached a deal of its own for models to be deployed in classified environments. With Anthropic saying it was drawing red lines around the use of its technology in fully autonomous weapons or mass domestic surveillance, and Altman saying OpenAI had the same red lines, there were some obvious questions: Was OpenAI being honest about its safeguards? Why was it able to reach a deal while Anthropic was not?\n\nSo as OpenAI executives defended the agreement on social media, the company also publisheda blog post outlining its approach.\n\nIn fact, the post pointed to three areas where it said OpenAI’s models cannot be used — mass domestic surveillance, autonomous weapon systems, and “high-stakes automated decisions (e.g. systems such as ‘social credit’).”\n\nThe company said that in contrast to other AI companies that have “reduced or removed their safety guardrails and relied primarily on usage policies as their primary safeguards in national security deployments,” OpenAI’s agreement protects its red lines “through a more expansive, multi-layered approach.”\n\n“We retain full discretion over our safety stack, we deploy via cloud, cleared OpenAI personnel are in the loop, and we have strong contractual protections,” the blog said. “This is all in addition to the strong existing protections in U.S. law.”\n\nThe company added, “We don’t know why Anthropic could not reach this deal, and we hope that they and more labs will consider it.”\n\nAfter the post was published,Techdirt’s Mike Masnick claimedthat the deal “absolutely does allow for domestic surveillance,” because it says the collection of private data will comply withExecutive Order 12333(along with a number of other laws). Masnick described that order as “how the NSA hides its domestic surveillance by capturing communications by tapping into lines *outside the US* even if it contains info from/on US persons.”\n\nIna LinkedIn post, OpenAI’s head of national security partnerships Katrina Mulligan argued that much of the discussion around the contract language assumes “the only thing standing between Americans and the use of AI for mass domestic surveillance and autonomous weapons is a single usage policy provision in a single contract with the Department of War.”\n\n“That’s not how any of this works,” Mulligan said, adding, “Deployment architecture matters more than contract language […] By limiting our deployment to cloud API, we can ensure that our models cannot be integrated directly into weapons systems, sensors, or other operational hardware.”\n\nAltman also fielded questions about the deal on X, where headmitted it had been rushedand resulted in significant backlash against OpenAI (to the extent thatAnthropic’s Claude overtook OpenAI’s ChatGPT in Apple’s App Storeon Saturday). So why do it?\n\n“We really wanted to de-escalate things, and we thought the deal on offer was good,” Altman said. “If we are right and this does lead to a de-escalation between the DoW and the industry, we will look like geniuses, and a company that took on a lot of pain to do things to help the industry. If not, we will continue to be characterized as […] rushed and uncareful.”",
      "excerpt": "By CEO Sam Altman’s own admission, OpenAI’s deal with the Department of Defense was “definitely rushed,” and “the optics don’t look good.”\n\nAfternegotiations between Anthropic and the Pentagon fell throughon Friday, President Donald Trump directed federal agencies to stop using Anthropic’s technolog",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SaaS in, SaaS out: Here’s what’s driving the SaaSpocalypse",
      "link": "https://techcrunch.com/2026/03/01/saas-in-saas-out-heres-whats-driving-the-saaspocalypse/",
      "author": "Dominic-Madori Davis",
      "date": "2026-03-01T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/id-work.jpg?resize=1200,828",
      "category": "Venture",
      "content": "One day not long ago, a founder texted his investor with an update: he was replacing his entire customer service team with Claude Code, an AI tool that can write and deploy software on its own. To Lex Zhao, an investor at One Way Ventures, the message indicated something bigger — the moment when companies like Salesforce stopped being the automatic default.\n\n“The barriers to entry for creating software are so low now thanks to coding agents, that the build versus buy decision is shifting toward build in so many cases,” Zhao told TechCrunch.\n\nThe build versus buy shift is only part of the problem. The whole idea of using AI agents instead of people to perform work throws into question the SaaS business model itself. SaaS companies currently price their software per seat — meaning by how many employees log in to use it. “SaaS has long been regarded as one of the most attractive business models due to its highly predictable recurring revenue, immense scalability, and 70-90% gross margins,” Abdul Abdirahman, an investor at the venture firm F-Prime, told TechCrunch.\n\nWhen one, or a handful, of AI agents can do that work — when employees simply ask their AI of choice to pull the data from the system — that per-seat model starts to break down.\n\nThe rapid pace of AI development also means that new tools, like Claude Code or OpenAI’s Codex, can replicate not just the core functions of SaaS products but also the add-on tools a SaaS vendor would sell to grow revenue from existing customers.\n\nOn top of that, customers now have the ultimate contract negotiation tool in their pockets: If they don’t like a SaaS vendor’s prices, they can, more easily than ever before, build their own alternative. “Even if they do not take the build route, this creates downward pressure on contracts that SaaS vendors can secure during renewals,” Abdirahman continued.\n\nWe saw this as early as late 2024, when Klarna announced that it had ditchedSalesforce’s flagship CRM productin favor of its own homegrown AI system. The realization that a growing number of other companies can do the same is spooking public markets, where the stock prices of SaaS giants like Salesforce and Workday have been sliding. In early February, an investor sell-off wiped nearly$1 trillion in market valuefrom software and services stocks, followed byanother billion laterin the month.\n\nExperts are calling it theSaaSpocalypse, with one analyst dubbing it FOBO investing —or fear of becoming obsolete.\n\nYet the venture investors TechCrunch spoke with believe such fears are only temporary.  “This isn’t the death of SaaS,” Aaron Holiday, a managing partner at 645 Ventures, told TechCrunch. Rather, it’s the beginning of an old snake shedding its skin, he said.\n\nThepublic market patternis best illustrated through Anthropic’s recent product launches. The company released Claude Code for cybersecurity, and related stocks dropped. It released legal tools in Claude Cowork AI, and the stock price of the iShares Expanded Tech-Software Sector ETF  — a basket of publicly traded software companies that includes firms like LegalZoom and RELX — also dropped.\n\nIn some ways, this was expected, as SaaS companies had long been overvalued, investors said. It also doesn’t help that these companies did the bulk of their growing during the zero-interest-rate era, which has since ended. The cost of doing business rises when the cost of borrowing money increases.\n\nPublic market investors typically price SaaS companies by estimating future revenue. But there is no telling whether in one year or five years anyone will be using SaaS products to the extent they once did. That’s why every time a new advanced AI tool launches, SaaS stocks feel a tremor.\n\n“This may be the first time in history that the terminal value of software is being fundamentally questioned, materially reshaping how SaaS companies are underwritten going forward,” Abdirahman said.\n\nThat’s because slapping AI features on top of existing SaaS products may not be enough. A horde of AI-native startups isrising at a record pace, having completely redefined what it means to be a software company.\n\nSoftware is now easier and cheaper to build, meaning it’s easier to replicate, Yoni Rechtman, a partner at Slow Ventures, told TechCrunch.\n\nThat’s good news for the next generation of startups, but bad news for the incumbents that spent years building their tech stacks.\n\nOn the other hand, the market also lacks enough time and evidence to show that whatever new business model emerges the SaaS’s wake will be worthwhile. AI companies are sometimes pricing their models based on consumption, meaning customers pay based on how much AI they use, measured in tokens (which each model provider defines slightly differently).\n\nOthers are working on “outcome-based pricing,” where fees are charged based on how well the AI actually works. This, ironically, is the current approach of former Salesforce CEO Bret Taylor’s AI startup, Sierra, aquasi-Salesforce competitorthat offers customer service agents.\n\nThe approach appears, so far, appears to be working. In November,Sierra hit $100 millionin annual recurring revenue in less than two years.\n\nThere was once also the idea that cloud-based software like SaaS sells would never depreciate and that it could last for decades. This is still true in some ways compared to what came before — on-premises software, which companies had to install and maintain on their own servers.\n\nBut being in the cloud doesn’t protect SaaS vendors from an entirely new technology rising to compete: AI.\n\nInvestors are rightfully nervous as AI-native companies pop up, adapt, adopt, and build technology much faster than a traditional SaaS company can move. SaaS companies are, after all, themselves the incumbents, having replaced old-school on-premises vendors in the last era of disruption.\n\nThis SaaSpocalypse calls to mind that Taylor Swift lyric about what happens when “someone else lights up the room” because “people love an ingénue.”\n\n“The most important thing to understand about the SaaS pullback is that it is simultaneously a real structural shift and potentially a market overreaction,” Abdirahman said, adding that investors typically “sell first and ask questions later.”\n\nPublic-market SaaS companies aren’t the only ones feeling a chill from investors.\n\nA Crunchbase report released Wednesday showed that, thoughthe IPO market seems to be thawing for some sectors, there haven’t been — and aren’t expected to be — any venture-backed SaaS filings on the horizon.\n\nHoliday said this may be because there is a lot of pressure on large, private, late-stage SaaS companies like Canva and Rippling given the persnickety IPO window, high expectations driven by AI advancements, and the unsteady stock price of already public SaaS companies.\n\nSome of these companies, including mid-size SaaS companies, have even struggled to raise extension rounds in the private market, Holiday said, over the same fears public investors have.\n\n“Nobody wants to be subjected to the volatility of public markets when sentiment can send companies into downward tailspins,” Rechtman said, adding he expects to see companies like these to stay private for much longer.\n\nMeanwhile, the public market waits to get a good look at the finances of the first AI-native companies hoping to IPO. The scuttlebutt says that bothOpenAIandAnthropicare contemplating IPOs, maybe even later this year.\n\nThe most likely outcome is something that weaves the old and the new together, as tech disruptions always have.\n\nHoliday said most of the new features companies are toying with these days “won’t stick” and that enterprises will always need software that meets compliance regulations, supports audits, manages workflow, and offers durability.\n\n“Durable shareholder value isn’t built on hype,” he continued. “It’s built on fundamentals, retention, margins, real budgets, and defensibility.”",
      "excerpt": "One day not long ago, a founder texted his investor with an update: he was replacing his entire customer service team with Claude Code, an AI tool that can write and deploy software on its own. To Lex Zhao, an investor at One Way Ventures, the message indicated something bigger — the moment when com",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The trap Anthropic built for itself",
      "link": "https://techcrunch.com/2026/02/28/the-trap-anthropic-built-for-itself/",
      "author": "Connie Loizos",
      "date": "2026-02-28T16:08:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2261854833.jpg?resize=1200,800",
      "category": "AI",
      "content": "On Friday afternoon, just as this interview was getting underway, a news alert flashed across my computer screen: the Trump administration was severing ties with Anthropic, the San Francisco AI company founded in 2021 by Dario Amodei. Defense Secretary Pete Hegseth soon after invoked anational security lawto blacklist the company from doing business with the Pentagon after Amodei refused to allow Anthropic’s tech to be used for mass surveillance of U.S. citizens or for autonomous armed drones that could select and kill targets without human input.\n\nIt was a jaw-dropping sequence of events. Anthropic stands to lose a contract worth up to $200 million and could be barred from working with other defense contractors after President Trump posted on Truth Social directing every federal agency to “immediately cease all use of Anthropic technology.” (Anthropic has since said it willchallenge the Pentagon in court.)\n\nMax Tegmark has spent the better part of a decade warning that the race to build ever-more-powerful AI systems is outpacing the world’s ability to govern them. The MIT physicist founded theFuture of Life Institutein 2014 and in 2023 helped organize anopen letter— ultimately signed by more than 33,000 people, including Elon Musk — calling for a pause in advanced AI development.\n\nHis view of the Anthropic crisis is unsparing: the company, like its rivals, has sown the seeds of its own predicament. Tegmark’s argument doesn’t begin with the Pentagon but with a decision made years earlier — a choice, shared across the industry, to resist regulation. Anthropic, OpenAI, Google DeepMind and others have long promised to govern themselves responsibly. Anthropic this week even dropped thecentral tenet of its own safety pledge— its promise not to release increasingly powerful AI systems until the company was confident they wouldn’t cause harm.\n\nNow, in the absence of rules, there’s not a lot to protect these players, says Tegmark. Here’s more from that interview, edited for length and clarity. You can hear the full conversation this coming week on TechCrunch’sStrictlyVC Downloadpodcast.\n\nWhen you saw this news just now about Anthropic, what was your first reaction?\n\nThe road to hell is paved with good intentions. It’s so interesting to think back a decade ago, when people were so excited about how we were going to make artificial intelligence to cure cancer, to grow the prosperity in America and make America strong. And here we are now where the U.S. government is pissed off at this company for not wanting AI to be used for domestic mass surveillance of Americans, and also not wanting to have killer robots that can autonomously — without any human input at all — decide who gets killed.\n\nAnthropic has staked its entire identity on being a safety-first AI company, and yet it was collaborating with defense and intelligence agencies [dating back to at least 2024]. Do you think that’s at all contradictory?\n\nIt is contradictory. If I can give a little cynical take on this — yes, Anthropic has been very good at marketing themselves as all about safety. But if you actually look at the facts rather than the claims, what you see is that Anthropic, OpenAI, Google DeepMind and xAI have all talked a lot about how they care about safety. None of them has come out supporting binding safety regulation the way we have in other industries. And all four of these companies have now broken their own promises.\n\nFirst we had Google — this big slogan, “Don’t be evil.” Then they dropped that. Then they dropped another longer commitment that basically said they promised not to do harm with AI. They dropped that so they could sell AI for surveillance and weapons. OpenAI just dropped the word safety from their mission statement. xAI shut down their whole safety team. And now Anthropic, earlier in the week, dropped their most important safety commitment — the promise not to release powerful AI systems until they were sure they weren’t going to cause harm.\n\nHow did companies that made such prominent safety commitments end up in this position?\n\nAll of these companies, especially OpenAI and Google DeepMind but to some extent also Anthropic, have persistently lobbied against regulation of AI, saying, “Just trust us, we’re going to regulate ourselves.” And they’ve successfully lobbied. So we right now have less regulation on AI systems in America than on sandwiches. You know, if you want to open a sandwich shop and the health inspector finds 15 rats in the kitchen, he won’t let you sell any sandwiches until you fix it. But if you say, “Don’t worry, I’m not going to sell sandwiches, I’m going to sell AI girlfriends for 11-year-olds, and they’ve been linked to suicides in the past, and then I’m going to release something called superintelligence which might overthrow the U.S. government, but I have a good feeling about mine” — the inspector has to say, “Fine, go ahead, just don’t sell sandwiches.”\n\nThere’s food safety regulation and no AI regulation.And this, I feel, all of these companies really share the blame for. Because if they had taken all these promises that they made back in the day for how they were going to be so safe and goody-goody, and gotten together, and then gone to the government and said, “Please take our voluntary commitments and turn them into U.S. law that binds even our most sloppy competitors” — this would have happened. Instead, we’re in a complete regulatory vacuum. And we know what happens when there’s a complete corporate amnesty: you getthalidomide, you get tobacco companies pushing cigarettes on kids, you get asbestos causing lung cancer. So it’s sort of ironic that their own resistance to having laws saying what’s okay and not okay to do with AI is now coming back and biting them.\n\nThere is no law right now against building AI to kill Americans, so the government can just suddenly ask for it. If the companies themselves had earlier come out and said, “We want this law,” they wouldn’t be in this pickle. They really shot themselves in the foot.\n\nThe companies’ counter-argument is always the race with China — if American companies don’t do such and such, Beijing will. Does that argument hold?\n\nLet’s analyze that. The most common talking point from the lobbyists for the AI companies — they’re now better funded and more numerous than the lobbyists from the fossil fuel industry, the pharma industry and the military-industrial complex combined — is that whenever anyone proposes any kind of regulation, they say, “But China.” So let’s look at that. China is in the process of banning AI girlfriends outright. Not just age limits — they’re looking at banningall anthropomorphic AI. Why? Not because they want to please America but because they feel this is screwing up Chinese youth and making China weak. Obviously, it’s making American youth weak, too.\n\nAnd when people say we have to race to build superintelligence so we can win against China — when we don’t actually know how to control superintelligence, so that the default outcome is that humanity loses control of Earth to alien machines — guess what? The Chinese Communist Party really likes control. Who in their right mind thinks that Xi Jinping is going to tolerate some Chinese AI company building something that overthrows the Chinese government? No way. It’s clearly really bad for the American government too if it gets overthrown in a coup by the first American company to build superintelligence. This is a national security threat.\n\nThat’s compelling framing — superintelligence as a national security threat, not an asset. Do you see that view gaining traction in Washington?\n\nI think if people in the national security community listen to Dario Amodei describe his vision — he’s given a famous speech where he says we’ll soon have acountry of geniuses in a data center— they might start thinking: “Wait, did Dario just use the word country? Maybe I should put that country of geniuses in a data center on the same threat list I’m keeping tabs on, because that sounds threatening to the U.S. government.” And I think fairly soon, enough people in the U.S. national security community are going to realize that uncontrollable superintelligence is a threat, not a tool. This is totally analogous to the Cold War. There was a race for dominance — economic and military — against the Soviet Union. We Americans won that one without ever engaging in the second race, which was to see who could put the most nuclear craters in the other superpower. People realized that was just suicide. No one wins. The same logic applies here.\n\nWhat does all of this mean for the pace of AI development more broadly? And how close do you think we are to the systems you’re describing?\n\nSix years ago, almost every expert in AI I knew predicted we were decades away from having AI that could master language and knowledge at human level — maybe 2040, maybe 2050. They were all wrong, because we already have that now. We’ve seen AI progress quite rapidly from high school level to college level to PhD level to university professor level in some areas. Last year, AI won the gold medal at the International Mathematics Olympiad, which is about as difficult as human tasks get. Iwrote a papertogether withYoshua Bengio,Dan Hendrycks, and other top AI researchers just a few months ago giving a rigorous definition of AGI. According to this, GPT-4 was 27% of the way there. GPT-5 was 57% of the way there. So we’re not there yet, but going from 27% to 57% that quickly suggests it might not be that long.\n\nWhen I lectured to my students yesterday at MIT, I told them that even if it takes four years, that means when they graduate, they might not be able to get any jobs anymore. It’s certainly not too soon to start preparing for it.\n\nAnthropic is now blacklisted. I’m curious to see what happens next — will the other AI giants stand with it and say, “We won’t do this either?” Or does someone like xAI raise their hand and say, “Anthropic didn’t want that contract, we’ll take it”?[Editor’s note: Hours after the interview, OpenAI announced itsown dealwith the Pentagon.]\n\nLast night, Sam Altman came out and said he stands with Anthropic and has the same red lines. I admire him for the courage of saying that. Google, as of when we started this interview, had said nothing. If they just stay quiet, I think that’s incredibly embarrassing for them as a company, and a lot of their staff will feel the same. We haven’t heard anything from xAI yet either. So it’ll be interesting to see. Basically, there’s this moment where everybody has to show their true colors.\n\nIs there a version of this where the outcome is actually good?\n\nYes, and this is why I’m actually optimistic in a strange way. There’s such an obvious alternative here. If we just start treating AI companies like any other companies — drop the corporate amnesty — they would clearly have to do something like a clinical trial before they released something this powerful, and demonstrate to independent experts that they know how to control it. Then we get a golden age with all the good stuff from AI, without the existential angst. That’s not the path we’re on right now. But it could be.",
      "excerpt": "On Friday afternoon, just as this interview was getting underway, a news alert flashed across my computer screen: the Trump administration was severing ties with Anthropic, the San Francisco AI company founded in 2021 by Dario Amodei. Defense Secretary Pete Hegseth soon after invoked anational secur",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Honor launches its new slim foldable Magic V6 with a 6,600 mAh battery",
      "link": "https://techcrunch.com/2026/03/01/honor-launches-its-new-slim-foldable-magic-v6-with-a-6600-mah-battery/",
      "author": "Ivan Mehta",
      "date": "2026-03-01T07:13:09-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Magic-V6-photo.jpg?resize=1200,675",
      "category": "Gadgets",
      "content": "Honor launched its new foldable, the Honor Magic V6, with a massive 6,600 mAh battery and a new sturdy hinge ahead of the Mobile World Congress (MWC) in Barcelona.\n\nThe Chinese company has been obsessed with proving that it makes the thinnest foldables. This year’s version is 4mm thick when unfolded and 8.75 mm thick when folded. Compared tolast year’s Magic V5, which was 4.1 mm thick when unfolded and 8.8 mm thick when folded. We are talking very thin shavings here, but that helps the company make those claims.\n\nThe battery is possibly one of the most impressive parts of the phone. The Honor Magic V6 has a 6,600 mAh battery, up from 5,820 mAh last year. Using Honor’s SuperCharge tech, the phone can charge at 80W through a wired connection, and at 66W wirelessly.\n\nWhat’s more, Honor also showed a new Silicon-carbon battery tech with 32% silicon density that could push foldable phone battery over 7,000 mAh.\n\nThe new device has a 7.95-inch main AMOLED display with 2352 x 2172 pixel resolution and a 6.52-inch cover display with 2420 x 1080 pixel resolution. Both screens support LTPO 2.0, which means they can switch to variable refresh rates between 1-120Hz for different use cases for better content legibility and power saving.\n\nThe company said that it has worked on a new Super Steel Hinge with a tensile strength of 2,800 MPa, which would make for sturdy long-term usage. It also said that it has reduced the crease depth by 44%, making the display look smooth. Honor noted that the Magic V6 has a new anti-reflective coating for the external screen with a reflectivity rating of 1.5%.\n\nThe phone is powered by Qualcomm’s Snapdragon 8 Elite Gen 5 processor, has 16GB RAM, and 512GB of storage. The Magic V6 has three rear cameras: a 50-megapixel main camera with f/1.6 aperture, a 64-megapixel telephoto camera with f/2.5 aperture, and a 50-megapixel ultrawide camera with f/2.2 aperture. On the front, there are dual 20-megapixel cameras with an f/2.2 aperture.\n\nHonor is taking efforts to make the device have file and notification sharing compatibility with Apple devices. For instance, with Honor Magic V6, you can set up a two-way notification sync with an iPhone. Plus, the device also has settings to display notifications on the Apple Watch. The foldable has the ability share files with Macs with one tap, and it can act as an extended display as well.\n\nHonor didn’t specify pricing for the device, but said that the Magic V6 will be released in select international markets in the second half of the year.",
      "excerpt": "Honor launched its new foldable, the Honor Magic V6, with a massive 6,600 mAh battery and a new sturdy hinge ahead of the Mobile World Congress (MWC) in Barcelona.\n\nThe Chinese company has been obsessed with proving that it makes the thinnest foldables. This year’s version is 4mm thick when unfolded",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Why did Netflix back down from its deal to acquire Warner Bros.?",
      "link": "https://techcrunch.com/2026/02/28/why-did-netflix-back-down-from-its-deal-to-acquire-warner-bros/",
      "author": "Anthony Ha",
      "date": "2026-02-28T14:07:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/02/GettyImages-1240099721.jpeg?resize=1200,800",
      "category": "",
      "content": "Netflix stunned the entertainment world this week when itdeclined to raise its bid for Warner Bros. Discovery, setting the stage for Paramount Skydance to win ownership of the Hollywood studio.\n\nAt the time, Netflix co-CEOs Ted Sarandos and Greg Peters said they were being financially disciplined. Nowreporting in Bloombergoffers more details about why Netflix executives backed down froma bidding war that they seemed to win back in December.\n\nFor one thing, the streaming giant’s shareholders appeared deeply skeptical that the deal was a good one — Netflix’s share price declined 30% since announcing the acquisition, while the subsequent news that it was backing downsent Netflix stock back up nearly 14%. (It also collected a $2.8 billion breakup fee from Paramount.)\n\nFor another, Netflix’s commitment to the deal reportedly wavered after Paramount came in with an increased offer and seemed willing to go several more rounds in a bidding war.\n\nBy the time Sarandos met with Trump administration officials on Thursday, he may already have decided to concede. In fact, since President Donald Trump had previously warned him not to overpay, Sarandos reportedly told him, “I took your advice.”\n\nMeanwhile, employees at Warner Bros. now worry aboutmajor studio layoffsandconservative political pressure on CNN.",
      "excerpt": "Netflix stunned the entertainment world this week when itdeclined to raise its bid for Warner Bros. Discovery, setting the stage for Paramount Skydance to win ownership of the Hollywood studio.\n\nAt the time, Netflix co-CEOs Ted Sarandos and Greg Peters said they were being financially disciplined. N",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Xiaomi launches 17 Ultra smartphone, an AirTag clone, and an ultra slim powerbank",
      "link": "https://techcrunch.com/2026/02/28/xiaomi-launches-17-ultra-smartphone-an-airtag-clone-and-an-ultra-slim-powerbank/",
      "author": "Ivan Mehta",
      "date": "2026-02-28T07:09:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/xiaomi.jpg?resize=1200,600",
      "category": "Hardware",
      "content": "Xiaomi today launched a slew of gadgets ahead of the Mobile World Congress (MWC) in Barcelona including a camera-focused flagship smartphone, an AirTag clone, Xiaomi Watch 5 smartwatch, and an ultra slim power bank.\n\nThe China-based company has partnered with camera maker Leica to co-brand its Xiaomi 17 Ultra smartphone. As part of the partnership, it is using Leica lenses and creating filters in the style of the German camera company.\n\nThe phone has a 50-megapixel main sensor with an F/1.67 aperture and a 1-inch sensor. But the main attraction is the 200-megapixel telephoto camera that has a variable focal length of 75mm-100mm equivalent. That means you can zoom optically between 3.2x and 4.3x. The phone also has a 50 MP ultrawide camera with an f/2.2 aperture.\n\nAlso notable: The phone packs a 6,000 mAh battery (the Chinese version comes with a bigger 6,800mAh battery). The phone could be charged using a 90W USB PD-PPS, and it supports Xiaomi’s Hypercharge wireless tech at 50W.\n\nThe device has a 6.9-inch Xiaomi HyperRGB OLED display protected by Xiaomi’s own Shield Glass 3.0. The company has picked Qualcomm’s latest Snapdragon 8 Elite Gen 5 processor, which was also used in the recently launched Galaxy S26 series.\n\nThe company is also releasing a special Leica edition phone to celebrate 100 years of the camera company. The device has a durable aluminum-alloy body with a nickel-anodized finish. Xiaomi has also added a Leica theme on the software side.\n\nThe device has a rotating ring that mimics zoom on a physical camera. The special edition also has a “Leica Essential mode,” which has filters that recreate photos in the style of Leica M9 and Leica M3.\n\nXiaomi launched the Xiaomi 17 with a larger 6,330 mAh battery, which can be charged at 100W using  the company’s HyperCharge tech.\n\nThe company is also launching two photography add-ons for the Xiaomi 17 Ultra. The 17 Ultra Photography Kit is a Bluetooth-connected snap-on that has a two-stage shutter button and a video recording button.The Xiaomi 17 Ultra Photography Kit Pro aims to mimic a physical camera with a leather finish, a video recording button, a detachable shutter button, and zoom control. This kit snaps on using a USB-C connection and also has a 2,000 mAh battery for its operation. Using this add-on, users can also use a new fastshot mode on the phone.\n\nThrough this launch, the company is making these devices available in the EU and the UK. The Xiaomi 17 starts at €999, and the Xiaomi 17 Ultra starts at €1,499. The Leica edition comes with 16GB RAM and 1TB storage, and is priced at  €1,999. The Xiaomi 17 Ultra Photography Kit is priced at €99.99, and the Xiaomi 17 Ultra Photography Kit Pro is priced at €199.99.\n\nApart from phones, the company also launched a bunch of other devices, including a scooter. Xiaomi said that its Electric Scooter 6 Ultra has 1200W peak power and 75km of range. The scooter has 12-inch all-terrain tires with front and rear disc brakes. It has a three-inch TFT display to measure things like speed and range. The scooter starts at €329.99 with five different versions, with the top version priced at €799.99.\n\nThe company also launched a new Xiaomi tag, an AirTag-like device, which works with both Apple Find My and Google Android Find Hub. The tag weighs just 10 grams and has a button cell battery that lasts over a year. You can also play a sound remotely to find the tag or the time at which the tag is attached. The company is pricing this tag at €14.9 for one and €49.99 for a pack of four.\n\nWhat’s more, the company released a slim power bank with just 6mm of thickness. The powerbank weighs 98 grams and has a 5,000 mAh battery capacity. It can charge devices at 22.5W through a wired connection and at 15W through a wireless connection. The powerbank is magnetic, so it can stick to supporting phones like iPhones, and charge them wirelessly. The powerbank is priced at €59.99 for black and silver colorways. It also has an orange colorway priced at €64.99.\n\nXiaomi launched its new smartphone, Xiaomi Watch 5, with a 930mAh battery that could last up to six days. The smartwatch has a round 1.54-inch AMOLED display and supports gestures to dismiss calls or alarms. The watch can also prepare a health report in 60 seconds by using metrics like heart rate, blood oxygen, stress levels, sleep duration, sleep heart rate, and sleep SpO₂. The watch is priced at €299.99.\n\nThe company also launched a €69.9 Redmi Buds 8 Pro earbuds with active noise cancellation and up to 33 hours of battery life.",
      "excerpt": "Xiaomi today launched a slew of gadgets ahead of the Mobile World Congress (MWC) in Barcelona including a camera-focused flagship smartphone, an AirTag clone, Xiaomi Watch 5 smartwatch, and an ultra slim power bank.\n\nThe China-based company has partnered with camera maker Leica to co-brand its Xiaom",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Why China’s humanoid robot industry is winning the early market",
      "link": "https://techcrunch.com/2026/02/28/why-chinas-humanoid-robot-industry-is-winning-the-early-market/",
      "author": "Kate Park",
      "date": "2026-02-28T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-1287582736.jpg?resize=1200,657",
      "category": "Hardware",
      "content": "China’s humanoid robots grabbedglobal attentionwith kung fu flips at the nation’s televised Spring Festival Gala, while Chinese phone maker Honor is set tounveil its first humanoid robotat MWC in Spain.\n\nRobotics was flagged as a priority under the country’s“Made in China 2025” plan, albeit originally focused on factory automation, rather than humanoids. Now, rapid advances in multimodal AI are accelerating so-called embodied AI — autonomous machines operating in the real world — a push officials say could help offset labor shortages and drive productivity gains.\n\nAt this early stage of humanoid robot development, Chinese companies are outpacing their U.S. rivals in both speed and volume, Selina Xu, a China and AI policy lead at the office of Eric Schmidt said.\n\n“China has a more robust hardware supply chain — much of it built up through the EV sector, from sensors to batteries — and the world’s strongest manufacturing base, allowing companies to iterate far faster than Western competitors,” Xu told TechCrunch.\n\nAs a result, not only are Chinese robots cheaper but companies can also release new models more quickly, Xu noted, adding that leading Chinese player Unitree shipped roughly 36 times more units last year than U.S. rivals Figure and Tesla.\n\nGlobal humanoid robot shipments totaled just 13,317 units last year,according to a Forbesreport released last month. That is a tiny base for an industry expected to nearly double annually and reach 2.6 million units by 2035. (Still, the figures should be viewed with caution. The report notes it remains unclear how many units represent commercial sales versus demo models or pilot deployments, underscoring the early-stage nature of the industry.)\n\nThe top humanoid robot makers by 2025 shipments were led by China’s Agibot and Unitree, followed by UBTech, Leju Robotics, Engine AI, and Fourier Intelligence, underscoring Beijing’s early dominance in the sector.\n\nThe biggest shift recently has been from “demo-driven excitement” to “operations-driven adoption,” Yuli Zhao, chief strategy officer at Galbot, told TechCrunch. Galbot’s humanoid robot, the G1, appeared at this year’s Spring Festival Gala, China’s annual, state-run lunar New Year’s Eve television show, alongside robots fromUnitree Robotics, Noetix, and MagicLab.\n\n“More customers are asking: Can the robot run stably in real environments and actually take work off people’s plates? That practical pull is strengthened in China because policy and industrial strategy encourage automation upgrades, and the manufacturing ecosystem makes iteration extremely fast,” Zhao said.\n\nWhile increased funding toward humanoid startups “has definitely accelerated” the pace of progress, “the most durable adoption comes when you can show reliable and repeatable value in production or service operations, not just a one-off showcase,” Zhao added.\n\nStill, investing helps and Chinese robotics makers are securing it. Last year Unitree was valued at around $3 billion after closing its Series C, with ambitions to reach as much as$7 billion in a future IPO. Meanwhile,Galbothas raised more than $300 million in fresh funding, reportedly pushing its valuation to $3 billion, one of the largest financings in China’s humanoid robotics sector to date.\n\nU.S. companies are moving beyond flashy demos as well to focus on real-world deployments. Plus, they are pursuing their own aggressive goals.U.S. startup Foundation, for instance, plans to build 50,000 humanoid robots by the end of 2027.\n\nBut China is already targeting a mix of affordable mass-market models and high-end applications, rapidly expanding humanoids across industrial, consumer, and rehabilitation sectors, according to a DecemberTrendForce report.\n\nWhen it comes to AI systems and integrated software, it’s still unclear where Chinese humanoid firms truly stand. The industry is largely betting on vision-language-action models and “world models,” but both technologies remain in early stages. Nvidia currently leads the space with its end-to-end humanoid software stack, according to Xu, so naturally most humanoid startups in China are powered by Nvidia’s Orin chips. However, domestic chipmakers are developing homegrown alternatives, she said.\n\nYet humanoid robotics makers are still working on fundamental problems. The challenge is enabling robot foundation models to predict the “next physical state” the robot will face in unpredictable environments, like how large language models predict the next word. But unlike LLMs, humanoid robotics companies can’t simply scrape the internet for training data, Xu said. So most are relying on simulation environments, which generates synthetic data, though real-world data collection remains essential.\n\n“Because of the data scarcity problem, humanoids are still far away from autonomy. The hardware is currently ahead of the software — the robot body can handle a lot more dexterity today than years ago (though it has reliability issues, as we saw with the robots that broke down at humanoid marathons), but the brain is still nascent,” the analyst said.\n\nSafety is a major hurdle for humanoid robots, too. One high-profile accident could trigger public backlash, and China is likely weighing how to roll out the technology quickly without moving too fast. As the industry matures, more regulations are expected.\n\nGiven the lack of data, Zhao believes that demand for humanoids will grow first in fairly contained workplaces.\n\n“Early momentum is likely to be in industrial manufacturing, warehouse logistics, and retail, where tasks are repetitive, hours are long, and processes are clear — creating real demand and ideal conditions for humanoid robots to deliver value at scale,” he said.\n\nHumanoid robot development is not a two-country race. Japan’s robotics ecosystem — from startups to semiconductor heavyweights — istargeting humanoid mass production by 2027. Long a pioneer through projects like Honda’s Asimo, Murata Manufacturing’s Murata Boy, and SoftBank Robotics’ Pepper, Japan leans on precision and advanced control. One area unique to this nation: Humanoid robots are increasingly used in eldercare.\n\nCoral Capital CEO James Riney, who invests in tech companies in Japan, believes Tokyo will continue to thrive in the humanoid robotics industry. “There are three factors likely to drive the adoption of robotics in Japan. One is the labor shortage and the desire to depend less on mass immigration. The second is the widespread cultural view of robots as our friends — more Doraemon vs. Terminator. The third is that Japan is already dominant in many parts of the robotics supply chain.”\n\nHyundai Motor’s Boston Dynamics unitintroduced a new Atlas humanoid for factory use by 2028, with plans to produce up to30,000 units annually in the U.S.as part of its AI-driven robotics push.\n\nStill, for China, government policy, industrial strategy, labor shortages, and private capital are all converging to turbocharge the country’s humanoid robotics push.\n\n“China’s leadership is best understood as a speed-to-scale advantage,” Zhao said. “The ecosystem here compresses the entire cycle — R&D, supply chain, manufacturing, integration, and customer deployment — into a very tight loop. That means humanoid companies can move from prototype to real-world deployment faster, learn from real operations, and iterate at a pace that’s difficult to match elsewhere.”",
      "excerpt": "China’s humanoid robots grabbedglobal attentionwith kung fu flips at the nation’s televised Spring Festival Gala, while Chinese phone maker Honor is set tounveil its first humanoid robotat MWC in Spain.\n\nRobotics was flagged as a priority under the country’s“Made in China 2025” plan, albeit original",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India disrupts access to popular developer platform Supabase with blocking order",
      "link": "https://techcrunch.com/2026/02/27/india-disrupts-access-to-popular-developer-platform-supabase-with-blocking-order/",
      "author": "Jagmeet Singh",
      "date": "2026-02-27T19:51:52-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/supabase.jpg?resize=1200,800",
      "category": "Government & Policy",
      "content": "Supabase, a popular developer database platform, is facing disruptions in India — one of its key markets — has been blocked in India, TechCrunch has learned. New Delhi ordered internet providers to block its website, resulting in patchy access across networks.\n\nThe blocking order was issued on February 24 under Section 69A of India’s Information Technology Act, according to a source familiar with the matter. The provision empowers the government to restrict public access to online content.\n\nThe Indian government did not publicly cite a reason for the move, and it was not immediately clear whether the action was linked to a cybersecurity concern, copyright complaint, or another issue. It was also unclear how long the restrictions would remain in place.\n\nAccess to Supabase has been inconsistent in India over the past several days, with the San Francisco-based companyacknowledging the issuein posts on social media starting Wednesday. While the restrictions were first reported by Supabase on Reliance Industries’ JioFiber network, users have since flagged similar problems across multiple internet providers and telecom networks. In one post on Friday, Supabase tagged India’s IT minister Ashwini Vaishnaw, asking him to intervene and restore access, though the company later removed the message and said in a subsequent update that the site remained blocked for many users in the country.\n\nWe understand many users in India continue to be blocked from accessing Supabase. We acknowledge the difficulties this is causing for our users there. Supabase continues to follow up through all available channels to resolve this issue.We continue to advise affected customers…\n\nAn Indian founder, who asked not to be named to avoid potential repercussions, told TechCrunch they had stopped seeing new user sign-ups from India over the past two to three days. A technology consultant working with local startups, who spoke on condition of anonymity, said they were unable to reliably access Supabase for both development and production purposes.\n\nWhile Supabase suggested workarounds such as switching DNS settings or using a VPN (which reroute internet traffic to bypass local restrictions), the founder said such steps were not practical for most end users.\n\nAt the time of publication, TechCrunch was able to verify that supabase.co remained inaccessible on ACT Fibernet, JioFiber and Airtel connections in New Delhi. However, two users on ACT Fibernet in Bengaluru said they were still able to access the service, suggesting the restrictions may be unevenly implemented.\n\nNotably, Supabase’smain websiteremained accessible in India — but its underlying developer infrastructure did not.\n\nIndia is Supabase’s fourth-largest source of traffic, accounting for about 9% of global visits, according to data from Similarweb, highlighting the potential fallout for the country’s developer ecosystem. The platform’s global traffic jumped more than 111% year over year to about 4.2 million visits in January. In India, visits rose roughly 179% to about 365,000, compared with a 168.5% increase in the U.S. to about 627,000.\n\nThe incident highlights broader concerns about India’s website blocking regime, said Raman Jit Singh Chima, Asia Pacific policy director at Access Now.\n\n“This is a simple fact that has grave consequences for developers and others,” he told TechCrunch. “You don’t know where you can safely run projects without the danger that something might happen where it gets blocked, and suddenly you’re scrambling to find a way.”\n\nIndia has previously faced criticism over broad website blocking measures. In 2014, authorities briefly restrictedaccess to developer platform GitHub, along with services such as Vimeo, Pastebin and Weebly, during a security probe. Users on some Indian networks in 2023 alsoreportedthat a key GitHub content domain had been blocked by certain ISPs, according to earlier reports.\n\nFounded in 2020 by CEO Paul Copplestone and CTO Ant Wilson, Supabase positions itself as an open-source alternative to Firebase built on PostgreSQL. The startup hasgained tractionamid rising interest in so-called “vibe coding” tools and AI-driven app development, and has raised about $380 million across three funding rounds since September 2024, lifting itsvaluation to $5 billion.\n\nIndia’s Ministry of Electronics and IT, as well as telecom providers including ACT Fibernet, Bharti Airtel, and Reliance Jio, did not respond to requests for comment. Copplestone and Wilson also did not respond.",
      "excerpt": "Supabase, a popular developer database platform, is facing disruptions in India — one of its key markets — has been blocked in India, TechCrunch has learned. New Delhi ordered internet providers to block its website, resulting in patchy access across networks.\n\nThe blocking order was issued on Febru",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Polymarket saw $529M traded on bets tied to bombing of Iran",
      "link": "https://techcrunch.com/2026/03/01/polymarket-saw-529m-traded-on-bets-tied-to-bombing-of-iran/",
      "author": "Anthony Ha",
      "date": "2026-03-01T11:05:35-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/03/GettyImages-2259602005.jpg?w=1024",
      "category": "",
      "content": "Prediction market users have made — and profited from — big bets around the bombing of Iran by the U.S. and Israeli military.\n\nOn Polymarket, $529 million was traded on contracts tied to the timing of the attack,according to Bloomberg. An analysis by analytics firm Bubblemaps SA found that six newly-created accounts made a profit of $1 million by correctly betting that the U.S. would strike Iran by February 28 — behavior that could indicate insider trading.\n\nThe bets might merely reflect broader speculation about U.S. intentions in Iran, but Bubblemaps CEO Nicolas Vaiman said the circulation of information “involving war or conflict,” coupled with Polymarket’s anonymity, “can create incentives for informed participants to act early.”\n\nBack in January, analytics firm Polysights alsonotedan apparent spike in bets around the likelihood that Iran’s now-deceased Supreme Leader Ali Khamenei would no longer hold that role by the end of March.\n\nResponding to concerns that such bets might essentially place a financial incentive on assassination,Kalshi CEO Tarek Mansour said, “We don’t list markets directly tied to death. When there are markets where potential outcomes involve death, we design the rules to prevent people from profiting from death.” He added that Kalshi would reimburse all fees from these bets.",
      "excerpt": "Prediction market users have made — and profited from — big bets around the bombing of Iran by the U.S. and Israeli military.\n\nOn Polymarket, $529 million was traded on contracts tied to the timing of the attack,according to Bloomberg. An analysis by analytics firm Bubblemaps SA found that six newly",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Let’s explore the best alternatives to Discord",
      "link": "https://techcrunch.com/2026/03/01/best-discord-alternatives-age-verification-identity-privacy/",
      "author": "Lauren Forristal",
      "date": "2026-03-01T11:00:01-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2022/08/GettyImages-1313854295-e1660738794113.jpg?resize=1200,675",
      "category": "Apps",
      "content": "Social community platform Discord is preparing to require users to verify their age by thesecond half of 2026, and users are concerned about the privacy ofuploading a government ID or face scanto the network. While users can still access most features without verification, many remain uneasy giving more information to a company that suffered abreachlast year that exposed the IDs of around 70,000 users.\n\nFor some users, this is motivation enough to seek out alternative platforms that prioritize security, privacy, or simply offer a different experience. Here’s a look at the most promising Discord alternatives, from open-source and secure options to voice-first platforms built for hardcore gamers.\n\nStoat(formerly Revolt) stands out as the closest Discord alternative in both design and usability. As an open-source project, it gives users more control over their data and appeals to those who value privacy and transparency. Overall, the platform is fairly easy for Discord users to pick up, offering similar text and voice channels as well as community servers.\n\nHowever, Stoat is a relatively new platform (launched in 2021), and still faces growing pains. Recently, it experiencedserver capacity issuesand the occasional lag during user surges. Feature support isn’t yet on par with Discord’s, and onboarding can be slow at times, especially when the platform’s popularity spikes. For those willing to trade a bit of stability for increased privacy, though, Stoat could be worth a try.\n\nFor users who prioritize privacy and control above all else,Elementoffers a compelling alternative. Built on the decentralized Matrix protocol, Element enables users to self-host servers, maintain end-to-end encryption, and federate with other Matrix-based services. This ensures that no single company controls your data.\n\nWhile the setup and interface require a bit more technical savvy than Discord’s, Element is a good choice for users who value secure, decentralized communication.\n\nIf your primary need is high-quality, low-latency voice chat,TeamSpeakis the best alternative to Discord. While it remains popular among competitive gamers for its superior audio and private server hosting, its text chat and media sharing are quite basic. It’s also missing built-in video calls as well as emojis and gifs. So if you don’t mind not having as many features, it’s great for voice-centric groups that don’t need all the bells and whistles.\n\nSimilar to Stoat, TeamSpeak has experienced asurge in new users, prompting the platform to expand its hosting capacity. In February, TeamSpeak introduced two new regions for community creation: “Frankfurt 3” and “Toronto 1.”\n\nMumbleis a free, open-source voice chat application. Like TeamSpeak, it provides high-quality, low-latency audio and allows users to host and customize their own servers. However, its interface is outdated and lacks some of the features found in Discord, making it more ideal for hardcore gamers focused on voice chat rather than community building through video calls, media sharing, or screen sharing.\n\nThose who prefer long-form, organized discussions over rapid-fire chat may findDiscoursemore appealing. As an open-source forum platform, Discourse supports threaded discussions, making it ideal for educational groups, professional teams, and communities that value in-depth conversation. However, users looking for instant messaging, voice, and casual group chats may find it less familiar than Discord.\n\nOther notable mentions include Slack and Microsoft Teams, which serve well for professional and productivity-focused communication.Signalis also a top choice for those who want end-to-endencryption and privacy. Meanwhile, WhatsApp also offers free messaging and group voice calls, though it’s not designed for gaming or large communities.\n\nDiscord recently announced that it will soon implement age verification measures aimed at creating a safer environment, particularly for its younger users. This initiative is designed to ensure users meet the necessary age requirements to access certain features and communities on the platform. Users may be required to verify their age through various methods, which could involve submitting an ID, completing a facial age estimation, or using a credit card.\n\nBy default, all users will experience a “teen-appropriate” setting, and only those verified as adults will have the ability to modify certain settings or access age-restricted content. Adults will be required to verify their status to unblur sensitive content and to access channels and servers designated for an older audience.\n\nAfter recent backlash, Discordpostponed the official launchto the latter half of 2026, adding that 90% of users will not require age verification and can continue using the platform without changes, as many users do not engage with age-restricted content. The platform initially planned to roll out age verification in March.",
      "excerpt": "Social community platform Discord is preparing to require users to verify their age by thesecond half of 2026, and users are concerned about the privacy ofuploading a government ID or face scanto the network. While users can still access most features without verification, many remain uneasy giving ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}