{
  "last_updated": "2026-02-19T19:41:19.894492+00:00",
  "articles": [
    {
      "title": "New York hits the brakes on robotaxi expansion plan",
      "link": "https://techcrunch.com/2026/02/19/new-york-hits-the-brakes-on-robotaxi-expansion-plan/",
      "author": "Kirsten Korosec",
      "date": "2026-02-19T08:53:05-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/09/waymo-robotaxi-fifth-gen.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "Waymo’s big chance to bring its robotaxis to the state of New York has been thwarted — for now.\n\nNew York Governor Kathy Hochul withdrew a proposal that would have amended vehicle and traffic laws to effectively legalize robotaxis in the state outside of New York City. Hochul spokesperson Sean Butler confirmed to TechCrunch that the proposal has been pulled.\n\n“Based on conversations with stakeholders, including in the legislature, it was clear that the support was not there to advance this proposal,” Butler said in an emailed statement. Bloomberg was thefirst to reportthe proposal had been removed.\n\nThe withdrawal is a setback for Waymo which has tried for years — along with other autonomous vehicle (AV) companies — to test and eventually deploy robotaxis in New York.\n\n“We hear from thousands of New Yorkers who have experienced Waymo in other cities and want access to it at home,” Waymo said in a statement emailed to TechCrunch.\n\n“They want the safety, privacy, and comfort that riders in other major cities already enjoy. While we are disappointed by the Governor’s decision, we’re committed to bringing our service to New York and will work with the State Legislature to advance this issue.”\n\n“The path forward requires a collaborative approach that prioritizes transparency and public safety. We will continue to engage constructively with the Governor, the Legislature, and officials around the state to deliver this proven mobility option that New Yorkers are waiting for,” added Waymo’s statement.\n\nHochul had introduced, as part of herbroader budget proposal, a plan to change a state law that mandates drivers keep one hand on the wheel at all times. That law essentially prevents robotaxi companies like Waymo from operating in the state since no human is behind the wheel — if there is a steering wheel at all.\n\nEven if Hochul’s proposal had survived, it would not have opened the floodgates to AV companies. The proposal contained a number of limitations, including that AV companies could not deploy for-hire robotaxi services in any city with more than a million people. AV companies would also need approval from the state’s transportation commissioner, pay a $1 million fee, and show proof of financial security of at least $5 million. The state would have only backed robotaxi pilots in cities or townships where there was a clear demonstration of local support, Butler said.\n\nWith that proposal dead, the state’s existing AV pilot program, which is far more restrictive, is expected to remain. Under the pilot program, companies can seek an exemption to the one-hand on the wheel rule, allowing them to develop and test autonomous vehicles in the state, but not launch commercial robotaxi services.\n\nWaymo is currently testing in New York City, and is allowed to do so through March 31.\n\nNew York City regulators granted a permit last August to Waymo to test its robotaxis in the city. Under that permit, Waymo is allowed to test up to eight of its Jaguar I-Pace vehicles in Manhattan and downtown Brooklyn, as long as there is a human safety operator behind the wheel.\n\nWaymo is active in numerous other states and operates commercial robotaxi services in Atlanta, Austin, Miami, Phoenix, Los Angeles and the San Francisco Bay Area. The company says it provides more than 400,000 paid rides every week and is targeting one million weekly rides by the end of the year.",
      "excerpt": "Waymo’s big chance to bring its robotaxis to the state of New York has been thwarted — for now.\n\nNew York Governor Kathy Hochul withdrew a proposal that would have amended vehicle and traffic laws to effectively legalize robotaxis in the state outside of New York City. Hochul spokesperson Sean Butle",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Zuckerberg grilled in court over social media harms on teens",
      "link": "https://techcrunch.com/2026/02/19/zuckerberg-grilled-in-court-over-social-media-harms-on-teens/",
      "author": "Sarah Perez",
      "date": "2026-02-19T08:41:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/zuckerberg-LA-trial-2026-GettyImages-2261841364.jpg?w=1024",
      "category": "Social",
      "content": "Meta CEO Mark Zuckerberg testified in court on Wednesday in a landmark trial aiming to determine if the tech giant’s social media applications are addictive and harmful to teens and kids. The trial, taking place in L.A. Superior Court, already revealed that Meta’sown research indicatedthat parental supervision couldn’t prevent teens from compulsive use of social media, and teens who faced traumatic life experiences were even more inclined to overuse social media.\n\nLawyers for the plaintiff, a 20-year-old who goes by her initials KGM, questioned Zuckerberg this week about whether Instagram employees were given goals to increase daily app usage. The Meta CEO had said during an earlier Congressional hearing that this was not the case,the AP noted, but a 2015 email chain presented as evidence in the trial showed Zuckerberg pushing to increaseusers’ time spent in app by 12%.\n\nZuckerberg was also asked about Instagram’s use of beauty filters, which Meta’s own experts said should be banned when it comes to teens, as well as internal documents with Meta’s estimates of how many children under the age of 13 were on the platform. OneMeta document from 2018stated that, as of 2015, 4 million children under 13 had Instagram accounts, including roughly 30% of children aged 10-12 in the U.S., for instance.\n\nHere, Zuckerberg pushed back, saying age verification was difficult and smartphone makers like Apple could be more helpful on this front. (Apple recently rolled out itsown age assurance toolsfor developers, as a result of the increasing push to regulate apps like Facebook and Instagram in the U.S., wheremanystateshavenow created or are developingtheir own social media laws.)\n\nReports from the courtroomnoted Zuckerberg largely stuck to the company’s talking points during his testimony, sometimes claiming the plaintiff’s lawyers weretaking things out of contextormischaracterizingwhat documents said.\n\nPlaintiff KGM (who also goes by her first name Kaley) sued four social media companies over what she alleges is the harmful and addictive nature of their platforms.TikTokandSnapsettled before the trial began, with YouTube and Meta defending their apps’ success.\n\nDuring the trial, lawyers for Meta have pointed to Kaley’s unhappy childhood as leading to her mental health concerns, not the social apps themselves. The results of this trial by jury could lead to big tech reforms, prompt new laws and regulations, and lead to a settlement with victims, if the tech companies are found to be at fault.",
      "excerpt": "Meta CEO Mark Zuckerberg testified in court on Wednesday in a landmark trial aiming to determine if the tech giant’s social media applications are addictive and harmful to teens and kids. The trial, taking place in L.A. Superior Court, already revealed that Meta’sown research indicatedthat parental ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "As browser wars heat up, Chrome adds new productivity features",
      "link": "https://techcrunch.com/2026/02/19/as-browser-wars-heat-up-chrome-adds-new-productivity-features/",
      "author": "Sarah Perez",
      "date": "2026-02-19T10:30:51-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/google-chrome-GettyImages-2151457378.jpg?w=1024",
      "category": "Apps",
      "content": "AsAIcompaniesandstartupspush their way into theweb browser market,the world’sbiggestbrowser, Google Chrome, isrolling outa handful of new features. The company on Thursday announced the official launch of a trio of options, including Split View, PDF annotations, and a “Save to Google Drive” feature, designed to more deeply integrate Chrome with one of Google’s other online services.\n\nWhile these particular additions aren’t focused on AI,Google already integrated its Gemini AI assistant into Chrome. The move was made in response to the increased competition from AI providers like OpenAI and Perplexity, which are dabbling in agentic browsers. These so-calledbrowser warshave pushed Google to be less stagnant in terms of developing and releasing more consumer-facing features.\n\nWith Split View, multitasking in Chrome has become easier as the feature puts two pages side-by-side in the same tab. This lets you work across two webpages or watch a video while taking notes, among other things. To use the feature, you’ll drag a tab to the left or right edge of the browser window or right-click a link and select “Open Link in Split View.” The tabs will automatically snap into place. When no longer needed, you can exit the Split View layout via an option found via a right-click.\n\nAnother practical addition is the PDF annotations feature, which lets you add notes to a PDF or highlight its text from the browser. This means you don’t have to download the PDF and then open it in another application to work with its content. The option, a long time coming, could make it much simpler to do basic PDF tasks, like digitally signing a document, filling out a form, making notes within a file or personal document, and more.\n\nFinally, the new Save to Google Drive feature will allow you to save any PDF directly to your Google Drive account, instead of your computer, where it may get lost. When using this feature, the saved files will appear in a “Saved from Chrome” folder in your Drive, making them easy to find.\n\nToday’s update follows the expansion ofGemini and other agentic featuresto Chromebook users last month. And soon, Chrome is poised to adoptanother changethat was first spearheaded by its competitors: support for vertical tabs. (Tech-savvy users can even enable that option now, in an experimental phase,by changing a flag.)\n\nThis reimagined way to organize open tabs was one of the flagship features inThe Browser Company’sfirst alternative browser, Arc, and is now found in itsAI browser, Dia.By adding this feature and the others, Google hopes to give Chrome users fewer reasons to switch.",
      "excerpt": "AsAIcompaniesandstartupspush their way into theweb browser market,the world’sbiggestbrowser, Google Chrome, isrolling outa handful of new features. The company on Thursday announced the official launch of a trio of options, including Split View, PDF annotations, and a “Save to Google Drive” feature,",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Reload wants to give your AI agents a shared memory",
      "link": "https://techcrunch.com/2026/02/19/reload-an-ai-employee-agent-management-platform-raises-2-275m-and-launches-an-ai-employee/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-19T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Reload-Co-Founders-Headshot.png?w=1056",
      "category": "Startups",
      "content": "There came a point when Newton Asare realized AI agents weren’t just tools anymore. “They were operating more like teammates,” he told TechCrunch.\n\nThe realization crystallized when Asare and Kiran Das, both serial founders, noticed they were using AI agents to perform tasks they usually would have done themselves. Asare said he came to believe that the future lay in people managing AI employees.\n\n“And if that’s true, we’ll need a real system to manage them, with structure around onboarding, coordination, and oversight for digital workers,” he added.\n\nLast year, the duo launchedReload, an AI workforce management platform. On Thursday, the company announced itsfirst AI product, Epic, alongside a $2.275 million round led by Anthemis, with participation from Zeal Capital Partners, Plug and Play, Cohen Circle, Blueprint, and Axiom.\n\nReload is a platform that lets organizations manage their AI agents across teams and departments. Companies can connect agents, regardless of who built them (whether by a third party or internally), assign them roles and permissions, and track the work they perform. “Reload acts like the system of record for AI employees, providing visibility, coordination, and oversight as agents operate across functions,” said Asare, the company’s CEO.\n\nRight now, he observed, teams are using multiple agents simultaneously for tasks such as coding, debugging, and refactoring. The problem is that these agents are often focused solely on whatever they were prompted to do and don’t necessarily retain long-term memory of what a product is or why they were told to perform a specific function. They operate, in other words, with only short-term memory.\n\nOver time, an agent can lose context, or the system can evolve away from its original intent. That’s why Reload is launching Epic. Built on top of the Reload platform, it serves as an architect alongside other coding agents, continuously defining a product’s requirements and constraints, and reminding agents what they are building and why, to keep a system consistent as it develops.\n\n“In software development specifically, coding agents can generate large amounts of code, but they don’t preserve shared system understanding over time,” Asare said. “Epic complements those agents by defining the system upfront and maintaining shared context as it evolves. It doesn’t replace coding agents; it makes them more effective.”\n\nEpic is designed to live inside the coding environments where developers already work. It can be installed as an extension in AI-assisted code editors like Cursor and Windsurf, running alongside other agents inside these tools.\n\n“When a team starts a project, Epic helps create the core system artifacts such as product requirements, data models, API specifications, tech stack decisions, diagrams, and structured task breakdowns,” Asare said, adding that these are the foundations that coding agents build against.\n\n“As development progresses, Epic maintains a structured memory of decisions, code changes, and patterns,” he continued. “If you switch coding agents, your structure and memory follow. If multiple engineers use different agents on the same project, everyone builds against the same shared source of truth.”\n\nAsare and Das previously had a company together that was acquired and this is their second company together.\n\nThe AI infrastructure space is crowded. Competitors include LongChain, which helps with AI agent deployment and memory management, and CrewAI, which helps enterprises manage their AI agents.\n\nDas said Epic is different because it “defines the system upfront and maintains shared project-level context across agents and sessions,” with a focus specifically on building infrastructure to maintain AI employees. “Traditional workforce systems weren’t designed for AI agents operating as teammates,” said Das, who serves as the company’s CTO. “That’s the layer we’re focused on.”\n\nThe fresh capital will go toward hiring and product advancement, specifically expanding the infrastructure needed to support a growing number of AI agents. “We’re building for the next era of work,” Asare said.\n\nThis piece was updated to add the other investors in the round.",
      "excerpt": "There came a point when Newton Asare realized AI agents weren’t just tools anymore. “They were operating more like teammates,” he told TechCrunch.\n\nThe realization crystallized when Asare and Kiran Das, both serial founders, noticed they were using AI agents to perform tasks they usually would have ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta is shutting down Messenger’s standalone website",
      "link": "https://techcrunch.com/2026/02/19/meta-is-shutting-down-messengers-standalone-website/",
      "author": "Aisha Malik",
      "date": "2026-02-19T09:01:29-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2233007024.jpg?resize=1200,800",
      "category": "Social",
      "content": "Meta is shutting down its standalone Messenger website, the company shared in ahelp page. Starting April 2026, the website will no longer be available. If users still want to send and receive messages on the web, they can do so while logged into Facebook.\n\n“After messenger.com goes away, you will be automatically redirected to usefacebook.com/messagesfor messaging on a computer,” the help page reads. “You can continue your conversations there or on the Messenger mobile app.”\n\nIf you use Messenger without a Facebook account, then you’ll only be able to continue your conversations on the Messenger mobile app. Users can restore their chat history on any platform using the PIN they entered when they first created a backup on Messenger. If you can’t remember your PIN, you can reset it.\n\nThe move comes a few months afterMeta shut down Messenger’s stand-alone desktop appsfor Windows and Mac. The writing may have been on the wall at the time, as Meta had been redirecting existing desktop app users to the Facebook website to continue using the messaging service, rather than the Messenger website.\n\nThe change was first spotted by reverse engineerAlessandro Paluzzi. Meta is notifying users of the update via a pop-up message on the Messenger website and app.\n\nUsers have taken to social media toexpress their frustrationwith the update, withmany sayingthey don’t want to rely on the Facebook website to send and receive Messenger chats on the web, especially those who have deactivated their Facebook accounts.\n\nWhile Meta’s decision to shut down various Messenger platforms is frustrating for users, it allows the tech giant to reduce costs by leaving it with fewer platforms to maintain.\n\nMessenger first launched as “Facebook Chat” back in 2008, and Facebook (now Meta) launched Facebook Messenger as a standalone app in 2011. Over the years, the tech giant positioned Messenger as its own service outside of Facebook, and in 2014, the social network removed messaging capabilities from its main mobile app to push people to the Messenger app. However, the company reversed this in 2023 when it beganmerging Messengerback into the Facebook app.\n\nMeta did not immediately respond to a request for comment.",
      "excerpt": "Meta is shutting down its standalone Messenger website, the company shared in ahelp page. Starting April 2026, the website will no longer be available. If users still want to send and receive messages on the web, they can do so while logged into Facebook.\n\n“After messenger.com goes away, you will be",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Reddit is testing a new AI search feature for shopping",
      "link": "https://techcrunch.com/2026/02/19/reddit-is-testing-a-new-ai-search-feature-for-shopping/",
      "author": "Aisha Malik",
      "date": "2026-02-19T10:22:51-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/02/reddit-ipo-v2.jpg?resize=1200,675",
      "category": "Apps",
      "content": "Redditannouncedon Thursday that it’s testing a new AI search tool that takes community recommendations and matches them with products from some of the company’s shopping and advertising partners.\n\nA small group of users in the U.S. will start to see search results that include interactive product carousels with pricing, images, and direct where-to-buy links.\n\nThe announcement reflects Reddit’s broader push to combine its community-driven platform with e-commerce capabilities. The move comes as Reddit launched itsfirst shoppable ad productlast year, called Dynamic Product Ads (DPA), which display personalized product recommendations to users based on their interests.\n\nNow, when users who are part of the test search for something like “best noise-canceling headphones” or “electronic gift ideas for a college student,” they will see a carousel of related products at the bottom of the results.\n\nThis carousel will feature products directly mentioned by users from conversations on related posts and comments. If users tap on the product, they can view more details and then be directed to the retailer to purchase the item.\n\n“This feature surfaces top-recommended products directly from discussions, giving redditors instant information about any product,” the company wrote in ablog post. “This test is designed to make Reddit easier to navigate while keeping community perspectives at the center of the experience. We’ll continue learning from how people use this new feature and refine the experience over time.”\n\nWhile platforms like TikTok and Instagram have long integrated shopping features, Reddit is now looking to follow suit. Of course, Reddit isn’t the only tech platform that recently started exploring AI-driven shopping, as OpenAI’s ChatGPT rolled out an“Instant Checkout”feature last September that lets users make Etsy and Shopify purchases within conversations.\n\nThursday’s announcement comes afterReddit CEO Steve Huffman saidduring the company’s earnings release last week that the platforms’s AI search engine could be the next big opportunity for its business, not just in terms of product, but also as a revenue driver.\n\nHuffman also noted that weekly active users for search grew 30% over the past year, increasing from 60 million to 80 million, while weekly active users for the AI-powered Reddit Answers feature rose from 1 million in the first quarter of 2025 to 15 million by the fourth quarter.",
      "excerpt": "Redditannouncedon Thursday that it’s testing a new AI search tool that takes community recommendations and matches them with products from some of the company’s shopping and advertising partners.\n\nA small group of users in the U.S. will start to see search results that include interactive product ca",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Bug in student admissions website exposed children’s personal information",
      "link": "https://techcrunch.com/2026/02/19/bug-in-student-admissions-website-exposed-childrens-personal-information/",
      "author": "Zack Whittaker",
      "date": "2026-02-19T07:05:35-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/12/padlock-badly-handled-breaches.jpg?resize=1200,792",
      "category": "Security",
      "content": "A student admissions website used by families to enroll children into schools has fixed a security lapse that was exposing their personal information.\n\nThe website, Ravenna Hub, which lets parents apply and track the status of their kids’ applications across thousands of schools, was allowing any logged-in user to access the personally identifiable data associated with any other user, including their children.\n\nThe exposed data includes children’s names, dates of birth, addresses, pictures, and details about their school. Email addresses and phone numbers of parents, as well as information about children’s siblings, were also exposed.\n\nFlorida-based VenturEd Solutions, which develops and maintains Ravenna Hub,sayson Ravenna Hub’s website that it serves over a million students, and processes hundreds of thousands of applications a year.\n\nTechCrunch first learned of the vulnerability on Wednesday and soon after alerted the company. VenturEd fixed the bug the same day, but TechCrunch held this report until we could verify that the bug was fixed.\n\nNick Laird, the chief executive of VenturEd Solutions, told TechCrunch in an email that the company was able to replicate the issue and has addressed the vulnerability.\n\nLaird said the company was investigating the incident, but he would not commit to notifying users about the security lapse, or say — when asked by TechCrunch — if the company has the ability to check if there was any improper access to other users’ data. We also asked if Ravenna Hub had its security checked by a third-party, and if so, by whom. Laird would not say, and declined to comment further.\n\nIt’s not clear who, if anyone, oversees cybersecurity at VenturEd and Ravenna Hub.\n\nThe vulnerability is known as an insecure direct object reference, or IDOR, acommon security flawthat allows users to access stored information because of weak or non-existent security controls on the concerned servers.\n\nIn practice, the bug allowed any logged-in user to access another student’s data, including their personal information, by modifying the unique number associated with a student’s profile using their web browser’s address bar.\n\nIn the case of Ravenna Hub, student numbers are sequential, meaning it was possible for any user to access another student’s data by changing the profile number by one or more digits.\n\nWhen TechCrunch created a new account with test data, we found that the web address contained a seven-digit number. As such, there were slightly more than 1.63 million records prior to ours that were accessible to any other user.\n\nThis is the latest security lapse involving simple security flaws affecting the personal information of children. In January,online mentoring site UStrive exposed the personal information of its users, many of whom are still in school.",
      "excerpt": "A student admissions website used by families to enroll children into schools has fixed a security lapse that was exposing their personal information.\n\nThe website, Ravenna Hub, which lets parents apply and track the status of their kids’ applications across thousands of schools, was allowing any lo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI deepens India push with Pine Labs fintech partnership",
      "link": "https://techcrunch.com/2026/02/18/openai-deepens-india-push-with-pine-labs-fintech-partnership/",
      "author": "Jagmeet Singh",
      "date": "2026-02-18T19:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2170386424.jpg?w=1024",
      "category": "AI",
      "content": "As India pitches itself as a global hub for applied artificial intelligence, OpenAI has partnered with Pine Labs to integrate AI-driven reasoning into the fintech firm’s payments stack, automating settlement and invoicing workflows in a move the companies say could help accelerate AI-led commerce in India.\n\nThe partnership will see Pine Labs embed OpenAI’s application programming interfaces — software tools that let companies plug AI into their existing systems — within its payments and commerce infrastructure, the companies said on Thursday, all with the aim of enabling AI-assisted settlement, reconciliation, and invoicing workflows.\n\nThe deal underscores OpenAI’s broader push to expand its footprint in India,one of its fastest-growing markets, as it looks to move beyond being known primarily as the maker of ChatGPT and embed its technology into education, enterprise, and infrastructure. Earlier this week, OpenAI partnered with leading Indian engineering, medical, and design institutions tobring AI tools into higher education, betting that India’s large developer base and more than a billion internet users will play a central role in the next phase of AI adoption.\n\nPine Labs is already using AI internally to automate parts of its settlement and reconciliation process, cutting the time it takes to clear daily settlements from hours to minutes, according to Chief executive B Amrish Rau. The Noida-based company previously relied on manual checks by dozens of employees to process funds from multiple banks before markets opened each day, a workflow that is now largely handled by AI-driven systems, he said in an interview.\n\nFor Pine Labs, the partnership is intended to extend those AI-driven efficiencies beyond internal operations to merchants and corporate clients, starting with business-to-business use cases such as invoice processing, settlements and payments orchestration, Rau told TechCrunch. He noted the company sees faster adoption in B2B workflows, where AI agents can handle large volumes of repetitive financial tasks under predefined rules, before similar capabilities reach consumer-facing payments.\n\n“People talk about retail AI, but the bigger impact of all of this is really efficiency improvement, especially in B2B,” Rau said. “If you look at invoicing and settlement, those are workflows where agents can actually drive the process end to end, and that’s where adoption can happen faster.”\n\nThe rollout of more autonomous, agent-led payment workflows will move faster in overseas markets where regulations already allow such transactions, Rau said, while India is likely to see a more gradual adoption focused on AI-assisted commerce rather than fully agent-initiated payments. He said that Pine Labs is already prototyping agent-driven payments in parts of the Middle East and Southeast Asia, even as Indian regulations require tighter controls on how payments are authorized.\n\nFor OpenAI, the partnership offers a route deeper into India’s payments and enterprise ecosystem as it looks to move beyond consumer-facing tools and embed its models into high-volume, regulated workflows. Rau said the collaboration is aimed at increasing merchant stickiness and expanding Pine Labs’ role from a payments processor to a broader commerce platform, with higher transaction volumes over time translating into incremental revenue.\n\nPine Labs says itworks with more than 980,000 merchants, 716 consumer brands, and 177 financial institutions, and has processed over 6 billion cumulative transactions valued at over ₹11.4 trillion (about $126 billion), per its prospectus published last year. The fintech operates across 20 countries, including Malaysia, Singapore, Australia, parts of Africa, the UAE, and the U.S., giving the OpenAI partnership reach across both Indian and international markets.\n\nRau said the partnership does not involve revenue sharing between the two companies, with Pine Labs not taking a cut if its merchants choose to embed OpenAI’s tools. “We’ve kept it completely independent of each other — anything related to payment and payment services, we will get the benefit of it, and anything related to OpenAI revenues will go to them,” he said.\n\nThe arrangement, Rau added, is also non-exclusive. He compared it to OpenAI’s partnership with Stripe in the U.S. and said Pine Labs remains open to working with other AI providers.\n\nRau said Pine Labs is building additional security and compliance layers around AI-driven workflows to ensure that sensitive merchant and consumer transaction data remains protected, as the company integrates AI more deeply into its payments systems. He said the focus is on ensuring transactions remain secure and compliant even as more workflows are automated by AI.\n\nPine Labs’ interest in AI-driven commerce builds on earlier work through its Setu unit, which hasexperimented with agent-led bill payment experiencesusing chatbots including ChatGPT and Anthropic’s Claude. Separately, India also began pilotingconsumer payments directly through AI chatbotslast year.\n\nThe new announcement comes as India hosts itsAI Impact Summitin New Delhi, where global AI companies including OpenAI, Anthropic, and Google are showcasing their latest capabilities alongside Indian startups demonstrating AI applications aimed at large-scale deployment across sectors such as finance, healthcare, and education.",
      "excerpt": "As India pitches itself as a global hub for applied artificial intelligence, OpenAI has partnered with Pine Labs to integrate AI-driven reasoning into the fintech firm’s payments stack, automating settlement and invoicing workflows in a move the companies say could help accelerate AI-led commerce in",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SoftBank to spend an eye-popping $33B to build huge U.S. gas power plant",
      "link": "https://techcrunch.com/2026/02/19/softbank-to-spend-an-eye-popping-33b-to-build-huge-u-s-gas-power-plant/",
      "author": "Tim De Chant",
      "date": "2026-02-19T08:27:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-155376474.jpeg?resize=1200,800",
      "category": "",
      "content": "SoftBank subsidiary SB Energy is expected to build a massive 9.2 gigawatt natural gas-fired power plant on the Ohio-Kentucky border, according to areportfrom Bloomberg. If completed, it would be the largest power plant in the U.S., capable of powering around 7.5 million homes.\n\nWith a price tag of $33 billion, the project would be more expensive than recent natural gas-fired power plants, which have skyrocketed in cost, Bloomberg notes. It’s unclear who will ultimately foot the bill, though traditionally rate-payers have shouldered the burden for new generating capacity.\n\nThe Japanese investor is apartner in the Stargate projectwith OpenAI. SB Energy did not say whether the new power plant would feed directly into the grid or if it would power data centers. OpenAI and SoftBank arein the process of buildinga “proof of concept” data center atGM’s former Lordstown automotive assembly plant.\n\nA power plant of this size is likely to take years, perhaps a decade, to complete even before taking into account the shortage of natural gas turbines. If completed, the project could emit around 15 million metric tons of carbon dioxide per year, according to our calculations based on public, energy-use metrics. Whenincluding methane leaksfrom the natural gas supply chain, the climate impact could even be even bigger.",
      "excerpt": "SoftBank subsidiary SB Energy is expected to build a massive 9.2 gigawatt natural gas-fired power plant on the Ohio-Kentucky border, according to areportfrom Bloomberg. If completed, it would be the largest power plant in the U.S., capable of powering around 7.5 million homes.\n\nWith a price tag of $",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI reportedly finalizing $100B deal at more than $850B valuation",
      "link": "https://techcrunch.com/2026/02/19/openai-reportedly-finalizing-100b-deal-at-more-than-850b-valuation/",
      "author": "Rebecca Bellan",
      "date": "2026-02-19T07:35:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2236544149.jpg?resize=1200,800",
      "category": "",
      "content": "OpenAI is nearing a deal to raise more than $100 billion at a valuation that could exceed $850 billion,Bloomberg reports,citing sources familiar with the matter.\n\nThe deal comes as the ChatGPT-maker burns through cash as it inches toward profitability. To that end, OpenAI has said it has started testingads in ChatGPTfor free users, a gamble that could lead to more revenue or could send users running from the platform.\n\nApparently investors think it’s worth the risk if they’re valuing the company $20 billion higher than the $830 billion valuation initially expected. The company’s pre-money value will remain at $730 billion, per Bloomberg’s source.\n\nThe first tranches of funding are reportedly coming from the usual suspects: Amazon (already in talks to investup to $50 billion), SoftBank (gearing up for$30 billion), Nvidia (close to investing$20 billion), and Microsoft. VC firms and sovereign wealth funds are expected to close later, potentially bringing the total amount raised higher.\n\nTechCrunch has reached out to OpenAI for comment.",
      "excerpt": "OpenAI is nearing a deal to raise more than $100 billion at a valuation that could exceed $850 billion,Bloomberg reports,citing sources familiar with the matter.\n\nThe deal comes as the ChatGPT-maker burns through cash as it inches toward profitability. To that end, OpenAI has said it has started tes",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}