{
  "last_updated": "2026-02-22T22:28:17.894672+00:00",
  "articles": [
    {
      "title": "The 9,000-pound monster I don’t want to give back",
      "link": "https://techcrunch.com/2026/02/22/the-9000-pound-monster-i-dont-want-to-give-back/",
      "author": "Connie Loizos",
      "date": "2026-02-22T02:59:08-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-22-at-2.19.29-AM.png?resize=1200,767",
      "category": "Transportation",
      "content": "Before heading on a trip to Tahoe last weekend, GM offered me the use of the company’s 9,000-pound monument to excess – the new 2026 electric Escalade IQL (starting at $130,405) – for a week to test-drive. Before you continue, note that I’m not a professional car reviewer. TechCrunch has excellent transportation writers; I am not one of them. I do, however, drive anelectric car.\n\nI was immediately game. I’d first glimpsed one last summer at a car show, where some regional car dealers had stationed themselves at the end of a long field dotted with exquisite vintage automobiles. My immediate reaction was “Jesus, that’s enormous,” followed by a surprising admiration for its design, which, despite its enormous scale, shows restraint. For lack of a better word, I’m going to say it’s “strapping.” Its proportions just work.\n\nMy excitement waned pretty quickly when the car was dropped off at my house a day before our departure time. This thing is a monstrosity — at 228.5 inches long and 94.1 inches wide, it made our own cars look like toys. My first apartment in San Francisco was smaller. Trying to drive it up my driveway was a little harrowing, too; it’s so big, and its hood is so high, that if you’re ascending a road at a certain slope – we live midway down a hill; our mailbox is at the top of it – you can’t see whatever is directly in front of the car.\n\nI thought about just leaving it in the driveway for the duration of the trip. The other alternative was doing what I could to grow more comfortable with the prospect of driving it 200 miles to Tahoe City, so I tooled around in it that night and the next day, picking up dinner, heading to an exercise class — just basic stuff around town. When I ran into a friend on the street, I volunteered as quickly as possible that this was not my new car, that I was going to possibly review it, and wasn’t its size ridiculous? It felt like a tank. I thought: other than hotels that use SUVs like the Escalade to ferry guests around, what kind of monster chooses a car like this?\n\nFive days later, it turns out that I am that kind of monster.\n\nLook, I don’t know how or when I fell for this car. If I’d written this review after two days, it would read very differently. Even now, I’m not so blind that I don’t see its shortcomings.\n\nIt was the Escalade’s performance in a terrible snowstorm that really won my heart, but let me walk you through the steps between “Ugh, this car is a tank” and “Yes! This car is atank.”\n\nJust getting into it requires a little more exertion than would seem to make sense. I’m fairly athletic and I still found myself wondering if this thing shouldn’t come with an automated step stool.\n\nInside is where digital maximalism does its work. The dashboard opens with a 55-inch curved LED screen with 8K resolution that reads less like a car display and more like a situation room. Front passengers get their own screens. Second-row passengers also get 12.6-inch personal screens along with stowable tray tables, dual wireless chargers, and — with the most lavish version of the car — massage seats that will make them forget they’re in a vehicle at all. Google Maps handles navigation. And the polarized screen technology deserves its own praise: while one of my kids binge-watched Hulu in the front seat, not a frame of it leaked into my sightline from behind the wheel.\n\nThe cabin itself is built around the premise that no one inside should feel crowded, and it delivers. Front legroom stretches to 45.2 inches; the second row offers 41.3; even the third row manages 32.3 inches. Seven adults could share this machine for a long while without fraying each other’s nerves. Heated and ventilated leather seats with 14-way power adjustment come standard in the first two rows, and the whole operation runs on 5G Wi-Fi.\n\nThe car also comes standard with Super Cruise, GM’s hands-free driving system, which I’m not sure I quite figured out. True car reviewers seem to love it; when I tried it, the car felt like it was drifting to an alarming degree between the outer boundaries of the highway lane, and when that happens, it unleashes an escalating sequence of warnings. First, a red steering wheel icon materializes on-screen. Then your seat pulses haptic warnings against your rump. Ignore those and a chime — both reminder and reproach — fills the cabin. GM calls this impolite series a “driver takeover request.”\n\nDid I mention the 38-speaker AKG Studio sound system? So good.\n\nAs for the exterior — this is a handsome giant, but it takes some getting used to. At first, I found the grille, which is just for show, almost comically imposing. This is definitely a car for people who are the boss, or want to be the boss, or want to look like the boss while privately dealing with existential crises. Pulling up to a glass-lined restaurant one night, I’m pretty sure I blinded half the patrons as I swung into a parking spot perpendicular to the building, the Escalade’s headlights flooding through the windows.\n\nThen there is the light show the car launches whenever it detects you approaching via the key or the MyCadillac app. It’s as if it’s saying, “Hey, chief, where we headed?” before you’ve so much as touched a door handle. (In the vernacular of Cadillac, this is thanks to its “advanced, all-LED exterior lighting system,” highlighted by a “crystal shield” illuminated grille and crest, along with vertical LED headlamps and “choreography-capable tail lamps.”)\n\nIt is, objectively, a bit much. I loved it immediately.\n\nDespite its size, the Escalade IQL is unexpectedly nimble. Not “sports car darting through traffic” nimble, but “I can’t quite believe something this colossal doesn’t handle like a battleship” nimble.\n\nNow we arrive at the frustrations. The front trunk — or “frunk” in the lexicon of EV devotees — operates in mysterious and frustrating ways. Opening requires holding the button until completion. Release prematurely and it halts mid-ascent, forcing you to restart the entire sequence. Closing demands the same sustained pressure. The rear trunk, conversely, requires two distinct taps followed by immediate button abandonment. Hold too long and nothing happens.\n\nRelatedly, twice, the vehicle refused to power down after I’d finished driving. The car simply sat there, running, even when I shifted to park and opened the door (which tells the car to turn off). One clunky solution: open the frunk, close the frunk, shift into drive, then park, then exit.\n\nAs for the software, it’s absolutely fine unless you’ve owned a Tesla, in which case, prepare for disappointment. This seems to be true across the board — everyone I know who owns both a Tesla and another EV, no matter how high end, says the same thing. Once you’ve internalized how effortlessly Tesla’s software dissolves barriers between intention and execution, every other automaker’s software feels like a compromise.\n\nWhich brings us to the nadir of the trip: charging in Tahoe during winter. For all its virtues, the Escalade IQL is, by any measure, a thirsty machine. The battery is a 205 kWh pack — enormous, and it needs to be, because the car burns through roughly 45 kWh per 100 miles, which is considerably more than comparable electric SUVs. Cadillac estimates 460 miles of range on a full charge, and in ideal conditions that holds up. Tahoe in winter, however, is not ideal conditions. We’d also arrived with less charge than we should have. A series of side trips on the way up, including an emergency detour to find shirts for a family member who had packed none, had eaten into the battery more than expected. By the time we needed to charge, we genuinely needed to charge.\n\nWe approached a Tesla Supercharger in Tahoe City that appeared on the MyCadillac app, but when we plugged in to the designated stall, nothing happened. We searched for answers, discovering that even Tesla stations that accept non-Tesla vehicles throttle energy to 6 kilowatts per hour anyway, but it was a frustrating experience. A nearby EVGo had shuttered a month prior. ChargePoint’s two units at the Tahoe City Public Utility lot were broken and willing to connect but not to actually charge anything. We briefly contemplated a 35-mile drive to Incline Village, did the math on what stranded would actually look like, and decided against it. Then I discovered an Electrify America station 12 miles away. We drove through gathering snow, arrived shortly before 11 p.m., and it worked. We sat there for an hour fighting exhaustion before driving home.\n\nThe following morning revealed another issue via an app alert: tire pressure had dropped to 53 and 56 PSI in the front (recommended: 61) and 62 PSI in the rear (recommended: 68). I have no idea whether the car had been delivered that way or whether something else was going on beyond the cold weather — either way, it meant someone standing at a gas station filling tires while being pelted directly in the face with ice. (That someone was my husband.) For a family trip, it was going great.\n\nAt this point, in fact, I would have told you that the Escalade IQL is unquestionably luxurious and ideal for families of four or more who value space and technology. I would tell you it came burdened by real tradeoffs: forward visibility obstructed by its commanding hood, parking challenges inherent to its dimensions, limited charging infrastructure for a machine this ravenous, and tires tasked with supporting 9,000 pounds. It’s a beautiful car, I would have said, but it’s not for me.\n\nBut the snow that had started to fall kept falling. Within two days, eight feet had accumulated, making it impossible to ski — the entire point of the trip — and terrifying to move about town. Except I found that I wasn’t terrified because we had the Escalade, which, because of its weight, felt like driving a tank through the snow. (The tires held steady after we’d inflated them, even as the week kept doing its worst.) What could have been harrowing felt serene. It was quiet, it was strong, it was taking charge in a bad situation.\n\nI also adjusted to the size. By the end of this past week I had stopped mouthing “I’m sorry” to whoever who was waiting for me to figure out where to park it. I had stopped caring what it said about me that I was driving a car whose entire design philosophy is: the owner of this vehicle is not waiting in line. Eight feet of snow had fallen, we needed groceries, and I was the one with the tank, suckers! I could sense my husband falling for the car, too.\n\nThen, as tends to happen in Tahoe, the snow stopped all at once and the sun came out, and the Escalade was just a very dirty car sitting in the driveway (sorry, GM!). It was in this moment that I realized: I still like it, and it’s not because of the emergency alone. I love riding high, with the speaker system flooding the car with a favorite soundtrack. That light show still gets me. The car’s long, curved LED screen is a marvel, among other features.\n\nThe frunk is still problematic. I won’t soon forget the panic of not being able to charge the car where I thought I could. Parking this thing is truly an exercise in patience. I have strong opinions about unnecessary consumption. None of that has changed.\n\nI just also, somehow, want this car, so when the GM middleman comes to collect it, I may hide it under a tarp — a very large tarp — and tell him he has the wrong address.",
      "excerpt": "Before heading on a trip to Tahoe last weekend, GM offered me the use of the company’s 9,000-pound monument to excess – the new 2026 electric Escalade IQL (starting at $130,405) – for a week to test-drive. Before you continue, note that I’m not a professional car reviewer. TechCrunch has excellent t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "China’s brain-computer interface industry is racing ahead",
      "link": "https://techcrunch.com/2026/02/22/chinas-brain-computer-interface-industry-is-racing-ahead/",
      "author": "Kate Park",
      "date": "2026-02-22T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2022/12/GettyImages-1202271610.jpg?resize=1200,900",
      "category": "Biotech & Health",
      "content": "While Elon Musk’s Neuralink likes to say it’s “pioneering” brain-computer interfaces (BCIs), China’s BCI industry is already quietly moving from research to scale.\n\nA new wave of startups is racing to commercialize both implantable and noninvasive BCIs, backed by stronger policy support, expanding clinical trials, and growing investor interest. So says Phoenix Peng, who has founded not one but two BCI startups. He’s a co-founder of NeuroXess, maker of BCI implants, as well as founder and CEO of noninvasive ultrasound BCI startup Gestala.\n\nHis belief in the potential of this market is founded on concrete action: Provinces such as Sichuan, Hubei, and Zhejiang have alreadyset medical service pricingfor BCI, speeding its inclusion in the national medical insurance system.\n\nOver time, he foresees the technology extending beyond medicine “treating disease” to “human augmentation,” he said.\n\n“I have always maintained that neuroscience and AI are two sides of the same coin,” Peng said. “They are destined for deep integration, realizing direct high-bandwidth connections between the human brain and AI. BCI will serve as the ultimate bridge between carbon-based and silicon-based intelligence. While this may sound distant, it represents an unimaginably vast market in the future.”\n\nBut over the next three to five years, BCI use is likely to stay concentrated in healthcare, with the market reaching multibillion-dollar scale as insurance coverage expands, Peng told TechCrunch.\n\nIn August 2025, China’s industry ministry and six other agenciesreleased a national roadmapto further speed development of BCIs. The plan targets major technical milestones by 2027, common industry standards, and a full supply chain by 2030, with the goal of building globally competitive BCI companies and supporting smaller specialized firms.\n\nAsked what’s driving China’s rapid progress in BCI, Peng told TechCrunch it comes down to four factors. The first one is strong policy support, with cross-department collaboration that aligns technical standards and medical reimbursement. In December, at the 2025 Shenzhen BCI & Human-Computer Interaction Expo, Chinaannouncedan 11.6 billion yuan ($165 million) brain science fund to support BCI companies from research through commercialization.\n\nThe second factor is vast clinical resources, including large patient pools and lower research costs that accelerate trials. China’s national health insurance means quicker commercialization once the state approves a device. This compares to the U.S. where even after the FDA approves a device, private insurers, as the main payers, must each individually do so.\n\nResearchers have completed the country’s first fully implanted, wireless BCI trial — only the second globally — allowing a paralyzed patient to control devices without external hardware,per CGTN. Neuralink is the startup thatcompletedthefirst such trial.\n\n“In traditional electrical BCIs, Chinese firms have achieved clinical progress in motor and language decoding, spinal cord reconstruction, and stroke rehabilitation, with over 50 flexible implantable BCI clinical trials completed by mid-2025,” Peng said, adding that next-generation efforts are now moving toward whole-brain neural decoding and encoding, including ultrasound-based approaches such asGestala’s.\n\nThe third factor is China’s mature industrial manufacturing, Peng points out, spanning semiconductors, AI, and medical hardware, which supports fast R&D and prototyping. Finally, there is strategic investment in the market, with both state-led funds and private capital surging under national initiatives.\n\nSome recent key deals include Shanghai-based BCI startupStairMedTechnology raising $48 million (350 million yuan) in Series B funding in February 2025. BrainCo, a neurotech company developing its noninvasive BCIs and bionic limbs,has also quietlyfiled for a Hong Kong IPO, according to reports, after raising$287 million (2 billion yuan)earlier this year. Peng’s company, Gestala, which launched in January, is in talks with investors to close an angel round soon, he tells us.\n\nAll told, China’s BCI startups are ramping up to challenge U.S. leaders like Neuralink, Synchron, and Paradromics. Amongthe most active playersin China are NeuroXess, Neuracle, NeuralMatrix, BrainCo, Bo Rui Kang Tech, Aoyi Tech, Brainland Tech, and Zhiran Medical. They span approaches from implantable flexible interfaces to noninvasive brain-computer technologies.\n\nThis means that China’s BCI market was expected to grow to more than $530 million (3.8 billion yuan) in 2025, up from 3.2 billion yuan in 2024,according to media reports,with projectionsputting the market at over 120 billion yuan by 2040.\n\nBCIs are taking two paths. The first is invasive electrophysiological BCIs like NeuroXess and Neuralink that implant electrodes in people’s brains for precise neuron-level signals. But this type comes with surgery risks. The second type is noninvasive systems likeNeuroSkyandBrainCothat trade some precision for safety and ease of use. (These devices — typically headsets or headbands using electroencephalography (EEG) — read electrical activity through the skull.)\n\nThe field is now broadening further, with emerging approaches — including ultrasound, magnetoencephalography imaging, transcranial magnetic stimulation, optical methods, and hybrid BCIs — giving researchers new tools to read and influence brain activity.\n\nStartup founders also hope that noninvasive technology could help overcome adoption barriers. Not everyone is willing to undergo brain surgery to have a device implanted in their heads.\n\nUltrasound BCIs from companies likeOpenAI-backed Merge Labsand Gestala are targeting high-prevalence conditions such as chronic pain, stroke, and depression. As noninvasive solutions, these technologies are more readily accepted by patients and offer significantly greater commercial scalability.\n\nGestala, for instance, expects to roll out its first-generation product by Q3, said Peng. Early clinical trials have shown promising results, he added, saying that a single session reduced pain scores by 50%, with effects lasting one to two weeks.\n\nHSC, formerly Sequoia China, has meanwhile invested in Zhiran Medical, a startup founded in 2022 focused on improving long-term implant performance. The company uses flexible, high-throughput electrodes to reduce inflammation and signal loss associated with rigid implants.\n\n“Some technologies may look cutting-edge but far from practical application,” Yang Yunxia, a partner at HSC,wrote in a blog post. While others appear commercially viable, they face “high costs” or significant technical barriers, Yunxia contended. Ultimately, investment decisions come down to whether the investor believes a product can be developed into a sustainable business, the partner noted.\n\nOver the next five years, industry insiders expect China’s BCI regulations to align more closely with international standards, with a particular focus on regulatory approval and data sovereignty. Global frameworks developed by organizations such as theIECandISO, along with guidance from theU.S. Food and Drug Administration (FDA), are expected to serve as key reference points.\n\nChinese regulators are also expected to tighten oversight of invasive devices, as well as the data that all BCI devices generate, while easing approval for noninvasive technologies.\n\nAs for the ethicsthat confront brain-implanted or manipulating devices, China plans to strengthen informed-consent requirements, broaden ethics review beyond medicine, and move toward unified technical standards for clinical evaluation.",
      "excerpt": "While Elon Musk’s Neuralink likes to say it’s “pioneering” brain-computer interfaces (BCIs), China’s BCI industry is already quietly moving from research to scale.\n\nA new wave of startups is racing to commercialize both implantable and noninvasive BCIs, backed by stronger policy support, expanding c",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Trump says Netflix will face ‘consequences’ if it doesn’t fire board member Susan Rice",
      "link": "https://techcrunch.com/2026/02/22/trump-says-netflix-will-face-consequences-if-it-doesnt-fire-board-member-susan-rice/",
      "author": "Anthony Ha",
      "date": "2026-02-22T09:39:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2227934246.jpg?w=1024",
      "category": "Government & Policy",
      "content": "President Donald Trump said in a social media post Saturday that Netflix will “pay the consequences” if it doesn’t fire Susan Rice, who has served on the company’s board of directors since 2018.\n\nTrump’s comments came after Rice — a former ambassador to the United Nations who held diplomatic and advisory roles in the Obama and Biden administrations —appeared on the “Stay Tuned with Preet” podcasthosted by Preet Bharara and predicted that corporations that “take a knee” to Trump will be “held accountable” when Democrats return to power.\n\n“If these corporations think that the Democrats, when they come back in power, are going to, you know, play by the old rules, and […] say, ‘Oh, never mind. We’ll forgive you for all the people you fired, all the policies and principles you’ve violated, all, you know, the laws you’ve skirted,’ I think they’ve got another thing coming,” Rice said.\n\nIn response,Trump posted on his social network Truth Social, “Netflix should fire racist, Trump Deranged Susan Rice, IMMEDIATELY, or pay the consequences. She’s got no talent or skills – Purely a political hack! HER POWER IS GONE, AND WILL NEVER BE BACK. How much is she being paid, and for what???”\n\nTrump’s post also includes a screenshot of a post from far-right activist Laura Loomer criticizing Rice’s comments and claiming, “The Netflix-Warner Bros. merger would result in a streaming monopoly, which the Obamas will have a significant stake in” due tothe deal between Netflix and the Obamas’ production company Higher Ground.\n\nWhile Trump’s post does not mention specific consequences,Netflix’s massive Warner Bros. acquisitionwill need to be approved by federal regulators. The streaming company’s co-CEO Ted Sarandosreportedly met with Trumpbefore the deal was announced, with Trump subsequently saying that Netflix is a “great company […] but it’s a lot of market share, so we’ll have to see what happens.”\n\nLast fall,Trump published a similar post demanding that Microsoft fire its president of global affairs Lisa Monaco, who was also targeted by Loomer. Monaco is still at Microsoft.",
      "excerpt": "President Donald Trump said in a social media post Saturday that Netflix will “pay the consequences” if it doesn’t fire Susan Rice, who has served on the company’s board of directors since 2018.\n\nTrump’s comments came after Rice — a former ambassador to the United Nations who held diplomatic and adv",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Sam Altman would like to remind you that humans use a lot of energy, too",
      "link": "https://techcrunch.com/2026/02/21/sam-altman-would-like-remind-you-that-humans-use-a-lot-of-energy-too/",
      "author": "Anthony Ha",
      "date": "2026-02-21T13:38:01-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2198353376.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week whilespeaking at an event hosted by The Indian Express.\n\nFor one thing, Altman — who wasin India for a major AI summit— said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real issue when “we used to do evaporative cooling in data centers.”\n\n“Now that we don’t do that, you see these things on the internet where, ‘Don’t use ChatGPT, it’s 17 gallons of water for each query’ or whatever,” Altman said. “This is completely untrue, totally insane, no connection to reality.”\n\nHe added that it’s “fair” to be concerned about “the energy consumption — not per query, but in total, because the world is now using so much AI.” In his view, this means the world needs to “move towards nuclear or wind and solar very quickly.”\n\nThere’s no legal requirement for tech companies to disclose how much energy and water they use, so scientists have beentrying to study it independently. Data centers have also been connected torising electricity prices.\n\nCiting a previous conversation with Bill Gates, the interviewer asked whether it’s accurate to say a single ChatGPT query currently uses the equivalent of 1.5 iPhone battery charges, to which Altman replied, “There’s no way it’s anything close to that much.”\n\nAltman also complained that many discussions about ChatGPT’s energy usage are “unfair,” especially when they focus on “how much energy it takes to train an AI model, relative to how much it costs a human to do one inference query.”\n\n“But it also takes a lot of energy to train a human,” Altman said. “It takes like 20 years of life and all of the food you eat during that time before you get smart. And not only that, it took the very widespread evolution of the 100 billion people that have ever lived and learned not to get eaten by predators and learned how to figure out science and whatever, to produce you.”\n\nSo in his view, the fair comparison is, “If you ask ChatGPT a question, how much energy does it take once its model is trained to answer that question versus a human? And probably, AI has already caught up on an energy efficiency basis, measured that way.”\n\nYou can watch the full interview below. The conversation about water and energy usage begins at around 26:35.",
      "excerpt": "OpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week whilespeaking at an event hosted by The Indian Express.\n\nFor one thing, Altman — who wasin India for a major AI summit— said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real iss",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "6 days left to lock in the lowest TechCrunch Disrupt 2026 rates",
      "link": "https://techcrunch.com/2026/02/22/6-days-left-to-lock-in-the-lowest-techcrunch-disrupt-2026-rates/",
      "author": "TechCrunch Events",
      "date": "2026-02-22T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/Disrupt-2025-day-3.jpg?resize=1200,800",
      "category": "Startups",
      "content": "Super Early Bird pricing forTechCrunch Disrupt 2026ends February 27 at 11:59 p.m. PT. That means you have just 6 days left to secure the lowest ticket prices of the year.\n\nIf Disrupt has been on your must-attend list, this is your moment. Save up to $680 on your individual pass or secure up to 30% off with community passes before prices increase.Register here.\n\nFrom October 13-15 at San Francisco’s Moscone West, TechCrunch will bring together 10,000 founders, investors, operators, and innovators for three focused days built around launching, scaling, and shaping what’s next in tech.\n\nDisrupt is where you get:\n\nYou’ll see300+ exhibiting startupsdebut tomorrow’s breakthroughs, experience the high-stakesStartup Battlefield 200pitch competition — where one standout company wins a $100,000 equity-free prize — and take part in curated networking designed to drive real outcomes.\n\nYou’ll also hear insights from some of the most influential voices in tech, including WordPress co-founderMatt Mullenweg, General Motors CEOMary Barra, and legendary VCVinod Khosla. Keep an eye on theevent pagefor the agenda drop.\n\nSix days remain to secure the lowest rate of the year. Lock it in before February 27 at 11:59 p.m. PT.Register here.",
      "excerpt": "Super Early Bird pricing forTechCrunch Disrupt 2026ends February 27 at 11:59 p.m. PT. That means you have just 6 days left to secure the lowest ticket prices of the year.\n\nIf Disrupt has been on your must-attend list, this is your moment. Save up to $680 on your individual pass or secure up to 30% o",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Google VP warns that two types of AI startups may not survive",
      "link": "https://techcrunch.com/2026/02/21/google-vp-warns-that-two-types-of-ai-startups-may-not-survive/",
      "author": "Rebecca Bellan",
      "date": "2026-02-21T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Darren-Mowry-headshot.png?resize=1200,960",
      "category": "AI",
      "content": "Loading the player…\n\nThe generative AI boom minted a startup a minute. But as the dust starts to settle, two once-hot business models are looking more like cautionary tales: LLM wrappers and AI aggregators.\n\nDarren Mowry, who leads Google’s global startup organization across Cloud, DeepMind, and Alphabet, says startups with these hooks have their “check engine light” on.\n\nLLM wrappers are essentially startups that wrap existing large language models, like Claude, GPT, or Gemini, with a product or UX layer to solve a specific problem. An example would be a startup thatuses AI to help students study.\n\n“If you’re really just counting on the back-end model to do all the work and you’re almost white-labeling that model, the industry doesn’t have a lot of patience for that anymore,” Mowry said on thisweek’s episode of Equity.\n\nWrapping “very thin intellectual property around Gemini or GPT-5” signals you’re not differentiating yourself, Mowry says.\n\n“You’ve got to have deep, wide moats that are either horizontally differentiated or something really specific to a vertical market” for a startup to “progress and grow,” he said. Examples of the deep-moat LLM wrapper type include Cursor, a GPT-powered coding assistant, or Harvey AI, a legal AI assistant.\n\nIn other words, startups can no longer expect to slap a UI on top of a GPT and get traction on their product like they could, perhaps, in mid-2024 when OpenAIlaunched its ChatGPT store. The challenge now is to build sustainable product value.\n\nAI aggregators are a subset of wrappers — they’re startups that aggregate multiple LLMs into one interface or API layer to route queries across models and give users access to multiple models. These companies typically provide an orchestration layer that includes monitoring, governance, or eval tooling. Think: AI search startup Perplexity or developer platform OpenRouter, which provides access to multiple AI models via a single API.\n\nWhile many of these platforms have gained ground, Mowry’s message is clear to incoming startups: “Stay out of the aggregator business.”\n\nGenerally speaking, aggregators aren’t seeing much growth or progression these days because, he says, users want “some intellectual property built in” to ensure they’re routed to the right model at the right time based on their needs — not because of behind-the-scenes compute or access constraints.\n\nMowry has been in the cloud game for decades, cutting his teeth at AWS and Microsoft before setting up shop at Google Cloud, and he’s seen how this plays out. He said the situation today mirrors the early days of cloud computing in the late 2000s/early 2010s as Amazon’s cloud business started taking off.\n\nAt that time, a crop of startups sprang up to resell AWS infrastructure, marketing themselves as easier entry points that provided tooling, billing consolidation, and support. But when Amazon built its own enterprise tools and customers learned to manage cloud services directly, most of those startups were squeezed out. The only survivors were the ones that added real services, like security, migration, or DevOps consulting.\n\nAI aggregators today face similar margin pressure as model providers expand into enterprise features themselves, potentially sidelining middlemen.\n\nFor his part, Mowry is bullish on vibe coding and developer platforms, which had a record-breaking year in 2025 with startups like Replit, Lovable, and Cursor (all Google Cloud customers, per Mowry) attracting major investment and customer traction.\n\nMowry also expects strong growth in direct-to-consumer tech, in companies that put some of these powerful AI tools into the hands of customers. He pointed to the opportunity for film and TV students to use Google’s AI video generator Veo to bring stories to life.\n\nBeyond AI, Mowry also thinks biotech and climate tech are having a moment — both in terms of venture investment going into the two industries and the “incredible amounts of data” startups can access to create real value “in ways we would never have been able to before.”",
      "excerpt": "Loading the player…\n\nThe generative AI boom minted a startup a minute. But as the dust starts to settle, two once-hot business models are looking more like cautionary tales: LLM wrappers and AI aggregators.\n\nDarren Mowry, who leads Google’s global startup organization across Cloud, DeepMind, and Alp",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Wikipedia blacklists Archive.today after alleged DDoS attack",
      "link": "https://techcrunch.com/2026/02/21/wikipedia-blacklists-archive-today-after-alleged-ddos-attack/",
      "author": "Anthony Ha",
      "date": "2026-02-21T12:20:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?resize=1200,800",
      "category": "Media & Entertainment",
      "content": "Wikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.\n\nArchive.today — which also operates under several other domain names, includingarchive.isandarchive.ph— is perhaps most widely used to access content that’s otherwise inaccessible behind paywalls. That also makes it useful as a source for Wikipedia citations.\n\nHowever, according tothe Wikipedia discussion page about this topic, “There is consensus to immediately deprecate archive.today, and, as soon as practicable, add it to the spam blacklist […] and to forthwith remove all links to it.” (Ars Technicafirst reported on the decision.)\n\nThe discussion page says that Archive.today was previously blacklisted in 2013, only to be removed from the blacklist in 2016.\n\nWhy reverse course again? Because, the discussion page says, “Wikipedia should not direct its readers towards a website that hijacks users’ computers to run a DDoS attack.” Plus, “evidence has been presented that archive.today’s operators have altered the content of archived pages, rendering it unreliable.”\n\nThe distributed denial of service (DDoS) attack in question was allegedly directed at blogger Jani Patokallio. Patokallio wrote that beginning on January 11, users who loaded the archive’s CAPTCHA page have beenunknowingly loading and executing JavaScriptthat sends a search request to his Gyrovague blog, in an apparent attempt to get Patokallio’s attention and increase his hosting bill.\n\nBack in 2023, Patokallio publisheda blog postexamining Archive.today, whose ownership he described as “an opaque mystery.” And while he wasn’t able to track down a specific owner, he concluded the site was likely “a one-person labor of love, operated by a Russian of considerable talent and access to Europe.”\n\nMore recently, Patokallio said the webmaster at Archive.today asked him to take the post down for two or three months.\n\n“I do not mind the post, but the issue is: journos from mainstream media (Heise, Verge, etc) cherry-pick just a couple of words from your blog, and then construct very different narratives having your post the only citable source; then they cite each other and produce a shitty result to present for a wide audience,” the webmaster said, according toemails shared by Patokallio.\n\nPatokallio said that after he declined to take the post down, the webmaster responded with “an increasingly unhinged series of threats.”\n\nWikipedia editors alsopointed to webpage snapshotsin Archive.today that appeared to have been altered to insert Patokallio’s name — hence the concern that it’s become “unreliable” as an archive.\n\nWikipedia’sguidancenow calls for editors to remove links to Archive.today and related sites, replacing them with links to the original source or to other archives like the Wayback Machine.\n\nOna bloglinked from the Archive.today website, the site’s apparent ownerwrotethat Archive.today’s value to Wikipedia was “not about paywalls” but rather “the ability to offload copyright issues.” They laterwrotethat things had turned out “pretty well” and said they would “scale down the ‘DDoS’.”\n\n“Why didn’t you write about such events earlier, folks of the tabloids?” they said. “I don’t expect you to write anything good, because then who would read you, but there was plenty of dramas, wasn’t there? Because there was no Jani to nudge you?”",
      "excerpt": "Wikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.\n\nArchive.today — which also operates under several other domain names, includingarchive.isandarchive.ph— is perhaps m",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Remember HQ? ‘Quiz Daddy’ Scott Rogowsky is back with TextSavvy, a daily mobile game show",
      "link": "https://techcrunch.com/2026/02/20/remember-hq-quiz-daddy-scott-rogowsky-is-back-with-textsavvy-a-daily-mobile-game-show/",
      "author": "Amanda Silberling",
      "date": "2026-02-20T13:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/text-savvy-scott-rogowsky.jpg?resize=1200,665",
      "category": "Apps",
      "content": "Scott Rogowsky is a comedian — he knows how to make fun of himself. That’s how he ended uproamingNew York City Comic Con with his own photo printed out like a “Wanted” poster, filming himself asking strangers, “Have you seen this man?”\n\nThese passersby showed a flicker of recognition, looking at the tall, bearded man like someone they had known in a past life, but couldn’t quite place.\n\n“You look familiar! Where do I know you from?” someone asks, as though Rogowsky could be a friend of a friend they had met at a party.\n\n“I know your face,” another person says, staring thoughtfully at the 41-year-old.\n\nA cosplayer dressed as a Ghostbuster finally figures it out.\n\n“Did you used to do that game show online?” he asks. “Like, every night?”\n\nRogowsky was just poking fun at himself, embracing the persona of a washed-up internet sensation. “I know my place,” he tells TechCrunch. “I’m not walking around like everybody’s supposed to know who I am.”\n\nBut seven years ago, everyone did.\n\nRogowsky was once the face of HQ Trivia, an app that exploded into popular culture, then faded out of the public consciousness almost as fast. Between 2017 and 2019, Rogowsky hosted the live mobile game show twice a day. At its peak, it drew more than 2.4 million daily viewers each night. It garnered 20 million lifetime downloads.\n\nNow the comedian is back with an app of his own called Savvy, which shares a lot of the DNA of HQ. Savvy’s first game,TextSavvy,is a daily live game show where players can earn cash — only this time, viewers are competing against Rogowsky in a word puzzle game that’s something like a hybrid of The New York Times’ Wordle and Connections, rather than trivia.\n\n“I believe this is my calling in a weird way,” Rogowsky says. “I get up there in front of that camera, there’s thousands of people watching at home — millions, back in the HQ days — and it just flows.”\n\nHQ Trivia was founded by the creators of Vine — the short-video platform that predated TikTok — and became a genuine cultural sensation.National newschannelsran storiesabout office workers dropping everything in the middle of the day to play HQ at 3 p.m. It wasgroundbreaking— appointment entertainment in a new format for the streaming era — until the company imploded in a barrage of unfortunate circumstances.\n\nOne founder, Colin Kroll, died of a drug overdose; the other founder, Rus Yusupov, was a divisive leader who clashed with his staff. He oncethreatened a journalistthat he would fire Rogowsky if she published an interview with Rogowsky where he mentioned liking Sweetgreen salads (Yusupov apparently didn’t want to give the fast-food chain free publicity). Most of all, HQ Trivia fell victim to the same trap that dooms so many startups. The company had raised a$15 million funding roundat a $100 million valuation, but it was — quite literally — giving away money, and it never developed a meaningful plan to monetize or build a sustainable business model. The company ultimately filed for bankruptcy in February 2020, with its demise later becoming fodder fordramatic documentariesandtrue-crime-adjacent podcastsdissecting how such a promising app failed so spectacularly.\n\nThis was, understandably, a real blow for Rogowsky. But more bad luck followed. A baseball superfan, Rogowsky had left HQ Trivia in 2019 for a job hostinga daily MLB Network show. He felt like he finally made it — he still lights up recalling running into Hall of Fame pitcher Pedro Martinez in the bathroom. But his show was canceled when the pandemic shut down baseball. He tried a handful of times over the years to recreate a company like HQ, but it was a journey of false starts.\n\n“Crazy s–t happened that I had no control over, and I felt like I was being tossed and turned on this raft in the ocean, just getting battered by things I can’t control, and that was sort of my attitude about life in general,” he says.\n\nHe considered himself retired from show business and opened a vintage store in California. But he missed comedy.\n\n“I went through this very meaningful personal transformation in the last couple of years,” he said. That process culminated in a seven-day mountain retreat called “the Hoffman Process,” a program that he describes as a digital detox combining lessons in psychology and neuroscience that helped him “take control of [his] life again.”\n\n“It gave me a lot of clarity to say, you know what, I have more to do here,” Rogowsky says. “I got out of that retreat and I was like, ‘I have something to say. People find me funny and entertaining. I find myself funny and entertaining.’”\n\nPeople tuned into HQ Trivia for the prospect of winning a cash prize, but the odds of winning were slim. Millions of viewers came back each night because of Rogowsky’s quick wit and charm, which earned him a cult following of fans who still call him “Quiz Daddy.”\n\n“From the psychological, emotional side, I couldn’t really process what was going on,” Rogowsky says, reflecting on his viral fame. “And in the seven humbling years since, I have a vastly new perspective… I have my fanbase, I have my core followers right here. They’re on board with me, and it’s a matter of getting the word out.”\n\nRogowsky received a lot of messages over the years from people who wanted to help him build the next HQ. But last year, a direct message on X from European game designer Johan de Jager grabbed his attention.\n\n“The idea was the host plays against the audience, so it’s like a two-way interaction,” Rogowsky says. “Imagine HQ if I wasn’t just asking the questions but also answering [them]… That adds another layer to it that no one had thought of before.”\n\nBut in the age of AI, where players can easily look up answers, Rogowsky was skeptical that a trivia game could work fairly, so Savvy embraced word puzzles instead.\n\nThe most that Savvy has paid out in a single game is around $400 — small compared to HQ’s occasional six-figure prize pools. That’s because Rogowsky and his co-founders are funding the company themselves.\n\n“Look, I know this isn’t the thousands of dollars that you saw on HQ, the hundreds of thousands that we eventually got to,” Rogowsky said on one recentTextSavvy broadcast. “But the difference is HQ was funded by venture capital. They had $8 million in the bank to start. They got another $15 million from other venture capitalists. We don’t got that… This is a low-budge operashe because I’m paying for it!”\n\nRogowsky says he has spoken with investors about Savvy and even gotten some enticing offers. But venture backing often comes with pressure on founders to maximize returns as fast as they can, a model that can set a business up to fail, as HQ demonstrated.\n\n“People want to 10x and 100x [their investment]… I’d be very happy to get to a point of profitability, to where we can just keep growing the company, keep hiring more people, keep making more games,” Rogowsky says. “I’m not looking for some type of eight-figure, nine-figure exit. This is what I want to do. I’m going to do this as long as I continue to wake up every morning and say, ‘Goddamn, I’m excited to get up there in front of that camera and have fun.’”\n\nTextSavvy is currently running a “Season 0,” a soft launch that allows the team to work through technical kinks before formally launching on March 1. So far, without much promotion, TextSavvy has peaked at about 4,000 viewers in one night.\n\nThat’s not much compared to the HQ days. Then again, when TechCrunch firstwrote about HQ, the app only had about 3,300 concurrent viewers. Who’s to say Savvy can’t do it again?\n\n“We’re not going anywhere this time,” Rogowsky said. “There’s no one to fire me. There’s no drama, there’s no tension. There’s not going to be a documentary about Savvy the way there was about HQ.”",
      "excerpt": "Scott Rogowsky is a comedian — he knows how to make fun of himself. That’s how he ended uproamingNew York City Comic Con with his own photo printed out like a “Wanted” poster, filming himself asking strangers, “Have you seen this man?”\n\nThese passersby showed a flicker of recognition, looking at the",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Can the creator economy stay afloat in a flood of AI slop?",
      "link": "https://techcrunch.com/2026/02/22/can-the-creator-economy-stay-afloat-in-a-flood-of-ai-slop/",
      "author": "Anthony Ha",
      "date": "2026-02-22T14:15:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-941290532.jpg?resize=1200,800",
      "category": "Media & Entertainment",
      "content": "Online creators and their business models were on our mind this week after mega-popular YouTuber MrBeast announced thathis company is buying fintech startup Step, followed byHollywood studios sending a flurry of cease-and-desist lettersto ByteDance over the launch of its new video generation model Seedance 2.0.\n\nThose seemingly unconnected headlines suggest a media landscape in the midst of transformative change, aspopular YouTubers look to diversify their business models, with the threat and promise of increasingly powerful generative AI tools on the horizon.\n\nOn the latest episode ofTechCrunch’s Equity podcast, Kirsten Korosec, Rebecca Bellan, and I debated what’s next for the creator economy, and whether there will be any room for the next generation of creators to stand out.\n\n“What’s the next saturation point?” Kirsten wondered. “Not all of these folks can go out and spin off products. So then does the pool of successful creators just simply get smaller? Or will something else happen, technologically speaking, or a different medium that will allow them to find an audience to make money off of?”\n\nYou can read a preview of our conversation, edited for length and clarity, below.\n\nAnthony:[The news] led our colleague Lauren to dothis great piece talking about the creator business model in general, and this sense that they aren’t just relying on ad revenue anymore. I think it’s still a pretty big part of their business, but she broke down a number of the most popular YouTubers and noted that each of them is expanding — usually into e-commerce, but also into other revenue streams.\n\nMr. Beast, for example, actually has this line of food products, including chocolate, that is making hundreds of millions of dollars and it was actually profitable for him in 2024, whereas his media business was losing money. All that was pretty wild to me.\n\nKirsten:If Mr. Beast can’t be profitable with his media company, who can? To me, that was a stunning stat.\n\nI am not surprised that the whole ad revenue biz game is not working out necessarily for creators and influencers because it’s just reached a saturation point. I guess my big question is, what’s the next saturation point? Not all of these folks can go out and spin off products. So then does the pool of successful creators just simply get smaller? Or will something else happen, technologically speaking, or a different medium that will allow them to find an audience to make money off of?\n\nRebecca:It’s interesting, there’s a lot of ways you can think about what else could happen, right? Maybe they’ll create digital twins of themselves and put their digital twins into a bunch of different situations that can make them [other kinds of] money.\n\nBut again, going back to this not being surprising, these people are now celebrities, right? Someone told me on the phone recently that a lot of [the] younger generation, they don’t know our celebrities, they know TikTok celebrities. And we’ve seen celebrities for years pass off products and make money off of them, right? I used to watch Rachel [Ray], she was a celebrity chef and she sold her EVOO or her olive oil.\n\nWe Slow Ventures on [Equity] sometime last year. They have a creator fund and basically what they’re doing is they’ve raised a VC fund to essentially back creators with their businesses, if they have maybe a niche following, maybe they’re really into woodworking and here’s their collection of chisels, I don’t know.\n\nI think it’s an interesting path forward and it’s something that we see as journalists: How do we also try to be creators and make a brand of ourselves that we could diversify our revenue. It sounds horrible to say it out loud like that.\n\nAnthony:I’m smiling, but it’s the smile of somebody whose soul is slowly turning into ash inside.\n\nSo we took a break from talking about AI, but I will obligatorily bring AI back into the conversation. Obviously one of the other related developments over the past week or so is that ByteDance, which is the Chinese company that launched TikTok and is still an investor — we won’t get intoall of that— they launched a new version of their model, Seedance 2.0, which at least initially was primarily only available to Chinese users.\n\nBut you started to see people posting videos generated by Seedance, including this viral video of Brad Pitt fighting Tom Cruise. That prompted both this general conversation of: Is Hollywood doomed? And then more concretely, a bunch of Hollywood studios, including Netflix, sending ByteDance letters being like, “You cannot do this, you’re basically allowing all your users to generate videos using all of our IP, all of our movie stars.” And for a couple of days, there was no response at all from ByteDance, but then they did say, “Sorry, sorry, sorry, for some reason we launched this without any real guardrails, but we’re gonna do better in the future.”\n\nKirsten:So the timing of this is just perfect because I happen to be editing a story right now that Rebecca wrote. It has nothing to do with Seedance, but it does have to do withAI and filmmaking. So I’m going to give a future ]rops to Rebecca for being timely about that. Rebecca, I know you have a lot to say on that, besides that Hollywood is upset. Is it more complicated than that?\n\nRebecca:Yeah, definitely. I mean, tying this back to the creators thing, I think that a lot of people are going to be using these tools to produce all kinds of content and we’re just going to be absolutely flooded. And that’s going to be intense.\n\nBut when we talk about, whether it’s creating films or ads or just content in general using AI video tools, I think there’s this tension between one, this is going to produce a whole lot of low effort slop versus two, it could also democratize access for a lot of people who don’t have funds or budgets or teams to share a lot of the stories that they want to tell.\n\nAnd also, if you’re a small business and you want to create a little shampoo ad — to be on the nose about it, because there’s a shampoo ad that’s going viral — or you sell coffee and you want to make a little ad for it, [this] could give you the tools to do that. Is that a bad thing? Is it not a bad thing? Do we need more content in the world? There’s a few avenues to walk down.\n\nKirsten:Is it a bad thing, Anthony?\n\nAnthony:In terms of the creator side of it, my general feeling is [that] the response to a lot of this kind of slop — frankly, a lot of itisslop, and I think that’s going to continue to be the case — is going to be this valuing of authenticity. And so there is the opportunity for these big creators is be less about the idea of like, “I have digital twins of myself,” but [instead,] “No, I’m the real Mr. Beast, not the digital simulacra wandering around.”\n\nAnd I think it’s also telling that – of course, every social network has ups and downs, but that OpenAI’s Sora, from what I understand, had skyrocketed at the beginning and then has beenstruggling to hold on to usersmore recently, because there is a certain emptiness to the experience when you just feel like there’s not an authentic human being on the other side.\n\nBut I think it’s also going to make the landscape much more challenging, both for the established creators to monetize […] and then I think it’s going to be especially hard for new creators because there’s just going to be so much more stuff. Trying to actually break out is going to become super difficult.",
      "excerpt": "Online creators and their business models were on our mind this week after mega-popular YouTuber MrBeast announced thathis company is buying fintech startup Step, followed byHollywood studios sending a flurry of cease-and-desist lettersto ByteDance over the launch of its new video generation model S",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Bill Gurley says that right now, the worst thing you can do for your career is play it safe",
      "link": "https://techcrunch.com/2026/02/22/bill-gurley-says-that-right-now-the-worst-thing-you-can-do-for-your-career-is-play-it-safe/",
      "author": "Connie Loizos",
      "date": "2026-02-22T13:08:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-1249266599.jpg?resize=1200,800",
      "category": "Venture",
      "content": "For nearly three decades, Bill Gurley has been among of the most influential voices in Silicon Valley — a general partner at Benchmark whose early bets on companies like Uber, Zillow, and Stitch Fix helped define what modern venture capital looks like. Now, having moved to Austin and stepped back from active investing, the native Texan is channeling that same pattern-recognition instinct into something different: a book, a foundation, and a policy institute aimed at problems he thinks he can actually move.\n\nThe book isRunnin’ Down a Dream— a nod to Tom Petty and also an argument that following your passion isn’t just romanticized career advice but an actual competitive strategy, one that becomes only more urgent as AI rapidly reshapes the workforce. The foundation, which he’s calling the Running Down a Dream Foundation, will award 100 grants of $5,000 a year to people who need a financial cushion to make a leap they’ve been afraid to take.\n\nWe caught up with Gurley to talk about all of it — including what he makes of the somewhat surreal reality that several of his former peers in tech now hold enormous sway in Washington, why he thinksthe 996 grind culturemany young founders have adopted is less alarming than it sounds, and what AI really means for your career. The following has been edited for length and clarity. Our full conversation with Gurley drops Tuesday on TC’sStrictlyVC Downloadpodcast.\n\nWhy write this book?\n\nI went through a phase where I was reading a lot of biographies — people from very different fields, different time windows — and I started noticing patterns the way I would notice patterns in a market evolving. I wrote them down. A couple years later I got invited to speak at the University of Texas, dusted off the notes, built a presentation. They posted it on YouTube, and James Clear — who wroteAtomic Habits— noticed and posted about it. That’s what got me thinking about a book. And when I went through my own process of moving away from venture and thinking about what I wanted to do next, it became obvious I didn’t want to write about VC or Uber or any of that. I wanted to do something that could have a bigger mission.\n\nYour research with Wharton found that roughly 60% of people would do things differently if they could start their careers over. That shocked you. Why?\n\nWhen we first ran it as a SurveyMonkey poll we got seven out of ten. When we did it more rigorously with Wharton, we got six out of ten. One of the things that strikes me is that we have a phrase in the book — life is a use it or lose it proposition — and when you’re young, it’s just hard to have that framing. It’s hard to fast-forward through all of your time and recognize how precious it is. Daniel Pink has done a lot of work on what he calls regrets of inaction — the thing that weighs on people most as they get older is the thing they didn’t try, the stone left unturned. That holds across multiple geographies and cultures. And I think a lot of well-intentioned parents feel more responsibility to create economic stability for their kids than to encourage them to truly explore their passion. Especially with AI out there, that may not have been the right call.\n\nExploring your passion sounds like easier advice for people who have financial runway. What do you say to someone working paycheck to paycheck?\n\nA few things. First, the book profiles people who started on the very bottom rung and climbed to the top — [celebrity hairstylist and entrepreneur] Jen Atkins moved to LA with $200 in her pocket. There’s nothing in the book that says you need to start anywhere other than right at the beginning. Second, if you’re living paycheck to paycheck, I wouldn’t encourage you to quit. I’d encourage you to use your free time to build a little document on your phone about what your thing might be. Learn. Prepare to jump before you jump. And third — this is why I’m launching the foundation. The last page of the book talks about it: we’re going to give 100 grants a year of $5,000 to people who are in exactly that position, who can convince us in an application that they’ve thought long and hard about where they want to go but need a little help getting there.\n\nYou’ve been outspoken for years about regulatory capture — the idea that big companies use regulation to entrench themselves.\n\nI gave a speech on regulatory capture a few years back — it was at the All-In Summit — and at the time I said I had a fear that the AI companies would try to use regulation to protect themselves. I think that’s happening now. The flip side is that there are legitimate questions: Jonathan Haidt’s bookAnxious Generationhas been on the bestseller list for almost two years, arguing social media has been really bad for children, with academic research to back it up. People would say we should have gotten in front of social media and need to do it with AI. The problem is that the people begging for regulation the most in AI are the actual companies themselves, and that makes me skeptical. There’s also the global dimension — if US AI gets entangled in state-by-state regulation and Chinese models are running free, we’re going to paint ourselves in red tape. I always ask people: what are your favorite five regulations of all time, and how were they successful? Do you have any confidence that people at the state level in a random state know how to write good AI regulation that will actually work?\n\nIt’s a little surreal that several prominent figures from your world now hold enormous influence in Washington. What do you make of that?\n\nIt’s very ironic. If you go back and watch that regulatory capture talk, who would have thought a few years later David Sacks would actually be [special advisor for AI and crypto in the White House]?\n\nBack in 2018, Mike Moritz of Sequoia wrote in the FT that Americans would lose to China if they didn’t startworking harder. It was controversial at the time, but a lot of young founders here seem to have since embraced a punishing work culture — the 996 ethos. What are your thoughts about what’s happening?\n\nI kind of love it, honestly. I think Silicon Valley got really lazy during COVID — people weren’t coming into the office, the culture got soft in a way I hadn’t seen in all my years there. And I’ve been to China six times. I know what Michael Moritz was describing when he said we’re going to lose not because they’re smarter but because they have a better work ethic. But here’s the thing: if you study successful people across a lot of fields, we think it’s wonderful when an athlete practices 12 hours a day or when an artist works obsessively on their craft. Nobody says Jordan didn’t have work-life balance. We just don’t extend the same logic to building a company. If those founders love what they’re doing that much, and they feel like this is the moment to go hard, that’s actually precisely the point of the book: find the thing that makes you feel that way.\n\nYou talk about mentorship in the book. What makes a great mentor relationship and how do people find one?\n\nThe number one thing is to get out of your head this ideal that gets passed around in the self-help world: ‘go get a mentor,’ and everyone runs out and cold calls someone that’s ridiculously too high and unachievable, and it doesn’t work. For all those people that are really out of reach right now, I call them aspirational mentors — create a persona of them, just like I was talking about with the dream job folder. Get clips of all the books they’ve written, podcasts they’ve done, interviews they’ve done, and study them. You can learn a lot from people without talking to them directly, especially in the modern age. And then for your real mentors, go two levels down from where you thought you were going to aim. Discover somebody — tools like LinkedIn make this so easy — and be the first person to ever call them and ask them to be a mentor, because they’ll be flattered. They’ll be flattered that you knew who they were. Imagine anyone getting their first call to be a mentor. It’s a great feeling. You’re going to have way more success with that interaction than shooting too high.\n\nI’ll tell you a funny story: I started getting so many calls from people who wanted to break into venture that I wrote a three-page PDF called “So You Want to Be a VC,” and hidden in the third page was basically — go do X, go do Y, go do Z, come back and tell me how that went. The number of people that actually ended up talking to me after getting that document was a fraction of the number I sent it to. It’s funny how much it thinned when you gave them a little homework to do.\n\nYou started working on this book before the impacts of AI became clearer. Does that at all change how people should think about their careers?\n\nIf you’re following the traditional path — going through the career center at your university, signing up on a list, waiting for a recruiter to sit through 30 people in 20-minute slots — you look like a cog. You look mass-produced. For that group, AI looks frightening, and maybe it should. But if you are blazing your own trail, using the techniques in the book, becoming what I call a candidate of one — someone whose path looks completely unique because you’ve built it intentionally — then every tool in this book is amplified by AI. Learning has never been easier than right now, in the entire history of the world. If you’re running toward it, if you’re becoming the most AI-aware person in your field, this thing is nothing but a superpower.",
      "excerpt": "For nearly three decades, Bill Gurley has been among of the most influential voices in Silicon Valley — a general partner at Benchmark whose early bets on companies like Uber, Zillow, and Stitch Fix helped define what modern venture capital looks like. Now, having moved to Austin and stepped back fr",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}