{
  "last_updated": "2026-02-23T20:48:29.769868+00:00",
  "articles": [
    {
      "title": "OpenAI calls in the consultants for its enterprise push",
      "link": "https://techcrunch.com/2026/02/23/openai-calls-in-the-consultants-for-its-enterprise-push/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-23T10:11:08-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2206295463.jpg?resize=1200,800",
      "category": "Enterprise",
      "content": "OpenAI is beefing up partnerships with four major consulting giants as the AI company looks to grow its enterprise business in 2026.\n\nOpenAI announced on Monday the“Frontier Alliance,”a signal that the AI lab is willing to try different approaches to get enterprises to meaningfully adopt its technology. The alliance includes multi-year partnerships between OpenAI and four major consulting firms, Boston Consulting Group (BCG), McKinsey, Accenture and Capgemini, to sell its enterprise products.\n\nOpenAI’s Forward Deployed Engineering team will work with the consulting giants to help them implement OpenAI’s enterprise-focused technologies like OpenAI Frontier into customers’ tech stacks.\n\nThe companylaunched OpenAI Frontier in early February. The no-code open software allows users to build, deploy, and manage AI agents both built on OpenAI’s AI models and beyond.\n\nOpenAI argues in its latest announcement that consultants are the right avenue to get enterprises on board.\n\n“AI alone does not drive transformation. It must be linked to strategy, built into redesigned processes, and adopted at scale with aligned incentives and culture to deliver sustained outcomes,” BCG CEO Christoph Schweizer said in OpenAI’s blog post. “Our expanded partnership combines OpenAI’s Frontier platform with BCG’s deep industry, functional, and tech expertise and BCG X’s build-and-scale capabilities to drive measurable impact with safeguards from day one.”\n\nThus far,enterprise adoption of AI has been relatively slowas these companies struggle to find a meaningful return on investment from their AI pursuits.\n\nOpenAI’s alliance strategy makes sense and goes beyond just pitching enterprises on attaching AI to their existing workflows. Instead, this effort focuses on consultants persuading companies to change their strategies and workflows to fold in OpenAI’s tools where it makes sense.\n\nIt’s worth noting the OpenAI rival Anthropic has inked deals with consulting giants includingDeloitteandAccenturein recent months too.\n\nCompany CFO Sarah Friar wrote in a blog post in January that enterprise is abig area of focus for OpenAIin 2026. OpenAI has also inked sizable enterprise AI deals withSnowflakeandServiceNowso far this year, in addition to naming Barret Zoph to lead the company’s enterprise sales effort in January.",
      "excerpt": "OpenAI is beefing up partnerships with four major consulting giants as the AI company looks to grow its enterprise business in 2026.\n\nOpenAI announced on Monday the“Frontier Alliance,”a signal that the AI lab is willing to try different approaches to get enterprises to meaningfully adopt its technol",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Guide Labs debuts a new kind of interpretable LLM",
      "link": "https://techcrunch.com/2026/02/23/guide-labs-debuts-a-new-kind-of-interpretable-llm/",
      "author": "Tim Fernholz",
      "date": "2026-02-23T09:53:28-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-23-at-9.31.05-AM.png?resize=1200,639",
      "category": "AI",
      "content": "The challenge of wrangling a deep learning model is often understanding why it does what it does: Whether it’s xAI’s repeated struggle sessions to fine-tune Grok’s odd politics, ChatGPT’s struggles with sycophancy, or run-of-the-mill hallucinations, plumbing through a neural network with billions of parameters isn’t easy.\n\nGuide Labs, a San Francisco startup founded by CEO Julius Adebayo and chief science officer Aya Abdelsalam Ismail, is offering an answer to that problem today. On Monday, the company open sourced an 8-billion-parameter LLM,Steerling-8B, trained with a new architecture designed to make its actions easily interpretable: Every token produced by the model can be traced back to its origins in the LLM’s training data.\n\nThat can be as simple as determining the reference materials for facts cited by the model, or as complex as understanding the model’s understanding of humor or gender.\n\n“If I have a trillion ways to encode gender, and I encode it in 1 billion of the 1 trillion things that I have, you have to make sure you find all those 1 billion things that I’ve encoded, and then you have to be able to reliably turn that on, turn them off,” Adebayo told TechCrunch. “You can do it with current models, but it’s very fragile … It’s sort of one of the holy grail questions.”\n\nAdebayo began this work while earning his PhD at MIT, co-authoring a widely cited2018 paperthat showed existing methods of understanding deep learning models were not reliable. That work ultimately led to the creation of a new way of building LLMs: Developers insert a concept layer in the model that buckets data into traceable categories. This requires more up-front data annotation, but by using other AI models to help, they were able to train this model as their largest proof of concept yet.\n\n“The kind of interpretability people do is … neuroscience on a model, and we flip that,” Adebayo said. “What we do is actually engineer the model from the ground up so that you don’t need to do neuroscience.”\n\nOne concern with this approach is that it might eliminate some of the emergent behaviors that make LLMs so intriguing: Their ability to generalize in new ways about things they haven’t been trained on yet. Adebayo says that still happens in his company’s model: His team tracks what they call “discovered concepts” that the model discovered on its own, like quantum computing.\n\nAdebayo argues this interpretable architecture will be something everyone needs. For consumer-facing LLMs, these techniques should allow model builders to do things like block the use of copyrighted materials, or better control outputs around subjects like violence or drug abuse. Regulated industries will require more controllable LLMs — for example, in finance — where a model evaluating loan applicants needs to consider things like financial records but not race. There’s also a need for interpretability in scientific work, another area where Guide Labs has developed technology. Protein folding has been a big success for deep learning models, but scientists need more insight into why their software figured out promising combinations.\n\n“This model demonstrates that training interpretable models is no longer a sort of science; it’s now an engineering problem,” Adebayo said. “We figured out the science and we can scale them, and there is no reason why this kind of model wouldn’t match the performance of the frontier level models,” which have many more parameters.\n\nGuide Labs says that Steerling-8B can achieve 90% of the capability of existing models, but uses less training data, thanks to its novel architecture. The next step for the company, which emerged from Y Combinator and raised a $9 million seed round from Initialized Capital in November 2024, is to build a larger model and begin offering API and agentic access to users.\n\n“The way we’re currently training models is super primitive, and so democratizing inherent interpretability is actually going to be a long-term good thing for our role within the human race,” Adebayo told TechCrunch. “As we’re going after these models that are going to be super intelligent, you don’t want something to be making decisions on your behalf that’s sort of mysterious to you.”",
      "excerpt": "The challenge of wrangling a deep learning model is often understanding why it does what it does: Whether it’s xAI’s repeated struggle sessions to fine-tune Grok’s odd politics, ChatGPT’s struggles with sycophancy, or run-of-the-mill hallucinations, plumbing through a neural network with billions of",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Particle’s AI news app listens to podcasts for interesting clips so you you don’t have to",
      "link": "https://techcrunch.com/2026/02/23/particles-ai-news-app-listens-to-podcasts-for-interesting-clips-so-you-you-dont-have-to/",
      "author": "Sarah Perez",
      "date": "2026-02-23T08:55:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/share_6305813549552173171.png?resize=540,1200",
      "category": "Apps",
      "content": "An AI news app calledParticle, fromformer Twitter engineers, can now keep up with news breaking on podcasts as well as news published on the web.\n\nJust ahead of its recent Android release, Particle has introduced a feature called Podcast Clips, which finds the most interesting and relevant moments across many different types of podcasts, and then includes those clips alongside the related news stories in its feed.\n\nSo instead of listening to a lengthy podcast just to catch the 45 seconds of interesting comments, you can play back the clip as you’re reading the news on Particle. You also have the option of reading the transcript of the clip instead, as the words are highlighted as they’re spoken.\n\n“We’ve done that basically for any news story — if there is a podcast that is talking about it, or relevant at all, we’ve got all those clips,” Particle CEOSara Beykpour, previously the Senior Director of Product Management at Twitter, told TechCrunch. “It’s a really cool way, when you’re reading a story or learning about a story, to get a breath of what are people saying about this? What’s the commentary?”\n\nThe addition acknowledges a shift in the news ecosystem that’s been underway for years. Not only are more peoplegetting their news from podcastsand trusting them as reliable sources, but the medium is alsobecoming a destinationfor breaking news and major announcements from public figures.\n\nTech CEOs, in particular, are now seeking out friendly podcast hosts to air their talking points instead of trying to work with traditional media, asBloomberg reportedin 2024.\n\nThat makes paying attention to podcasts even more critical if you want to keep up with news.\n\nBeykpour says Particle usesembedding modelsto understand when podcasts relate to a given news story. These models are provided by the same companies that provide LLM models, but they’re not generative AI technologies, she explains.\n\n“We use vector embeddings to understand that these different parts of the podcasts are related to these different stories,” Beykpour notes. “A single podcast might cover 10 or 20 stories, so we use AI to understand that. We also use AI to do some of the logic around clipping, and understanding when to start a clip and end a clip.”\n\nThe company leverages technology from ElevenLabs for transcription. However, some of the technology that identifies where exactly to clip the audio is part of Particle’s secret sauce.\n\nThe idea to tap into podcasts to better understand the commentary around news is also something newsrooms are taking a closer look at these days. AsNieman Lab reportedthis month, The New York Times has been using a custom AI tool that employs LLMs to transcribe and summarize new episodes of dozens of right-wing and more conservative podcasts to better understand what influencers on that side are saying about the news.\n\nParticle’s Podcast Clips feature isn’t tied to only news stories. Because the app already understands different entities — like people, places, or things — you can go to the page for a notable figure, such as OpenAI CEO Sam Altman, to see all of his appearances on podcasts arranged as a feed.\n\nParticle has been busy building other features as well. The company has made its first attempt at monetization with Particle+, an optional $2.99/month subscription (or $29.99/year) that lets you access premium features. These include the ability to use natural language to have the news summarized in a style you prefer; pick from different voices when using the personalized audio feed; “Listen to the News”; unlimited crossword puzzles; support for private questions with its AI chatbot; and more.\n\nThe Android release also brings a couple of other notable changes. The browse tab now includes timely stories, like the 2026 Winter Olympics, in addition to typical sections like politics, tech, or entertainment. Plus, when you tap on an entity, you’ll see a new page with the definition, stories, articles, related entities, and related topics.\n\nParticle isn’t sharing data about user activity or conversion rates, but Beykpour did point to the app’s international audience, pre-Android. On a weekly basis, 55% of Particle’s users are outside the U.S., with India (15%) its biggest market after the U.S.",
      "excerpt": "An AI news app calledParticle, fromformer Twitter engineers, can now keep up with news breaking on podcasts as well as news published on the web.\n\nJust ahead of its recent Android release, Particle has introduced a feature called Podcast Clips, which finds the most interesting and relevant moments a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Defense Secretary summons Anthropic’s Amodei over military use of Claude",
      "link": "https://techcrunch.com/2026/02/23/defense-secretary-summons-anthropics-amodei-over-military-use-of-claude/",
      "author": "Rebecca Bellan",
      "date": "2026-02-23T06:19:10-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2260256117.jpg?w=1024",
      "category": "",
      "content": "Defense Secretary Pete Hegseth is calling in Anthropic CEO Dario Amodei to the Pentagon on Tuesday morning to discuss the military use of Claude, according to reporting fromAxios.\n\nThe meeting comes as the Pentagon threatens to declare Anthropic a “supply chain risk” — a label typically reserved for foreign adversaries — after the AI firm refused to allow the Department of Defense to use its tech for the mass surveillance of Americans and the development of weapons that fire without human involvement.\n\nAnthropic signed a $200 million contract with DOD last summer, and Claude wasreportedlyused during the January 3 special operations raid that resulted in the capture of Venezuelan president Nicolás Maduro, an episode that brought the two sides’ tensions into the open.\n\nA source told Axios that Hegseth is giving Amodei an ultimatum: play ball or be banished. It’s unclear whether he’s bluffing — replacing Anthropic would be a significant undertaking. But the stakes are real: A supply chain risk designation would void Anthropic’s contract and force other Pentagon partners to drop Claude entirely.",
      "excerpt": "Defense Secretary Pete Hegseth is calling in Anthropic CEO Dario Amodei to the Pentagon on Tuesday morning to discuss the military use of Claude, according to reporting fromAxios.\n\nThe meeting comes as the Pentagon threatens to declare Anthropic a “supply chain risk” — a label typically reserved for",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "China’s brain-computer interface industry is racing ahead",
      "link": "https://techcrunch.com/2026/02/22/chinas-brain-computer-interface-industry-is-racing-ahead/",
      "author": "Kate Park",
      "date": "2026-02-22T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2022/12/GettyImages-1202271610.jpg?resize=1200,900",
      "category": "Biotech & Health",
      "content": "While Elon Musk’s Neuralink likes to say it’s “pioneering” brain-computer interfaces (BCIs), China’s BCI industry is already quietly moving from research to scale.\n\nA new wave of startups is racing to commercialize both implantable and noninvasive BCIs, backed by stronger policy support, expanding clinical trials, and growing investor interest. So says Phoenix Peng, who has founded not one but two BCI startups. He’s a co-founder of NeuroXess, maker of BCI implants, as well as founder and CEO of noninvasive ultrasound BCI startup Gestala.\n\nHis belief in the potential of this market is founded on concrete action: Provinces such as Sichuan, Hubei, and Zhejiang have alreadyset medical service pricingfor BCI, speeding its inclusion in the national medical insurance system.\n\nOver time, he foresees the technology extending beyond medicine “treating disease” to “human augmentation,” he said.\n\n“I have always maintained that neuroscience and AI are two sides of the same coin,” Peng said. “They are destined for deep integration, realizing direct high-bandwidth connections between the human brain and AI. BCI will serve as the ultimate bridge between carbon-based and silicon-based intelligence. While this may sound distant, it represents an unimaginably vast market in the future.”\n\nBut over the next three to five years, BCI use is likely to stay concentrated in healthcare, with the market reaching multibillion-dollar scale as insurance coverage expands, Peng told TechCrunch.\n\nIn August 2025, China’s industry ministry and six other agenciesreleased a national roadmapto further speed development of BCIs. The plan targets major technical milestones by 2027, common industry standards, and a full supply chain by 2030, with the goal of building globally competitive BCI companies and supporting smaller specialized firms.\n\nAsked what’s driving China’s rapid progress in BCI, Peng told TechCrunch it comes down to four factors. The first one is strong policy support, with cross-department collaboration that aligns technical standards and medical reimbursement. In December, at the 2025 Shenzhen BCI & Human-Computer Interaction Expo, Chinaannouncedan 11.6 billion yuan ($165 million) brain science fund to support BCI companies from research through commercialization.\n\nThe second factor is vast clinical resources, including large patient pools and lower research costs that accelerate trials. China’s national health insurance means quicker commercialization once the state approves a device. This compares to the U.S. where even after the FDA approves a device, private insurers, as the main payers, must each individually do so.\n\nResearchers have completed the country’s first fully implanted, wireless BCI trial — only the second globally — allowing a paralyzed patient to control devices without external hardware,per CGTN. Neuralink is the startup thatcompletedthefirst such trial.\n\n“In traditional electrical BCIs, Chinese firms have achieved clinical progress in motor and language decoding, spinal cord reconstruction, and stroke rehabilitation, with over 50 flexible implantable BCI clinical trials completed by mid-2025,” Peng said, adding that next-generation efforts are now moving toward whole-brain neural decoding and encoding, including ultrasound-based approaches such asGestala’s.\n\nThe third factor is China’s mature industrial manufacturing, Peng points out, spanning semiconductors, AI, and medical hardware, which supports fast R&D and prototyping. Finally, there is strategic investment in the market, with both state-led funds and private capital surging under national initiatives.\n\nSome recent key deals include Shanghai-based BCI startupStairMedTechnology raising $48 million (350 million yuan) in Series B funding in February 2025. BrainCo, a neurotech company developing its noninvasive BCIs and bionic limbs,has also quietlyfiled for a Hong Kong IPO, according to reports, after raising$287 million (2 billion yuan)earlier this year. Peng’s company, Gestala, which launched in January, is in talks with investors to close an angel round soon, he tells us.\n\nAll told, China’s BCI startups are ramping up to challenge U.S. leaders like Neuralink, Synchron, and Paradromics. Amongthe most active playersin China are NeuroXess, Neuracle, NeuralMatrix, BrainCo, Bo Rui Kang Tech, Aoyi Tech, Brainland Tech, and Zhiran Medical. They span approaches from implantable flexible interfaces to noninvasive brain-computer technologies.\n\nThis means that China’s BCI market was expected to grow to more than $530 million (3.8 billion yuan) in 2025, up from 3.2 billion yuan in 2024,according to media reports,with projectionsputting the market at over 120 billion yuan by 2040.\n\nBCIs are taking two paths. The first is invasive electrophysiological BCIs like NeuroXess and Neuralink that implant electrodes in people’s brains for precise neuron-level signals. But this type comes with surgery risks. The second type is noninvasive systems likeNeuroSkyandBrainCothat trade some precision for safety and ease of use. (These devices — typically headsets or headbands using electroencephalography (EEG) — read electrical activity through the skull.)\n\nThe field is now broadening further, with emerging approaches — including ultrasound, magnetoencephalography imaging, transcranial magnetic stimulation, optical methods, and hybrid BCIs — giving researchers new tools to read and influence brain activity.\n\nStartup founders also hope that noninvasive technology could help overcome adoption barriers. Not everyone is willing to undergo brain surgery to have a device implanted in their heads.\n\nUltrasound BCIs from companies likeOpenAI-backed Merge Labsand Gestala are targeting high-prevalence conditions such as chronic pain, stroke, and depression. As noninvasive solutions, these technologies are more readily accepted by patients and offer significantly greater commercial scalability.\n\nGestala, for instance, expects to roll out its first-generation product by Q3, said Peng. Early clinical trials have shown promising results, he added, saying that a single session reduced pain scores by 50%, with effects lasting one to two weeks.\n\nHSG, formerly Sequoia China, has meanwhile invested in Zhiran Medical, a startup founded in 2022 focused on improving long-term implant performance. The company uses flexible, high-throughput electrodes to reduce inflammation and signal loss associated with rigid implants.\n\n“Some technologies may look cutting-edge but far from practical application,” Yang Yunxia, a partner at HSG,wrote in a blog post. While others appear commercially viable, they face “high costs” or significant technical barriers, Yunxia contended. Ultimately, investment decisions come down to whether the investor believes a product can be developed into a sustainable business, the partner noted.\n\nOver the next five years, industry insiders expect China’s BCI regulations to align more closely with international standards, with a particular focus on regulatory approval and data sovereignty. Global frameworks developed by organizations such as theIECandISO, along with guidance from theU.S. Food and Drug Administration (FDA), are expected to serve as key reference points.\n\nChinese regulators are also expected to tighten oversight of invasive devices, as well as the data that all BCI devices generate, while easing approval for noninvasive technologies.\n\nAs for the ethicsthat confront brain-implanted or manipulating devices, China plans to strengthen informed-consent requirements, broaden ethics review beyond medicine, and move toward unified technical standards for clinical evaluation.",
      "excerpt": "While Elon Musk’s Neuralink likes to say it’s “pioneering” brain-computer interfaces (BCIs), China’s BCI industry is already quietly moving from research to scale.\n\nA new wave of startups is racing to commercialize both implantable and noninvasive BCIs, backed by stronger policy support, expanding c",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The 9,000-pound monster I don’t want to give back",
      "link": "https://techcrunch.com/2026/02/22/the-9000-pound-monster-i-dont-want-to-give-back/",
      "author": "Connie Loizos",
      "date": "2026-02-22T02:59:08-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-22-at-2.19.29-AM.png?resize=1200,767",
      "category": "Transportation",
      "content": "Before heading on a trip to Tahoe last weekend, GM offered me the use of the company’s 9,000-pound monument to excess — the new 2026 electric Escalade IQL (starting at $130,405) — for a week to test-drive. Before you continue, note that I’m not a professional car reviewer. TechCrunch has excellent transportation writers; I am not one of them. I do, however, drive anelectric car.\n\nI was immediately game. I’d first glimpsed one last summer at a car show, where some regional car dealers had stationed themselves at the end of a long field dotted with exquisite vintage automobiles. My immediate reaction was “Jesus, that’s enormous,” followed by a surprising admiration for its design, which, despite its enormous scale, shows restraint. For lack of a better word, I’m going to say it’s “strapping.” Its proportions just work.\n\nMy excitement waned pretty quickly when the car was dropped off at my house a day before our departure time. This thing is a monstrosity — at 228.5 inches long and 94.1 inches wide, it made our own cars look like toys. My first apartment in San Francisco was smaller. Trying to drive it up my driveway was a little harrowing, too; it’s so big, and its hood is so high, that if you’re ascending a road at a certain slope — we live midway down a hill; our mailbox is at the top of it — you can’t see whatever is directly in front of the car.\n\nI thought about just leaving it in the driveway for the duration of the trip. The other alternative was doing what I could to grow more comfortable with the prospect of driving it 200 miles to Tahoe City, so I tooled around in it that night and the next day, picking up dinner, heading to an exercise class — just basic stuff around town. When I ran into a friend on the street, I volunteered as quickly as possible that this was not my new car, that I was going to possibly review it, and wasn’t its size ridiculous? It felt like a tank. I thought: other than hotels that use SUVs like the Escalade to ferry guests around, what kind of monster chooses a car like this?\n\nFive days later, it turns out that I am that kind of monster.\n\nLook, I don’t know how or when I fell for this car. If I’d written this review after two days, it would read very differently. Even now, I’m not so blind that I don’t see its shortcomings.\n\nIt was the Escalade’s performance in a terrible snowstorm that really won my heart, but let me walk you through the steps between “Ugh, this car is a tank” and “Yes! This car is atank.”\n\nJust getting into it requires a little more exertion than would seem to make sense. I’m fairly athletic and I still found myself wondering if this thing shouldn’t come with an automated step stool.\n\nInside is where digital maximalism does its work. The dashboard opens with a 55-inch curved LED screen with 8K resolution that reads less like a car display and more like a situation room. Front passengers get their own screens. Second-row passengers also get 12.6-inch personal screens along with stowable tray tables, dual wireless chargers, and — with the most lavish version of the car — massage seats that will make them forget they’re in a vehicle at all. Google Maps handles navigation. And the polarized screen technology deserves its own praise: while one of my kids binge-watched Hulu in the front seat, not a frame of it leaked into my sightline from behind the wheel.\n\nThe cabin itself is built around the premise that no one inside should feel crowded, and it delivers. Front legroom stretches to 45.2 inches; the second row offers 41.3; even the third row manages 32.3 inches. Seven adults could share this machine for a long while without fraying each other’s nerves. Heated and ventilated leather seats with 14-way power adjustment come standard in the first two rows, and the whole operation runs on 5G Wi-Fi.\n\nThe car also comes standard with Super Cruise, GM’s hands-free driving system, which I’m not sure I quite figured out. True car reviewers seem to love it; when I tried it, the car felt like it was drifting to an alarming degree between the outer boundaries of the highway lane, and when that happens, it unleashes an escalating sequence of warnings. First, a red steering wheel icon materializes on-screen. Then your seat pulses haptic warnings against your rump. Ignore those and a chime — both reminder and reproach — fills the cabin. GM calls this impolite series a “driver takeover request.”\n\nDid I mention the 38-speaker AKG Studio sound system? So good.\n\nAs for the exterior — this is a handsome giant, but it takes some getting used to. At first, I found the grille, which is just for show, almost comically imposing. This is definitely a car for people who are the boss, or want to be the boss, or want to look like the boss while privately dealing with existential crises. Pulling up to a glass-lined restaurant one night, I’m pretty sure I blinded half the patrons as I swung into a parking spot perpendicular to the building, the Escalade’s headlights flooding through the windows.\n\nThen there is the light show the car launches whenever it detects you approaching via the key or the myCadillac app. It’s as if it’s saying, “Hey, chief, where we headed?” before you’ve so much as touched a door handle. (In the vernacular of Cadillac, this is thanks to its “advanced, all-LED exterior lighting system,” highlighted by a “crystal shield” illuminated grille and crest, along with vertical LED headlamps and “choreography-capable tail lamps.”)\n\nIt is, objectively, a bit much. I loved it immediately.\n\nDespite its size, the Escalade IQL is unexpectedly nimble. Not “sports car darting through traffic” nimble, but “I can’t quite believe something this colossal doesn’t handle like a battleship” nimble.\n\nNow we arrive at the frustrations. The front trunk — or “frunk” in the lexicon of EV devotees — operates in mysterious and frustrating ways. Opening requires holding the button until completion. Release prematurely and it halts mid-ascent, forcing you to restart the entire sequence. Closing demands the same sustained pressure. The rear trunk, conversely, requires two distinct taps followed by immediate button abandonment. Hold too long and nothing happens.\n\nRelatedly, twice, the vehicle refused to power down after I’d finished driving. The car simply sat there, running, even when I shifted to park and opened the door (which tells the car to turn off). One clunky solution: open the frunk, close the frunk, shift into drive, then park, then exit.\n\nAs for the software, it’s absolutely fine unless you’ve owned a Tesla, in which case, prepare for disappointment. This seems to be true across the board — everyone I know who owns both a Tesla and another EV, no matter how high end, says the same thing. Once you’ve internalized how effortlessly Tesla’s software dissolves barriers between intention and execution, every other automaker’s software feels like a compromise.\n\nWhich brings us to the nadir of the trip: charging in Tahoe during winter. For all its virtues, the Escalade IQL is, by any measure, a thirsty machine. The battery is a 205 kWh pack — enormous, and it needs to be, because the car burns through roughly 45 kWh per 100 miles, which is considerably more than comparable electric SUVs. Cadillac estimates 460 miles of range on a full charge, and in ideal conditions that holds up. Tahoe in winter, however, is not ideal conditions. We’d also arrived with less charge than we should have. A series of side trips on the way up, including an emergency detour to find shirts for a family member who had packed none, had eaten into the battery more than expected. By the time we needed to charge, we genuinely needed to charge.\n\nWe approached a Tesla Supercharger in Tahoe City that appeared on the myCadillac app, but when we plugged in to the designated stall, nothing happened. We searched for answers, discovering that even Tesla stations that accept non-Tesla vehicles throttle energy to 6 kilowatts per hour anyway, but it was a frustrating experience. A nearby EVGo had shuttered a month prior. ChargePoint’s two units at the Tahoe City Public Utility lot were broken and willing to connect but not to actually charge anything. We briefly contemplated a 35-mile drive to Incline Village, did the math on what stranded would actually look like, and decided against it. Then I discovered an Electrify America station 12 miles away. We drove through gathering snow, arrived shortly before 11 p.m., and it worked. We sat there for an hour fighting exhaustion before driving home.\n\nThe following morning revealed another issue via an app alert: tire pressure had dropped to 53 and 56 PSI in the front (recommended: 61) and 62 PSI in the rear (recommended: 68). I have no idea whether the car had been delivered that way or whether something else was going on beyond the cold weather — either way, it meant someone standing at a gas station filling tires while being pelted directly in the face with ice. (That someone was my husband.) For a family trip, it was going great.\n\nAt this point, in fact, I would have told you that the Escalade IQL is unquestionably luxurious and ideal for families of four or more who value space and technology. I would tell you it came burdened by real tradeoffs: forward visibility obstructed by its commanding hood, parking challenges inherent to its dimensions, limited charging infrastructure for a machine this ravenous, and tires tasked with supporting 9,000 pounds. It’s a beautiful car, I would have said, but it’s not for me.\n\nBut the snow that had started to fall kept falling. Within two days, eight feet had accumulated, making it impossible to ski — the entire point of the trip — and terrifying to move about town. Except I found that I wasn’t terrified because we had the Escalade, which, because of its weight, felt like driving a tank through the snow. (The tires held steady after we’d inflated them, even as the week kept doing its worst.) What could have been harrowing felt serene. It was quiet, it was strong, it was taking charge in a bad situation.\n\nI also adjusted to the size. By the end of this past week I had stopped mouthing “I’m sorry” to whoever who was waiting for me to figure out where to park it. I had stopped caring what it said about me that I was driving a car whose entire design philosophy is: the owner of this vehicle is not waiting in line. Eight feet of snow had fallen, we needed groceries, and I was the one with the tank, suckers! I could sense my husband falling for the car, too.\n\nThen, as tends to happen in Tahoe, the snow stopped all at once and the sun came out, and the Escalade was just a very dirty car sitting in the driveway (sorry, GM!). It was in this moment that I realized: I still like it, and it’s not because of the emergency alone. I love riding high, with the speaker system flooding the car with a favorite soundtrack. That light show still gets me. The car’s long, curved LED screen is a marvel, among other features.\n\nThe frunk is still problematic. I won’t soon forget the panic of not being able to charge the car where I thought I could. Parking this thing is truly an exercise in patience. I have strong opinions about unnecessary consumption. None of that has changed.\n\nI just also, somehow, want this car, so when the GM middleman comes to collect it, I may hide it under a tarp — a very large tarp — and tell him he has the wrong address.",
      "excerpt": "Before heading on a trip to Tahoe last weekend, GM offered me the use of the company’s 9,000-pound monument to excess — the new 2026 electric Escalade IQL (starting at $130,405) — for a week to test-drive. Before you continue, note that I’m not a professional car reviewer. TechCrunch has excellent t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Bill Gurley says that right now, the worst thing you can do for your career is play it safe",
      "link": "https://techcrunch.com/2026/02/22/bill-gurley-says-that-right-now-the-worst-thing-you-can-do-for-your-career-is-play-it-safe/",
      "author": "Connie Loizos",
      "date": "2026-02-22T13:08:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-1249266599.jpg?resize=1200,800",
      "category": "Venture",
      "content": "For nearly three decades, Bill Gurley has been one of the most influential voices in Silicon Valley — a general partner at Benchmark whose early bets on companies like Uber, Zillow, and Stitch Fix helped define what modern venture capital looks like. Now, having moved to Austin and stepped back from active investing, the native Texan is channeling that same pattern-recognition instinct into something different: a book, a foundation, and a policy institute aimed at problems he thinks he can actually help solve.\n\nThe book is “Runnin’ Down a Dream” — a nod to Tom Petty and also an argument that following your passion isn’t just romanticized career advice but a true competitive strategy, one that becomes only more urgent as AI rapidly reshapes the workforce. The foundation, which he’s calling the Running Down a Dream Foundation, will award 100 grants of $5,000 a year to people who need a financial cushion to make a leap they’ve been afraid to take.\n\nWe caught up with Gurley to talk about all of it — including what he makes of the somewhat surreal reality that several of his former peers in tech now hold enormous sway in Washington, why he thinksthe 996 grind culturemany young founders have adopted is less alarming than it sounds, and what AI really means for your career. The following has been edited for length and clarity. Our full conversation with Gurley drops Tuesday on TC’sStrictlyVC Downloadpodcast.\n\nWhy write this book?\n\nI went through a phase where I was reading a lot of biographies — people from very different fields, different time windows — and I started noticing patterns the way I would notice patterns in a market evolving. I wrote them down. A couple years later I got invited to speak at the University of Texas, dusted off the notes, built a presentation. They posted it on YouTube, and James Clear — who wrote “Atomic Habits” — noticed and posted about it. That’s what got me thinking about a book. And when I went through my own process of moving away from venture and thinking about what I wanted to do next, it became obvious I didn’t want to write about VC or Uber or any of that. I wanted to do something that could have a bigger mission.\n\nYour research with Wharton found that roughly 60% of people would do things differently if they could start their careers over. That shocked you. Why?\n\nWhen we first ran it as a SurveyMonkey poll we got seven out of 10. When we did it more rigorously with Wharton, we got six out of 10. One of the things that strikes me is that we have a phrase in the book — life is a use it or lose it proposition — and when you’re young, it’s just hard to have that framing. It’s hard to fast-forward through all of your time and recognize how precious it is. Daniel Pink has done a lot of work on what he calls regrets of inaction — the thing that weighs on people most as they get older is the thing they didn’t try, the stone left unturned. That holds across multiple geographies and cultures. And I think a lot of well-intentioned parents feel more responsibility to create economic stability for their kids than to encourage them to truly explore their passion. Especially with AI out there, that may not have been the right call.\n\nExploring your passion sounds like easier advice for people who have financial runway. What do you say to someone working paycheck to paycheck?\n\nA few things. First, the book profiles people who started on the very bottom rung and climbed to the top — [celebrity hairstylist and entrepreneur] Jen Atkins moved to LA with $200 in her pocket. There’s nothing in the book that says you need to start anywhere other than right at the beginning. Second, if you’re living paycheck to paycheck, I wouldn’t encourage you to quit. I’d encourage you to use your free time to build a little document on your phone about what your thing might be. Learn. Prepare to jump before you jump. And third — this is why I’m launching the foundation. The last page of the book talks about it: We’re going to give 100 grants a year of $5,000 to people who are in exactly that position, who can convince us in an application that they’ve thought long and hard about where they want to go but need a little help getting there.\n\nYou’ve been outspoken for years about regulatory capture — the idea that big companies use regulation to entrench themselves.\n\nI gave aspeechon regulatory capture a few years back — it was at the All-In Summit — and at the time I said I had a fear that the AI companies would try to use regulation to protect themselves. I think that’s happening now. The flip side is that there are legitimate questions: Jonathan Haidt’s book “Anxious Generation” has been on the bestseller list for almost two years, arguing social media has been really bad for children, with academic research to back it up. People would say we should have gotten in front of social media and need to do it with AI. The problem is that the people begging for regulation the most in AI are the actual companies themselves, and that makes me skeptical. There’s also the global dimension — if U.S. AI gets entangled in state-by-state regulation and Chinese models are running free, we’re going to paint ourselves in red tape. I always ask people: What are your favorite five regulations of all time, and how were they successful? Do you have any confidence that people at the state level in a random state know how to write good AI regulation that will actually work?\n\nIt’s a little surreal that several prominent figures from your world now hold enormous influence in Washington. What do you make of that?\n\nIt’s very ironic. If you go back and watch that regulatory capture talk, who would have thought a few years later David Sacks would actually be [special advisor for AI and crypto in the White House]?\n\nBack in 2018, Mike Moritz of Sequoia wrote in the FT that Americans would lose to China if they didn’t startworking harder. It was controversial at the time, but a lot of young founders here seem to have since embraced a punishing work culture — the 996 ethos. What are your thoughts about what’s happening?\n\nI kind of love it, honestly. I think Silicon Valley got really lazy during COVID — people weren’t coming into the office, the culture got soft in a way I hadn’t seen in all my years there. And I’ve been to China six times. I know what Michael Moritz was describing when he said we’re going to lose not because they’re smarter but because they have a better work ethic. But here’s the thing: If you study successful people across a lot of fields, we think it’s wonderful when an athlete practices 12 hours a day or when an artist works obsessively on their craft. Nobody says Jordan didn’t have work-life balance. We just don’t extend the same logic to building a company. If those founders love what they’re doing that much, and they feel like this is the moment to go hard, that’s actually precisely the point of the book: Find the thing that makes you feel that way.\n\nYou talk about mentorship in the book. What makes a great mentor relationship and how do people find one?\n\nThe number one thing is to get out of your head this idea that gets passed around in the self-help world: “go get a mentor,” and everyone runs out and cold calls someone that’s ridiculously too high and unachievable, and it doesn’t work. For all those people who are really out of reach right now, I call them aspirational mentors — create a persona of them, just like I was talking about with the dream job folder. Get clips of all the books they’ve written, podcasts they’ve done, interviews they’ve done, and study them. You can learn a lot from people without talking to them directly, especially in the modern age. And then for your real mentors, go two levels down from where you thought you were going to aim. Discover somebody — tools like LinkedIn make this so easy — and be the first person to ever call them and ask them to be a mentor, because they’ll be flattered. They’ll be flattered that you knew who they were. Imagine anyone getting their first call to be a mentor. It’s a great feeling. You’re going to have way more success with that interaction than shooting too high.\n\nI’ll tell you a funny story: I started getting so many calls from people who wanted to break into venture that I wrote a three-page PDF called “So You Want to Be a VC,” and hidden in the third page was basically — go do X, go do Y, go do Z, come back and tell me how that went. The number of people that actually ended up talking to me after getting that document was a fraction of the number I sent it to. It’s funny how much it thinned when you gave them a little homework to do.\n\nYou started working on this book before the impacts of AI became clearer. Does that at all change how people should think about their careers?\n\nIf you’re following the traditional path — going through the career center at your university, signing up on a list, waiting for a recruiter to sit through 30 people in 20-minute slots — you look like a cog. You look mass-produced. For that group, AI looks frightening, and maybe it should. But if you are blazing your own trail, using the techniques in the book, becoming what I call a candidate of one — someone whose path looks completely unique because you’ve built it intentionally — then every tool in this book is amplified by AI. Learning has never been easier than right now, in the entire history of the world. If you’re running toward it, if you’re becoming the most AI-aware person in your field, this thing is nothing but a superpower.",
      "excerpt": "For nearly three decades, Bill Gurley has been one of the most influential voices in Silicon Valley — a general partner at Benchmark whose early bets on companies like Uber, Zillow, and Stitch Fix helped define what modern venture capital looks like. Now, having moved to Austin and stepped back from",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "6 days left to lock in the lowest TechCrunch Disrupt 2026 rates",
      "link": "https://techcrunch.com/2026/02/22/6-days-left-to-lock-in-the-lowest-techcrunch-disrupt-2026-rates/",
      "author": "TechCrunch Events",
      "date": "2026-02-22T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/Disrupt-2025-day-3.jpg?resize=1200,800",
      "category": "Startups",
      "content": "Super Early Bird pricing forTechCrunch Disrupt 2026ends February 27 at 11:59 p.m. PT. That means you have just 6 days left to secure the lowest ticket prices of the year.\n\nIf Disrupt has been on your must-attend list, this is your moment. Save up to $680 on your individual pass or secure up to 30% off with community passes before prices increase.Register here.\n\nFrom October 13-15 at San Francisco’s Moscone West, TechCrunch will bring together 10,000 founders, investors, operators, and innovators for three focused days built around launching, scaling, and shaping what’s next in tech.\n\nDisrupt is where you get:\n\nYou’ll see300+ exhibiting startupsdebut tomorrow’s breakthroughs, experience the high-stakesStartup Battlefield 200pitch competition — where one standout company wins a $100,000 equity-free prize — and take part in curated networking designed to drive real outcomes.\n\nYou’ll also hear insights from some of the most influential voices in tech, including WordPress co-founderMatt Mullenweg, General Motors CEOMary Barra, and legendary VCVinod Khosla. Keep an eye on theevent pagefor the agenda drop.\n\nSix days remain to secure the lowest rate of the year. Lock it in before February 27 at 11:59 p.m. PT.Register here.",
      "excerpt": "Super Early Bird pricing forTechCrunch Disrupt 2026ends February 27 at 11:59 p.m. PT. That means you have just 6 days left to secure the lowest ticket prices of the year.\n\nIf Disrupt has been on your must-attend list, this is your moment. Save up to $680 on your individual pass or secure up to 30% o",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Ex-Apple team launches Acme Weather, a new take on weather forecasting",
      "link": "https://techcrunch.com/2026/02/23/ex-apple-team-launches-acme-weather-a-new-take-on-weather-forecasting/",
      "author": "Sarah Perez",
      "date": "2026-02-23T12:35:06-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/rainbow-GettyImages-104637612.jpg?resize=1200,799",
      "category": "Apps",
      "content": "The creators of Dark Sky, whosold their popular weather appto Apple in March 2020, are back with a new take on weather forecasting. The team recently announced the launch of their new app,Acme Weather, which they claim offers a better and more reliable forecast than the one they had at Dark Sky. The app will also offer a range of unique weather notifications, including fun ones like alerts about rainbows and beautiful sunsets.\n\nUnlike typical weather apps, Acme Weather’s forecast is supplemented with a range of alternate predictions for better accuracy.\n\nDark Sky co-founder Adam Grossman explains in an introductoryblog postthat the app’s homegrown forecasts will leveragedifferentnumerical weather prediction models, satellite data, ground station observations, and radar data, making its forecast fairly reliable.\n\nHowever, the app will also feature additional forecast lines that show the other possible outcomes as gray lines on its graphs.\n\n“Forecasts are often wrong — it’s the weather, right? It’s one of the hardest things to predict,” Grossman told TechCrunch via a telephone interview. “And our biggest pet peeve with a lot of weather apps is you just get their best guess, and you don’t know how certain they are.”\n\nHaving an understanding of the alternatives helps people plan for big events, he noted.\n\n“I find it most useful for winter storms, where, maybe the storm starts out in the morning, and you’re going to get snow, but maybe there’s also a possibility it holds out a little bit later — to the afternoon — in which case it’s rain,” Gross explained. “Being able to just see that right there on the timeline just gives you this intuitive sense of whether, do all the models agree, and you’re getting snow? Or do half of them say snow and half of them say rain?”,” he says.”\n\nThis type of weather data could make for a valuable product, not just for consumers, but for other developers, too.\n\nAt Dark Sky, the team had offered its weather API to developers for a fee. After being acquired by Apple, the team worked on creatingWeatherKit, the developer toolkit that provides access to Apple’s weather data on a subscription basis. Grossman said the team hasn’t yet decided if a developer API will be a part of Acme Weather’s offering.\n\nInstead, Acme Weather is a $25 per year consumer app, with a two-week free trial. This helps to cover the costs involved with pulling in thedifferent weather models and resources, which can be expensive.\n\n“Most of our time has been spent on building our own forecast — our own data provider, in a way. And this lets us do things like build multiple forecasts…[and] create any map we want, rather than having to rely on a third-party map provider,” Grossman noted.\n\nAt launch, the app offers a range of maps, like radar, lightning, rain and snow totals, as well as wind, temperature, humidity, cloud cover, and hurricane tracks.\n\nAnother feature, Community Reports, lets users share information about their current conditions to improve the app’s real-time weather reporting.\n\nWhile Dark Sky had become a favorite weather app because of its uncanny ability to predict when it would begin raining in your location, Acme Weather aims to improve on this and even have some fun.\n\nThe app includes built-in notifications for typical things, like rain, nearby lightning, community reports, government-issued severe weather alerts, and more. It’s also going to experiment with alerts like rainbow predictions or those to identify when you might see a beautiful sunset.\n\nThese will be available in a special “Acme Labs” section of the app, and Grossman said they’ll be conservative with their predictions, given the difficulty.\n\nUsers will also be able to customize their notifications to focus on weather events they care about, like winds or UV index, or the possibility of rain over the next 24 hours.\n\nBeing able to try new ideas is part of what drew the team back to building an indie app, Grossman noted.\n\n“I absolutely love Apple…but as a big company, it’s difficult to try weird, new, experimental ideals. If you have a billion users, mistakes are costly,” he tells TechCrunch. “There’s long software development cycles, there’s a lot of stakeholders, this idea of being able to try a bunch of things, I think, is interesting.”\n\nAcme Weather is currently available on iOS. An Android version is planned.\n\nThe team is bootstrapped and includes co-foundersJosh ReyesandDan Abrutyn, also previously of Dark Sky. The small workforce includes both former Dark Sky team members and new hires.",
      "excerpt": "The creators of Dark Sky, whosold their popular weather appto Apple in March 2020, are back with a new take on weather forecasting. The team recently announced the launch of their new app,Acme Weather, which they claim offers a better and more reliable forecast than the one they had at Dark Sky. The",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic accuses Chinese AI labs of mining Claude as US debates AI chip exports",
      "link": "https://techcrunch.com/2026/02/23/anthropic-accuses-chinese-ai-labs-of-mining-claude-as-us-debates-ai-chip-exports/",
      "author": "Rebecca Bellan",
      "date": "2026-02-23T11:57:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2262515136.jpg?w=1024",
      "category": "AI",
      "content": "Anthropic isaccusingthree Chinese AI companies of setting up more than 24,000 fake accounts with its Claude AI model to improve their own models.\n\nThe labs —DeepSeek,Moonshot AI, andMiniMax— allegedly generated more than 16 million exchanges with Claude through those accounts using a technique called “distillation.” Anthropic said the labs “targeted Claude’s most differentiated capabilities: agentic reasoning, tool use, and coding.”\n\nThe accusations come amid debates over how strictly to enforce export controls on advanced AI chips, a policy aimed at curbing China’s AI development.\n\nDistillation is a common training method that AI labs use on their own models to create smaller, cheaper versions, but competitors can use it to essentially copy the homework of other labs. OpenAI sent a memo to House lawmakers earlier this month accusing DeepSeek of using distillation to mimic its products.\n\nDeepSeek firstmade wavesa year ago when it released its open-source R1 reasoning model that nearly matched American frontier labs in performance at a fraction of the cost. DeepSeek is expected to soon release DeepSeek V4, its latest model, whichreportedlycan outperform Anthropic’s Claude and OpenAI’s ChatGPT in coding.\n\nThe scale of each attack differed in scope. Anthropic tracked more than 150,000 exchanges from DeepSeek that seemed aimed at improving foundational logic and alignment, specifically around censor-ship safe alternatives to policy-sensitive queries.\n\nMoonshot AI had more than 3.4 million exchanges targeting agentic reasoning and tool use, coding and data analysis, computer-use agent development, and computer vision. Last month, the firmreleaseda new open source model Kimi K2.5 and a coding agent.\n\nMiniMax’s 13 million exchanges targeted agentic coding and tool use and orchestration. Anthropic said it was able to observe MiniMax in action as it redirected nearly half its traffic to siphon capabilities from the latest Claude model when it was launched.\n\nAnthropic says it will continue to invest in defenses that make distillation attacks harder to execute and easier to identify, but is calling on “a coordinated response across the AI industry, cloud providers, and policymakers.”\n\nThe distillation attacks come at a time whenAmerican chip exportsto China are still hotly debated. Last month, the Trump administration formally allowed U.S. companies like Nvidia toexport advanced AI chips(like the H200) to China. Critics have argued that this loosening of export controls increases China’s AI computing capacity at a critical time in the global race for AI dominance.\n\nAnthropic says that the scale of extraction DeepSeek, MiniMax, and Moonshot performed “requires access to advanced chips.”\n\n“Distillation attacks therefore reinforce the rationale for export controls: restricted chip access limits both direct model training and the scale of illicit distillation,” per Anthropic’s blog.\n\nDmitri Alperovitch, chairman of the Silverado Policy Accelerator think-tank and co-founder of CrowdStrike, told TechCrunch he’s not surprised to see these attacks.\n\n“It’s been clear for a while now that part of the reason for the rapid progress of Chinese AI models has been theft via distillation of US frontier models. Now we know this for a fact,” Alperovitch said. “This should give us even more compelling reasons to refuse to sell any AI chips to any of these [companies],which would only advantage them further.”\n\nAnthropic also said distillation doesn’t only threaten to undercut American AI dominance, but could also create national security risks.\n\n“Anthropic and other U.S. companies build systems that prevent state and non-state actors from using AI to, for example, develop bioweapons or carry out malicious cyber activities,” reads Anthropic’s blog post. “Models built through illicit distillation are unlikely to retain those safeguards, meaning that dangerous capabilities can proliferate with many protections stripped out entirely.”\n\nAnthropic pointed to authoritarian governments deploying frontier AI for things like “offensive cyber operations, disinformation campaigns, and mass surveillance,” a risk that is multiplied if those models are open-sourced.\n\nTechCrunch has reached out to DeepSeek, MiniMax, and Moonshot for comment.",
      "excerpt": "Anthropic isaccusingthree Chinese AI companies of setting up more than 24,000 fake accounts with its Claude AI model to improve their own models.\n\nThe labs —DeepSeek,Moonshot AI, andMiniMax— allegedly generated more than 16 million exchanges with Claude through those accounts using a technique calle",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}