{
  "last_updated": "2026-02-25T20:38:51.958061+00:00",
  "articles": [
    {
      "title": "OpenClaw creator’s advice to AI builders is to be more playful and allow yourself time to improve",
      "link": "https://techcrunch.com/2026/02/25/openclaw-creators-advice-to-ai-builders-is-to-be-more-playful-and-allow-yourself-time-to-improve/",
      "author": "Sarah Perez",
      "date": "2026-02-25T08:54:46-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/openclaw-creator-Peter-Steinberger.jpg?resize=1200,564",
      "category": "AI",
      "content": "Peter Steinberger, the creator of theviral AI agent OpenClawwho has sincebeen hired by OpenAI,has some advice for those experimenting with AI technology, including AI agents. From his own experience, the best way to build today is to explore, be playful, and not expect to be an expert at what you do right away.\n\n“I wish I could say that I had the unified plan in the beginning, but a lot of it was just exploration,” Steinberger said. “I wanted things, and those things didn’t exist, and … let’s say I prompted them into existence.”\n\nThe developer was chatting with OpenAI’s Head of Developer Experience, Romain Huet, on the first episode ofthe company’s new Builders Unscripted podcast. Here, he spoke about what OpenClaw was like in its early days and how he didn’t have a plan when he got started.\n\nSteinberger explained he began by building a tool that would integrate with WhatsApp, but then set it aside for a bit and focused on other things, as he assumed the AI labs would build something like what he was working on in the near future.\n\n“I just experimented a lot. My mission was, kind of like, to have fun and inspire people,” Steinberger noted. By last November, however, the developer was surprised that no AI labs had started to build what he wanted to use. That led him to create the initial prototype of what’s now OpenClaw.\n\n“Where it really clicked was where I was at this weekend trip in Marrakesh, and I found myself using it way more because it was so convenient … There was no really good internet. [But] WhatsApp just works everywhere,” he said. The tool made it easy for him to find restaurants, look up things on his computer, send texts to friends, and more.\n\nThe more he played with the technology, Steinberger realized how good modern AI models have become at problem-solving, much like coders are.\n\n“Now they can just, like, actually come up with the solutions themselves, even though you never programmed them at all,” he noted.\n\nThroughout the process of building, Steinberger said that his workflow improved — and he stresses to other developers that’s something that can take time, so don’t give up.\n\n“There’s these people that … write software in the old way, and the old way is going to go away,” he pointed out. They then decide to try vibe coding but are disappointed with the results.\n\n“I think vibe coding is a slur,” said Steinberger, basically suggesting that it’s not as simple a process at first as the term makes it sound. “They try AI, but they don’t understand that it’s a skill,” he said, then compared the process of coding with AI to learning guitar.\n\n“You’re not going to be good at guitar on the first day,” he said. Instead, he recommends that people approach learning with a more playful attitude. If he writes a prompt now, he has a gut feeling as to how long it will take, and if it takes longer, he reflects on what may have gone wrong and adapts.\n\n“My … advice always is, approach it in a playful way. Build something that you always wanted to build. If you’re at least a little bit of a builder, there has to be something on the back of your mind that you want to build. Like, just play.”\n\nThis ability to experiment and have fun is what’s most important, especially at a time when people are worried their jobs will be overtaken by AI.\n\n“If your identity is: I want to create things. I want to solve problems. If you’re high agency, if you’re smart, you will be in more demand than ever,” Steinberger said.",
      "excerpt": "Peter Steinberger, the creator of theviral AI agent OpenClawwho has sincebeen hired by OpenAI,has some advice for those experimenting with AI technology, including AI agents. From his own experience, the best way to build today is to explore, be playful, and not expect to be an expert at what you do",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "About 12% of US teens turn to AI for emotional support or advice",
      "link": "https://techcrunch.com/2026/02/25/about-12-of-u-s-teens-turn-to-ai-for-emotional-support-or-advice/",
      "author": "Amanda Silberling",
      "date": "2026-02-25T07:52:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-1499457607.jpg?resize=1200,675",
      "category": "AI",
      "content": "AI chatbots have become embedded in the lives of American teenagers, according toa reportpublished Tuesday by the Pew Research Center.\n\nWhile the most common uses of AI among this demographic include searching for information (57%) and getting help with schoolwork (54%), teens are also using AI to fill roles that would typically be occupied by friends or family. Sixteen percent of U.S. teens say they use AI for casual conversation, while 12% use AI chatbots for emotional support or advice.\n\nSome teens may find solace in talking to chatbots, but mental health professionals are wary. General-purpose tools like ChatGPT, Claude, and Grok are not designed for such uses, and in the mostextreme cases, these chatbots can have life-threatening psychological effects.\n\n“We are social creatures, and there’s certainly a challenge that these systems can be isolating,” Dr. Nick Haber, a Stanford professor researching the therapeutic potential of LLMs,told TechCrunch recently. “There are a lot of instances where people can engage with these tools and then can become not grounded to the outside world of facts, and not grounded in connection to the interpersonal, which can lead to pretty isolating — if not worse — effects.”\n\nPew’s survey also shows a discrepancy between teenagers’ self-reported AI usage and the extent to which their parents think they engage with this technology. About 51% of parents said that their teen uses chatbots, while 64% of teens reported using them.\n\nThe majority of parents are okay with their teens using AI to search for information (79%) or get help with schoolwork (58%), but far fewer parents approve of their teens using AI chatbots for casual conversation (28%) or to get emotional support or advice (18%). In fact, 58% of parents are not okay with their child using AI for such purposes.\n\nAI safety is acontentioustopicamong leading tech companies, to say the least. But one popular chatbot maker, Character.AI, made the choice todisablethe chatbot experience for users under the age of 18. This decision followed public outcry and lawsuits filed overtwo teenagers’suicides, which took place after prolonged conversations with the company’s chatbots. OpenAI, meanwhile, made the decision to sunset its particularly sycophanticGPT-4o model, which sparked backlash from people who had come to rely on the model for emotional support.\n\nThough a majority of teens use AI chatbots in some way, they have mixed feelings about the impact of this kind of technology on society. When asked how they think AI will impact society over the next 20 years, 31% of teens said the impact would be positive, while 26% said it would be negative.",
      "excerpt": "AI chatbots have become embedded in the lives of American teenagers, according toa reportpublished Tuesday by the Pew Research Center.\n\nWhile the most common uses of AI among this demographic include searching for information (57%) and getting help with schoolwork (54%), teens are also using AI to f",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Khosla’s Keith Rabois backs Comp, which wants to bolster HR teams with AI",
      "link": "https://techcrunch.com/2026/02/25/khoslas-keith-rabois-backs-comp-which-wants-to-bolster-hr-teams-with-ai/",
      "author": "Marina Temkin",
      "date": "2026-02-25T05:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Comp.jpg?resize=1200,800",
      "category": "Fundraising",
      "content": "After graduating from Cornell University, Christophe Gerlach spent nearly two years investing exclusively in HR tech startups for General Atlantic. Investing was exciting, but Gerlach was yearning to get back into entrepreneurship.\n\nWhile at Cornell, Gerlach (pictured above, right) built and sold afood delivery startupalongside classmate Pedro Bobrow (pictured above, left), a Brazilian native. Then in late 2022, Gerlach and Bobrow (previously a product manager at Lyft) teamed up again, merging their sector expertise and cultural roots to launch Comp, an HR tech startup focused on Brazil.\n\nComp is building AI-powered HR software that can assist with tasks like recruiting, setting compensation policies, and designing performance review systems. The startup also provides “forward-deployed” experts — former HR executives — who work with customers to design strategies for compensation, performance, and recruiting.\n\nWhile companies in Brazil often hire compensation consultants, Gerlach says its forward-deployed HR executives shouldn’t be viewed as consultants, but rather as extensions of existing HR teams.\n\nThese executives also play a critical role in refining Comp’s technology. “Our forward-deployed HR execs do all the work manually at first, and then they use that work to train the AI how to think in best practices,” Gerlach said.\n\nThe idea, of course, is that over time, Comp’s AI agents will become fully autonomous and capable of performing traditional HR functions.\n\nWhile Comp currently offers AI-supported HR services augmented by professionals, its goal is to displace both traditional consultancies and HR software. As Gerlach puts it: “Rippling sells software to junior HR teams to make them more productive. We become the HR team.”\n\nTo that end, Comp this week raised a $17.25 million Series A round led by Khosla Ventures, marking the VC firm’s first-ever investment in a Brazilian company. Khosla general partner Keith Rabois has joined Comp’s board of directors as part of the deal.\n\nComp is positioning itself as an AI alternative to traditional compensation consultancies like Mercer, Korn Ferry, and Willis Towers Watson. It also competes with global HR platforms such as Rippling and Workday.\n\nGerlach says Comp launched in Brazil because many companies in the country lack traditional HR software, which has allowed the startup to introduce a new, automated model rather than competing with established platforms.\n\nThe business model seems to have already gained traction in Brazil: Its clients include Nubank, QuintoAndar, Creditas, and “pretty much every unicorn in Brazil,” Gerlach said. The startup is now eyeing an expansion into the U.S. and other countries.\n\nOther investors in Comp’s Series A included existing backers Kaszek and Canary, as well as new investors Abstract Ventures and Endeavor Catalyst.",
      "excerpt": "After graduating from Cornell University, Christophe Gerlach spent nearly two years investing exclusively in HR tech startups for General Atlantic. Investing was exciting, but Gerlach was yearning to get back into entrepreneurship.\n\nWhile at Cornell, Gerlach (pictured above, right) built and sold af",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI COO says ads will be ‘an iterative process’",
      "link": "https://techcrunch.com/2026/02/25/openai-coo-says-ads-will-be-an-iterative-process/",
      "author": "Ivan Mehta",
      "date": "2026-02-25T09:37:37-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=1024",
      "category": "AI",
      "content": "Last month, OpenAI said that it is going to introduceads to users of the free and Go tiers in ChatGPT. The company rolled out adsto U.S.-based users earlier this monthamid criticism from rivals like Anthropic, which publisheda string of Super Bowl ads.\n\nOn the sidelines of the India AI summit, TechCrunch askedOpenAI COO Brad Lightcapabout how the company is approaching ads. Lightcap said that the process is iterative and the company has to get user privacy and trust right.\n\n“Well, this is going to be an iterative process for sure. This is something we are committed to getting right. What does that look like? It means obviously maintaining user trust at a very high level. It means getting privacy right,” Lightcap said.\n\nHe also noted that ads can add to the product experience of users if they are done right. He urged to give OpenAI a few months to see how the company fares in rolling out the product.\n\n“It means really creating a delightful product experience. We think ads done right can be additive to a product experience. And so it’ll take iteration, it’ll take time, but we’re just starting out. So maybe give us a few months and see how it goes,” he said.\n\nLightcap didn’t specify if the company is thinking about rolling out ads beyond the U.S. market at the moment.\n\nEarlier this month, Sam Altman hit back at Anthropic witha long post on Xabout the Super Bowl ads, calling the OpenAI rival “dishonest” and accusing them of making an expensive product that serves “rich people.”\n\n“More importantly, we believe everyone deserves to use AI and are committed to free access, because we believe access creates agency. More Texans use ChatGPT for free than the total number of people who use Claude in the US, so we have a differently-shaped problem than they do,” Altman wrote.\n\nVariousoutletshave reported that OpenAI is charging $60 for 1,000 impressions, an unusually high rate. Last month, Adweek noted that OpenAI is asking for $200,000 of minimum commitment from advertisers. Earlier this week,The Informationreported that Shopify is allowing its merchants to advertise on ChatGPT through its Shop Campaigns ad network, joining early testers like Target, Williams Sonoma, and Adobe.",
      "excerpt": "Last month, OpenAI said that it is going to introduceads to users of the free and Go tiers in ChatGPT. The company rolled out adsto U.S.-based users earlier this monthamid criticism from rivals like Anthropic, which publisheda string of Super Bowl ads.\n\nOn the sidelines of the India AI summit, TechC",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India’s AI boom pushes firms to trade near-term revenue for users",
      "link": "https://techcrunch.com/2026/02/24/india-ai-boom-pushes-firms-to-trade-near-term-revenue-for-users/",
      "author": "Jagmeet Singh",
      "date": "2026-02-24T18:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/chatgpt-india-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "AI",
      "content": "Tech giants’ efforts to ramp up AI adoption in India may be about to hit a turning point, as companies end free promotions with hopes to convert the world’s fourth-largest economy into a windfall of paid subscribers.\n\nIndia became the world’s largest market for generative AI app downloads in 2025, according to market intelligence firm Sensor Tower, widening its lead over the U.S. as installs jumped 207% year-over-year.\n\nCompanies includingOpenAI,Google, andPerplexityrolled out extended free premium offers to accelerate user growth in the price sensitive market. Leading AI firms have also backed India in its push to become a global artificial intelligence hub. Amajor AI summit in New Delhilast week wasattended by leadersincluding OpenAI’s Sam Altman, Anthropic’s Dario Amodei, and Alphabet CEO Sundar Pichai — a sign of the country’s growing weight in the global AI race.\n\nNow, some of those early promotional pushes are winding down. Perplexityendedits bundled Pro offer with Indian telco Airtel in January, while OpenAI’s free ChatGPT Go access in India isno longer available, potentially setting the stage for a clearer test of how many newly acquired users convert to paying subscribers.\n\nDespite strong download growth, India still generates a disproportionately small share of AI app revenue, accounting for about 1% of in-app purchases even as it drives roughly 20% of global GenAI app downloads, according to the Sensor Tower data shared with TechCrunch, highlighting the monetization challenge in one of the industry’s fastest-growing markets.\n\nGenAI app adoption in India accelerated sharply through 2025, with downloads peaking in September and October at year-over-year growth rates of about 320% and 260%, respectively, according to the data. Yet the surge in usage did not fully translate into revenue gains. In November and December 2025, AI app in-app purchase revenue in India fell 22% and 18% month over month, respectively. ChatGPT’s revenue dropped even more sharply — down 33% and 32% over the same period following the November launch of free sub-$5 ChatGPT Go access — reflecting the near-term impact of aggressive promotional pushes.\n\nChatGPT still commands more than 60% of GenAI in-app revenue in India, meaning shifts in its pricing strategy can significantly influence overall market performance.\n\nAlongside promotional pushes, Sensor Tower attributed the surge in GenAI app adoption in India last year to a mix of new product launches, including the debut of platforms such as DeepSeek, Grok, and Meta AI, as well asupgrades to major chatbotslike ChatGPT, Gemini, Claude, and Perplexity. Viral interest in AI-generated content also helped fuel adoption, with content creation and editing tools accounting for seven of the 20 most downloaded GenAI apps in India in 2025.\n\nThe user surge has been equally pronounced. India accounted for about 19% of the global user base of leading AI assistant apps in 2025, ahead of the U.S. at 10%, Sensor Tower said. ChatGPT continues to dominate the Indian market by monthly active users, though rivals including Google’s Gemini and Perplexity have also seen rapid growth following promotional offers. ChatGPT was themost downloaded GenAI appin India and globally in 2025, according to earlier Sensor Tower data. Earlier this month, OpenAI’s CEO said that the chatbot now hasmore than 100 million weekly active usersin India.\n\nThe promotional push in India reflects a broader strategy by AI firms to reduce pricing friction in a highly value-conscious market, betting that early user adoption and engagement will translate into stronger long-term retention once free access periods expire, said Sneha Pandey, insights analyst at Sensor Tower.\n\nIndia’s appeal lies in its massive digital base. The country has more than a billion internet users and around 700 million smartphone owners, making it one of the largest potential markets for AI services globally and a critical battleground for user growth.\n\nNonetheless, user engagement in India still trails more mature markets. In 2025, users of leading AI chatbot apps in the U.S. spent about 21% more time per week on the apps than their counterparts in India and logged 17% more sessions on average, per Sensor Tower.\n\n“AI in-app revenues will likely see meaningful but gradual improvement as users become more deeply integrated into these platforms, making sustained engagement paramount,” Pandey told TechCrunch.\n\nShe added that pricing pressure in India is likely to remain elevated given the country’s young and value-conscious user base, making lower-cost tiers, telecom bundles, and micro-transaction models important for long-term retention.\n\nChatGPT remained the clear market leader in India entering 2026, with 180 million monthly active users in January, per Sensor Tower, followed by Google’s Gemini with 118 million, Perplexity with 19 million, and Meta AI with 12 million. The figures underline both the scale of India’s AI opportunity and the growing challenge for firms to convert rapid user adoption into sustained revenue.\n\nGoogle, OpenAI, and Perplexity did not respond to requests for comments.",
      "excerpt": "Tech giants’ efforts to ramp up AI adoption in India may be about to hit a turning point, as companies end free promotions with hopes to convert the world’s fourth-largest economy into a windfall of paid subscribers.\n\nIndia became the world’s largest market for generative AI app downloads in 2025, a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Self-driving tech startup Wayve raises $1.2B from Nvidia, Uber, and three automakers",
      "link": "https://techcrunch.com/2026/02/24/self-driving-tech-startup-wayve-raises-1-2b-from-nvidia-uber-and-three-automakers/",
      "author": "Kirsten Korosec",
      "date": "2026-02-24T16:37:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Wayve-Germany-02.jpg?resize=1200,675",
      "category": "Transportation",
      "content": "Wayve’s self-driving tech has attracted a diverse set of investors in the company’s latest $1.2 billion funding round, including three automakers, top venture and institutional firms, and returning backers Microsoft, Nvidia, and Uber. The total raise could reach $1.5 billion thanks to another $300 million from Uber contingent on deploying robotaxis, beginning in London.\n\nEveryone, it seems, wants a piece of the U.K. startup, which is now valued at $8.6 billion. The funding round illustrates the eagerness among Big Tech, legacy automakers, and the investor community to profit from the burgeoning automated driving industry.\n\nWayve provides what founder and CEO Alex Kendall calls the “contrarian” option in automated driving — contrarian both in its approach to tech and its business model, he told TechCrunch in an interview Tuesday.\n\n“I think the technology chessboard is set around where different companies have invested on the technology strategy, and now the commercial chessboard is being arranged,” Kendall said. “We took a very contrarian view on the technology side. We were the first to build end-to-end deep learning for autonomous driving, and we pioneered this approach. Now, when it comes to this phase of moving into commercialization, we’re also taking a contrarian business model approach.”\n\nWayve, which launched in 2017, uses a self-learning approach to its software. The company developed a software layer using an end-to-end neural network that doesn’t require high-definition maps and only uses data to teach the vehicle how to drive.\n\nThis data-driven learning approach underpins two products: an “eyes on” assisted-driving system and an “eyes off” fully automated-driving system that could be applied to robotaxis or consumer vehicles that can handle all of the driving in certain environments.\n\nThe company’s pitch to customers is the agnostic nature of its technology, which is not reliant on specific sensors or maps. The automated-driving software captures data from whatever sensors are on the vehicle and directs the system’s driving decisions. Wayve’s software can also run on whatever chip its OEM partners already have in their vehicles.\n\nIt should be noted, however, that Nvidia, which is also a backer, has had a close development relationship with Wayve since 2018. The startup’s Gen 3 platform, which was unveiled last fall, uses an in-vehicle compute autonomous vehicle development kit called Nvidia Drive AGX Thor. The Gen 3 platform will allow Wayve to offer eyes-off advanced driving-assistance systems and Level 4 — or fully driverless — features that will work on city streets and highways.\n\nThe company’s tech is somewhat similar to how Tesla has approached automated driving, although there are key differences in their business models.\n\nWayve doesn’t want to be the operator of its hands-free driving-assistance system or its “eyes-off” fully automated-driving system. (For comparison, Waymo is largely the operator of its robotaxis, although it does have partners.) Nor does Wayve want to build vehicles bundled with its own software, as Tesla does. Instead, it is selling its “embodied AI” to automakers and other tech companies like Uber.\n\nKendall argues that this is the business model with the largest addressable market, but he says it’s only viable because Wayve built an AI that generalizes across different hardware and environments.\n\n“If you build an autonomy stack that’s specific to a sensor or compute architecture, [or] if you build it where it requires mapping or something like this, then you can’t take option three,” Kendall said, referring to the business model his company has chosen.\n\nNissan and Uber are both Wayve customers. Nissan said the startup’s self-driving software will be used to beef up the advanced driver-assistance system in its carsstarting in 2027. Meanwhile, later this year, Uber plans to launch commercial trials in vehicles equipped with Wayve’s software.\n\nIts relationship with Uber appears poised to stretch well beyond a pilot program, though. Uber CEO Dara Khosrowshahi’s statement Tuesday hints at the scope of its partnership with and investment in Wayve.\n\n“We are very proud to continue to deepen our partnership with Wayve, with plans to deploy together in more than 10 markets around the world. Wayve’s powerful end-to-end approach is purpose-built for scale, safety, and effectiveness, and we’re excited to work with them across multiple OEMs and geographies, which we’ll share more about soon.”\n\nThe round was led by Eclipse, Balderton, and SoftBank Vision Fund 2. New investors include the Ontario Teachers’ Pension Plan, Baillie Gifford, British Business Bank, Icehouse Ventures, Schroders Capital, and other global institutional investors, the company said.\n\nGlobal automakers Mercedes-Benz, Nissan, and Stellantis — all of which plan to use Wayve’s technology — also participated. Nvidia, which participated in Wayve’s$1.05 billion Series C round,said last year it was evaluating a $500 million strategic investment in Wayve’s next raise. While Nvidia did participate, Kendall wouldn’t disclose the exact amount of its investment or whether it came close to that $500 million figure.\n\nUpdated to include more information on the $300 million in additional funding from Uber.",
      "excerpt": "Wayve’s self-driving tech has attracted a diverse set of investors in the company’s latest $1.2 billion funding round, including three automakers, top venture and institutional firms, and returning backers Microsoft, Nvidia, and Uber. The total raise could reach $1.5 billion thanks to another $300 m",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Final 4 days to save up to $680 on your TechCrunch Disrupt 2026 pass",
      "link": "https://techcrunch.com/2026/02/24/final-4-days-to-save-up-to-680-on-your-techcrunch-disrupt-2026-pass/",
      "author": "TechCrunch Events",
      "date": "2026-02-24T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/TCD26_4Days-16X9-Dark.png?resize=1200,675",
      "category": "Startups",
      "content": "You don’t attendTechCrunch Disruptto sit in the audience. You go to gain leverage. If 2026 is a build year, a fundraise year, a hiring year, or a scale year, this is where momentum compounds.\n\nWith just 4 days left before Super Early Bird pricing ends on February 27 at 11:59 p.m. PT, this is your opportunity to save up to $680 on your pass and secure your spot at the center of the tech ecosystem.Register here to save.\n\nFrom October 13 to 15 at Moscone West, 10,000+ founders, operators, and VCs will converge for three days of high-signal conversations and deal-making. Disrupt is not just content. It is access.\n\nYou get:\n\nLast year alone, more than 20,000 curated meetings took place. In 2026, upgraded networking tools will make those connections even more targeted and efficient. One conversation can change your trajectory. AtDisrupt, that is the point.\n\nDisrupt has long been a stage for founders and investors who define eras. These are the kinds of voices that are candid, tactical, and often unfiltered. Previous speakers have included leaders of category-defining startups and top-tier venture firms, including:\n\nIn 2025, Disrupt featured 200+ onstage conversations with 250+ leaders shaping AI, venture capital, hardware, growth strategy, and more. Expect that same caliber of insight in 2026. Keep an eye on theevent pageas the agenda rolls out.\n\nStartup Battlefieldreturns with 200 pre-Series A companies competing for $100,000 in equity-free funding, global visibility, and direct investor access. Alumni include Discord, Cloudflare, and Trello.\n\nIf you want to see what and who is next, and hear directly from top VCs on what it takes to scale a viable startup, the Disrupt stage is where it happens.\n\nMore than 300 startup exhibitorswill showcase new products across the venue, especially in the Expo Hall, where deal flow and discovery collide. You are not just observing trends. You are seeing them before they scale.\n\nFrom October 11 to 17, TechCrunch Disrupt Side Events take place across the Bay Area, including breakfasts, cocktail hours, panels, and founder meetups that extend the connections beyond the main stage. The main event is powerful. The surrounding ecosystem makes it even stronger.\n\nSuper Early Bird pricing ends February 27 at 11:59 p.m. PT. If you plan to be in the rooms where capital moves, companies scale, and ideas turn into industries, now is the time to lock it in.\n\nRegister now:",
      "excerpt": "You don’t attendTechCrunch Disruptto sit in the audience. You go to gain leverage. If 2026 is a build year, a fundraise year, a hiring year, or a scale year, this is where momentum compounds.\n\nWith just 4 days left before Super Early Bird pricing ends on February 27 at 11:59 p.m. PT, this is your op",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "It’s time to pull the plug on plug-in hybrids",
      "link": "https://techcrunch.com/2026/02/24/its-time-to-pull-the-plug-on-plug-in-hybrids/",
      "author": "Tim De Chant",
      "date": "2026-02-24T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/porsche-cayenne-plug-in-hybrid.jpg?resize=1200,676",
      "category": "Transportation",
      "content": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’ onboard computers shows that’s often not the case.\n\nUsing that data, the Fraunhofer Institute could determine how much of a vehicle’s energy use came from charging as opposed to the internal combustion engine. Itfound thatgrid power was responsible for less than a third of a vehicle’s total energy use. The vast majority of 1 million PHEVs in Germany plugged in either occasionally or not at all.\n\nU.S. automakers that are pushing future PHEV models as appealing alternatives for American drivers should take note. By blending gas with electricity, these automakers hope to boost fleet-wide efficiency without a wide rollout of EVs.\n\n“We’re looking to make CO2reductions across our lineup, but we’re doing it in a very efficient way,” Ford CEO Jim Farleysaid this monthin an earnings call.\n\nYet the new study shows that PHEVs seldom deliver on their efficiency promises.\n\nAt best, Toyota drivers used electricity for 44% of the energy used for driving, suggesting they plugged in the most frequently. The worst? Porsche drivers, at just 0.8%, an average of 7 kilowatt-hours over two years. In other words, the average Porsche PHEV driver charged their battery less than 50% of its capacity — once.\n\nStudies have previously shown that PHEVs produce about3.5 times more emissionsthan their official ratings would suggest. This new study explains why since it directly assesses how much electricity the vehicles gained from charging. (PHEVs, like all hybrids, can operate in a mixed mode, using both gas and electricity. The study used data straight off the vehicles to disentangle the two.)\n\nOne of PHEV’s many shortcomings are their anemic batteries, capable of powering the vehicle for short distances. Some can only traverse a handful of miles, while many sold in recent years can operate on battery power for about 20 to 30 miles. Regulators in Europe and automakers have been proposing longer ranges for future models, hoping that a more capable battery will encourage people to charge their batteries more frequently.\n\nThat’s not guaranteed, though. The vehicles are likely to remain compromised when driving on electrons. That’s because most PHEVs are based on fossil fuel platforms — the electric motors and power electronics aren’t capable of delivering 100% of the vehicle’s power needs. When a driver floors it, the gas engine has to kick in. In other vehicles, the engine turns on in cold weather to heat the cabin. When that happens, “why bother plugging in” is apparently a question most PHEV drivers have asked themselves.\n\nWhich raises another question: Why bother with PHEVs at all?\n\nPHEVs have been touted as a way to ease cautious consumers into full EVs. The argument goes something like this: Drivers will become habituated with plugging in while EV charging networks are built out. By the time they’re ready for their next vehicle, the networks will be ready and customers can ease into an EV.\n\nBut if nobody is plugging in their PHEVs, they’re definitely not developing the habit. Without full charges, the electric drivetrain isn’t benefiting anyone. The public still suffers from worse air pollution, and drivers are carting around hundreds of pounds of weight and enduringmore recallsand costlier service visits as a result of the complex drivetrain.\n\nTweaking the PHEV formula to make them more reliant on batteries could help. The interim solution is called an extended-range electric vehicle (EREV), and it’s designed to run on battery power until the charge is depleted, at which point the fossil fuel engine recharges it. So far, no EREV has required the owner to plug in — they could easily drive the vehicle for its lifetime on gas. BMW used to make an EREV in the i3, but it stopped production years ago. Ford and Stellantis have both announced EREV pickup trucks, which have yet to go on sale.\n\nMeanwhile, EV charging networkscontinue to expand. It’s possible that by the time automakers are making PHEVs and EREVs in large quantities, drivers will no longer need a comfort blanket in the form of a gas engine. (My household came to that conclusion two years ago. After a decade split between a BMW i3 EREV and a Chrysler Pacifica Hybrid PHEV, we traded up for a Kia EV9.)\n\nLegacy automakers, which have second-guessed their electrification strategies more times than I care to count, could be forced to change tack once more.\n\nPHEVs might have been a nifty solution on paper, but they’ve failed to deliver in the real world.\n\nUpdate 2/25: Clarified how much power from chargers was used by PHEVs in the study.",
      "excerpt": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "US cybersecurity agency CISA reportedly in dire shape amid Trump cuts and layoffs",
      "link": "https://techcrunch.com/2026/02/25/us-cybersecurity-agency-cisa-reportedly-in-dire-shape-amid-trump-cuts-and-layoffs/",
      "author": "Zack Whittaker",
      "date": "2026-02-25T12:26:57-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/DHS-Getty.jpg?resize=1200,800",
      "category": "Security",
      "content": "U.S. cybersecurity agencyCISAisreportedly in dire shape, according to bipartisan lawmakers and industry leaders who fear that the agency’s ability to perform its core mission has been diminished and left it unprepared for a cybersecurity crisis.\n\nNews siteCyberscoop’sTim Starks spoke with sources across Congress, the private cyber industry, and beyond, and what came back reflected a general consensus that CISA has suffered under cuts and layoffs during the Trump administration’s first year.\n\nOver that time, CISA has lost around one-third of its staff, which cost it programs, personnel, and expertise, including the agency’s counter-ransomware initiative and efforts to promote secure software development. Some of these haveincluded several members of its election security team, TechCrunch reported last year. CISA is the federal agency responsible for election security. Some warned that Trump’s ongoing obsession with promoting false claims about the 2020 election has led to the administration deprioritizing CISA.\n\nCISAalsoreassignedhundreds of other staffersto aid other agencies within the Department of Homeland Security as part of the Trump administration’s broad immigration crackdown.\n\nMany of Cyberscoop’s sources blame the Trump administration, Congress, or both. Others singled out CISA’s acting director, Madhu Gottumukkala, as having struggled to lead the agency and reportedly causedsecurity headachesas a result.\n\nCISA has beenwithout a permanent directorsince Trump entered office in 2025.\n\nThe cybersecurity agency is said to be currently operatingat around 38% staff levelsas the partial U.S. federal government shutdown, which began on February 14, drags on. Lawmakers have declined to continue funding federal immigration authorities amid widespread criticism following the killings of two U.S. citizens by federal agents.\n\nWhen reached for comment, CISA’s Gottumukkala told TechCrunch that the agency “remains unwavering in its commitment to protect our federal networks from malicious cyber threat actors despite the multi-week government shutdown” of Homeland Security.",
      "excerpt": "U.S. cybersecurity agencyCISAisreportedly in dire shape, according to bipartisan lawmakers and industry leaders who fear that the agency’s ability to perform its core mission has been diminished and left it unprepared for a cybersecurity crisis.\n\nNews siteCyberscoop’sTim Starks spoke with sources ac",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Alphabet-owned robotics software company Intrinsic joins Google",
      "link": "https://techcrunch.com/2026/02/25/alphabet-owned-robotics-software-company-intrinsic-joins-google/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-25T12:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2022/07/unnamed.jpeg?resize=1200,589",
      "category": "Robotics",
      "content": "Google is moving further into physical AI by bringing a familiar robotics software platform under its wing.\n\nAlphabet-owned Intrinsic, which builds AI models and software designed to make industrial robots more accessible, is joining Google, the companiesannounced on Wednesday. Intrinsic will remain a distinct entity within Google but will work closely with Google DeepMind and will tap into Google’s Gemini AI models and cloud services.\n\nAlphabet declined to share information regarding funding or purchase price.\n\nIntrinsic “graduated” into anindependent Alphabet-owned company in 2021after five years of development within Alphabet’s X, the company’s moonshot research division. Other companies that have graduated from X include robotaxi company Waymo and drone delivery company Wing.\n\nWendy Tan White has served as Intrinsic’s CEO since its spinout in 2021.\n\nThe company hit the ground running. A few months after announcing its independence,Intrinsic acquired Vicarious, a fellow robotics software company, in April 2022. While the purchase price wasn’t disclosed, Vicarious had raised about $250 million from VCs and tech big wigs like Jeff Bezos.\n\nA few months later, Intrinsicacquired several for-profit divisionsof Open Robotics, a non-profit organization that builds hardware and software platforms for the robotics industry.\n\nDespite this rapid expansion,Intrinsic laid off 20% of its workforcein January 2023.\n\nThe company announced its first product, Flowstate, just a few months later. Flowstate is a software platform fordeveloping robotics workflowsaimed at developers that don’t have deep robotics experience — aligning with the company’s mission to make robotics more accessible.\n\nSince then, the company has fine-tuned the technology, improved its simulation capabilities, and released its Intrinsic Vision AI model in late 2025.\n\nInstrinsic announced ajoint venture with electronics manufacturer Foxconnin October 2025 that entails the two companies working together on general-purpose intelligent robots to transform how electronics are manufactured, with the goal of full factory automation.\n\nNow, the company is working toward those goals with closer collaboration with Google’s AI prowess.\n\n“Combined with Google’s incredible AI and infrastructure, we’re going to unlock the promise of physical AI for a much broader set of manufacturing businesses and developers. This will fundamentally shift production, from its economics to operations, and enable truly advanced manufacturing,” Tan White wrote in the company’s blog post.\n\nThis move makes a lot of sense for Google as many tech leaders, includingNvidia’s Jensen HuangandQualcomm’s Cristiano Amon, see physical AI as the next natural step in the monetization and advancement of AI models and technology.",
      "excerpt": "Google is moving further into physical AI by bringing a familiar robotics software platform under its wing.\n\nAlphabet-owned Intrinsic, which builds AI models and software designed to make industrial robots more accessible, is joining Google, the companiesannounced on Wednesday. Intrinsic will remain",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}