{
  "last_updated": "2026-02-24T21:38:41.646542+00:00",
  "articles": [
    {
      "title": "Spotify and Liquid Death release a limited-edition speaker shaped like… an urn?",
      "link": "https://techcrunch.com/2026/02/24/spotify-and-liquid-death-release-a-limited-edition-speaker-shaped-like-an-urn/",
      "author": "Lauren Forristal",
      "date": "2026-02-24T10:48:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/SPOTIFY-Liquid-Deathpng.png?w=1200",
      "category": "Gadgets",
      "content": "Spotify and Liquid Death have teamed up to launch what might be the wildest product collaboration of the year:the Eternal Playlist Urn, a wireless Bluetooth speaker shaped like a cremation urn. Yes, you read that right.\n\nThe Eternal Playlist Urn is not really meant to hold ashes, but is instead a collector’s item, with only 150 available for purchase in the U.S. For $495, buyers receive a 7-inch-by-11.4-inch urn with a Bluetooth speaker built into the lid. (We question the audio quality, since all the tech is crammed into the lid of this tiny urn.)\n\nAccording to Spotify, the urn offers “the world’s first ever music-streaming urn,” making death “a lot less boring.” With this product, the idea is that even the dearly departed can keep jamming to their favorite tunes for eternity, or at least that’s the company’s joke.\n\n“Life needs music. So does the afterlife. That’s why Spotify has partnered with Liquid Death to create the Eternal Playlist Urn, the world’s first wireless speaker designed to bring your music somewhere it’s never been before,” Spotifystatedin a blog post.\n\nWhen you get the urn, you can create your ownEternal Playliston Spotify by answering questions like “What’s your eternal vibe?” or “What’s your go-to ghost noise?” Spotify will then use your answers and listening history to generate a custom playlist, which syncs directly to the urn’s speaker and can be shared with friends and family.\n\nWhile Spotify hasn’t released a branded smart speaker, it partnered withIkeain 2022 on a portable Bluetooth lamp speaker with Spotify Tap functionality, making this the company’s second hardware collaboration with another brand. The company also released “Car Thing,” an in-car entertainment device, which was laterdiscontinued.\n\nThis isn’t the first time Liquid Death has pushed the limits of extreme marketing. The brand is known for its outrageous campaigns, including alife-sized Yeti Casket-shaped cooler. While some may find the humor a little morbid, fans of dark, irreverent comedy seem to be intrigued by it. The cooler had over 800 bidders and sold for $68,200.\n\nWhether you view this as a clever stunt, a funny gag, a tasteless joke, or simply absurd, the Eternal Playlist Urn is a testament to how far brands will go to capture our attention.",
      "excerpt": "Spotify and Liquid Death have teamed up to launch what might be the wildest product collaboration of the year:the Eternal Playlist Urn, a wireless Bluetooth speaker shaped like a cremation urn. Yes, you read that right.\n\nThe Eternal Playlist Urn is not really meant to hold ashes, but is instead a co",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "More startups are hitting $10M ARR in 3 months than ever before",
      "link": "https://techcrunch.com/2026/02/24/more-startups-are-hitting-10m-arr-in-3-months-than-ever-before/",
      "author": "Julie Bort",
      "date": "2026-02-24T11:39:36-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/01/GettyImages-582759168.jpg?resize=1200,800",
      "category": "Startups",
      "content": "AI has brought the startup world the rise of a new phenomenon: startups that almost instantly hit multimillion ARR (annual recurring revenue).\n\nStories abound of founders going from zero to $10 million, or as much as $100 million, in annual recurring revenuein a matter of months.\n\nTo be fair, this, alone, isn’t a harbinger of long-term success. VCs say thatdurable growthis far more important than ultra-speedy growth. Investors want to back companies where the rate at which customers cancel or stop paying is low, meaning customers are happy. They want that annual or monthly recurring revenue to stick around and grow, not wobble and crash.\n\nEven so, the phenomenon is real. As part of Stripe’s annual report,releasedon Tuesday, the payments giant revealed that it had more new businesses start using its products in 2025 than ever before, with more than half — specifically 57% — outside the United States. This 2025 cohort grew 50% faster than those who started using Stripe products in 2024, it said. While Stripe did not reveal the hard numbers, it did say that 2025 saw double the number of these fledging startups hit $10 million in ARR within three months compared to the number that did so in 2024.\n\nThe letter also noted that Stripe Atlas —  the company’s business incorporation tool  — saw a 41% increase in company formations last year. Of those new startups, 20% charged their first customer within 30 days, up from just 8% in 2020, further underscoring how quickly this new generation of founders is moving.\n\nIn comparison, in 2024, founders were stillpublicly celebratinghitting $10 million in ARR in three years — which is still, by most business standards, a metric worth boasting about.\n\nSo for all of those on the social mediasaying things like“Bootstrapping to $10M ARR is easier and less risky than creating a VC-backed unicorn, ” orthings like,“the AI-native startups hitting $10M ARR with just three people are rewriting the entire playbook,” well, now there’s a smattering of data to back that up.",
      "excerpt": "AI has brought the startup world the rise of a new phenomenon: startups that almost instantly hit multimillion ARR (annual recurring revenue).\n\nStories abound of founders going from zero to $10 million, or as much as $100 million, in annual recurring revenuein a matter of months.\n\nTo be fair, this, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Treasury sanctions Russian zero-day broker accused of buying exploits stolen from US defense contractor",
      "link": "https://techcrunch.com/2026/02/24/treasury-sanctions-russian-zero-day-broker-accused-of-buying-exploits-stolen-from-u-s-defense-contractor/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-24T11:01:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2017/10/kremlin-hacking-alt.jpg?resize=1200,675",
      "category": "Security",
      "content": "The U.S. governmentannouncedon Tuesday sanctions against two companies that acquire and resellzero-day exploits, as well as sanctioning their founders and their associates.\n\nOfficials with the U.S. Treasury told TechCrunch that the government was imposing sanctions against the brokers of zero-days — security vulnerabilities in software that are unknown to its developer but can be abused to hack people — as they pose a threat to U.S. national security, foreign policy, and economy.\n\nThe first sanctioned company is Operation Zero, a Russian firm that launched in 2021. The company made headlines in 2023 whenit announced that it was offeringup to $20 million for zero-days in Android devices and iPhones, and later announced thatit was offering up to $4 millionfor zero-days in Telegram. The companyclaimsto work exclusively with the Russian government and local organizations.\n\nThe Treasury’s Office of Foreign Assets Control (OFAC) said that Operation Zero’s customers “could use the tools to launch ransomware attacks or engage in other malign activities.”\n\nThe Treasury said it’s also sanctioning the company’s founder, Sergey Zelenyuk, who officials accused of selling exploits to foreign intelligence agencies and who say he sought to develop spyware and hacking technologies. The Treasury said Zelenyuk engaged in recruiting hackers and developing relationships with foreign intelligence agencies through social media. (Operation Zero has accounts on both X and Telegram.)\n\nAccording to the Treasury, Operation Zero acquired “at least eight proprietary cyber tools, which were created for the exclusive use of the U.S. government and select allies and which were stolen from a U.S. company,” and then “sold those stolen tools to at least one unauthorized user.”\n\nThe Treasury said that the sanctions against Operation Zero and Zelenyuk coincide with an FBI investigation into Peter Williams, who worked for U.S. defense contractor L3Harris. In October, Williamspleaded guilty to selling at least eight of the company’s exploitsto an unspecified Russian broker.\n\nThe Treasury now says that the broker was Operation Zero, something that the government had not previously confirmed.\n\nContact UsDo you have more information about Operation Zero? Or the market for zero-days? We’d love to hear from you. From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, orby email.\n\nWilliams was the general manager at Trenchant, which develops hacking and surveillance tools for the U.S. government and some of its top intelligence partners, including Australia, Canada, New Zealand, and the United Kingdom — the so-called alliance of Five Eyes countries.\n\nThe Treasury did not respond to a series of questions related to today’s sanctions.\n\nAlong with taking action against Zelenyuk, the U.S. Treasury is sanctioning an affiliate company based in the United Arab Emirates called Special Technology Services, as well as Zelenyuk’s assistant, Marina Evgenyevna Vasanovich, and two people associated with the company, Azizjon Makhmudovich Mamashoyev and Oleg Vyacheslavovich Kucherov, who have allegedly worked with Operation Zero.\n\nOperation Zero, Special Technology Services, and Zelenyuk are being sanctioned in parallel undera 2022 federal lawthat allows the U.S. government to impose sanctions on someone who committed “significant thefts of trade secrets,” per the Treasury.\n\nThe Treasury says Kucherov, a Russian national, is suspected of being a member of the prolific ransomware gangTrickBot, whose alleged members werepreviouslysanctionedby the U.S. and the United Kingdom.\n\nMamashoyev is allegedly the founder of Advance Security Solutions, another zero-day broker based in the UAE, which was also sanctioned today.\n\nAdvance Security Solutionslaunched last year, offering up to $20 million for zero-days that could help hack into any type of smartphone with a text message. The broker also offered high-paying bounties for hacking tools in popular software and hardware like Android devices, iPhones, Windows, and Chrome.\n\nOperation Zero and Zelenyuk did not respond to a request for comment. Kucherov, Mamashoyev, and Vasanovich could not be immediately reached for comment.\n\nWhen contacted by TechCrunch, a person operating an Advance Security Solutions’ chat account claimed without evidence that Mamashoyev is not the founder of the company.",
      "excerpt": "The U.S. governmentannouncedon Tuesday sanctions against two companies that acquire and resellzero-day exploits, as well as sanctioning their founders and their associates.\n\nOfficials with the U.S. Treasury told TechCrunch that the government was imposing sanctions against the brokers of zero-days —",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "It’s time to pull the plug on plug-in hybrids",
      "link": "https://techcrunch.com/2026/02/24/its-time-to-pull-the-plug-on-plug-in-hybrids/",
      "author": "Tim De Chant",
      "date": "2026-02-24T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/porsche-cayenne-plug-in-hybrid.jpg?resize=1200,676",
      "category": "Transportation",
      "content": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’ onboard computers shows that’s often not the case.\n\nUsing that data, the Fraunhofer Institute could determine how much of that energy came from charging when plugged in. Itfound thatless than a third of 1 million PHEVs in Germany plugged in either occasionally or not at all.\n\nU.S. automakers that are pushing future PHEV models as appealing alternatives for American drivers should take note. By blending gas with electricity, these automakers hope to boost fleet-wide efficiency without a wide rollout of EVs.\n\n“We’re looking to make CO2reductions across our lineup, but we’re doing it in a very efficient way,” Ford CEO Jim Farleysaid this monthin an earnings call.\n\nYet the new study shows that PHEVs seldom deliver on their efficiency promises.\n\nAt best, Toyota drivers used electricity for 44% of the energy used for driving, suggesting they plugged in the most frequently. The worst? Porsche drivers, at just 0.8%, an average of 7 kilowatt-hours over two years. In other words, the average Porsche PHEV driver charged their battery less than 50% of its capacity — once.\n\nStudies have previously shown that PHEVs produce about3.5 times more emissionsthan their official ratings would suggest. This new study explains why since it directly assesses how much electricity the vehicles gained from charging. (PHEVs, like all hybrids, can operate in a mixed mode, using both gas and electricity. The study used data straight off the vehicles to disentangle the two.)\n\nOne of PHEV’s many shortcomings are their anemic batteries, capable of powering the vehicle for short distances. Some can only traverse a handful of miles, while many sold in recent years can operate on battery power for about 20 to 30 miles. Regulators in Europe and automakers have been proposing longer ranges for future models, hoping that a more capable battery will encourage people to charge their batteries more frequently.\n\nThat’s not guaranteed, though. The vehicles are likely to remain compromised when driving on electrons. That’s because most PHEVs are based on fossil fuel platforms — the electric motors and power electronics aren’t capable of delivering 100% of the vehicle’s power needs. When a driver floors it, the gas engine has to kick in. In other vehicles, the engine turns on in cold weather to heat the cabin. When that happens, “why bother plugging in” is apparently a question most PHEV drivers have asked themselves.\n\nWhich raises another question: Why bother with PHEVs at all?\n\nPHEVs have been touted as a way to ease cautious consumers into full EVs. The argument goes something like this: Drivers will become habituated with plugging in while EV charging networks are built out. By the time they’re ready for their next vehicle, the networks will be ready and customers can ease into an EV.\n\nBut if nobody is plugging in their PHEVs, they’re definitely not developing the habit. Without full charges, the electric drivetrain isn’t benefiting anyone. The public still suffers from worse air pollution, and drivers are carting around hundreds of pounds of weight and enduringmore recallsand costlier service visits as a result of the complex drivetrain.\n\nTweaking the PHEV formula to make them more reliant on batteries could help. The interim solution is called an extended-range electric vehicle (EREV), and it’s designed to run on battery power until the charge is depleted, at which point the fossil fuel engine recharges it. So far, no EREV has required the owner to plug in — they could easily drive the vehicle for its lifetime on gas. BMW used to make an EREV in the i3, but it stopped production years ago. Ford and Stellantis have both announced EREV pickup trucks, which have yet to go on sale.\n\nMeanwhile, EV charging networkscontinue to expand. It’s possible that by the time automakers are making PHEVs and EREVs in large quantities, drivers will no longer need a comfort blanket in the form of a gas engine. (My household came to that conclusion two years ago. After a decade split between a BMW i3 EREV and a Chrysler Pacifica Hybrid PHEV, we traded up for a Kia EV9.)\n\nLegacy automakers, which have second-guessed their electrification strategies more times than I care to count, could be forced to change tack once more.\n\nPHEVs might have been a nifty solution on paper, but they’ve failed to deliver in the real world.",
      "excerpt": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Conduent data breach grows, affecting at least 25M people",
      "link": "https://techcrunch.com/2026/02/24/conduent-data-breach-grows-affecting-at-least-25m-people/",
      "author": "Zack Whittaker",
      "date": "2026-02-24T06:09:11-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/conduent-630849206.jpg?w=1024",
      "category": "Security",
      "content": "The spillover from a ransomware attack on one of the largest government contractors in the United Stateskeeps getting bigger: More than 25 million people have now had personal data stolen in the hack.\n\nConduent provides printing, mailroom services, and document and payment processing services for state government benefit operations, such as food assistance, as well as workplace and unemployment benefits for large corporations. As such, the company handles a large amount of personal information belonging to a large swath of the United States. Conduentsaysits technology and operational support services reach more than 100 million people.\n\nBut since the January 2025 cyberattack, which a ransomware group claimed credit for, the corporate giant has said little about the data breach, such as how it was caused and how many people are affected.\n\nAn update tothe state of Wisconsin’s data breach notification pagenow shows the Conduent breach affects at least 25 million people across the United States.\n\nTechCrunch’s ongoing tally from various data breach notification letters that we have seen also amounts to about 25 million people, with Oregon (10.5 million) and Texas (15.4 million) accounting for the majority of those affected. Other data breach notices seen by TechCrunch include another few hundred thousand individuals across Massachusetts, New Hampshire, and Washington.\n\nThe breach is known to have compromised individuals’ names, dates of birth, addresses, Social Security numbers, health insurance information, and medical data.\n\nConduent has said little outside of its data breach notifications, and in some cases has made it more difficult for affected individuals to learn about the breach.\n\nA page on Conduent’s website, titled“Incident Notice”that was published in October 2025 at the same time as its first data breach notification, does not explicitly mention a cybersecurity incident. The page contains a hidden “noindex” tag in its source code, which tells search engines to not list the page in search results, making it difficult for anyone searching the web to find it.\n\nWhen reached by TechCrunch, Conduent spokesperson Sean Collins would not say how many notifications the company has sent to date, or why the company is hiding its incident notice from search engines.\n\nConduent’s breach has been billed as one of the “largest ever,” but likely trails behind the Change Healthcare hack, whichaffected more than 190 million peoplefollowing a ransomware attack in February 2024. A Russian-speaking ransomware gang stole reams of health and medical data from Change Healthcare using astolen credentialthat wasn’t protected with multi-factor authentication, prompting the healthcare tech giant to pay at least two ransoms to keepmost of the stolen dataoff the internet.",
      "excerpt": "The spillover from a ransomware attack on one of the largest government contractors in the United Stateskeeps getting bigger: More than 25 million people have now had personal data stolen in the hack.\n\nConduent provides printing, mailroom services, and document and payment processing services for st",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Waymo robotaxis are now operating in 10 US cities",
      "link": "https://techcrunch.com/2026/02/24/waymo-robotaxis-are-now-operating-in-10-us-cities/",
      "author": "Kirsten Korosec",
      "date": "2026-02-24T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-GettyImages.jpg?resize=1200,796",
      "category": "Transportation",
      "content": "Waymo is opening its robotaxi services to the public in Dallas, Houston, San Antonio, and Orlando, as the Alphabet-owned autonomous vehicle company quickens its pace of expansion.\n\nWaymo’s rollout will mimic its public launches in previous cities. Select riders who have downloaded the Waymo app will receive an invitation to take their first rides, starting Tuesday. New riders will be added on a rolling basis, and eventually anyone who downloads the app will be able to hail a ride.\n\nThe addition of the new cities adds a striking dimension to Waymo’s fast-paced push to expand. Last February, Waymo was operating commercial robotaxi services in Phoenix and some of its surrounding suburbs, parts of Los Angeles, and San Francisco. At the time, Alphabet CEO Sundar Pichai said Waymo was providingmore than 200,000 ridesevery week.\n\nOver the past 12 months, Waymo has expanded in its existing markets, particularly in San Francisco, where its service area nowstretches down Highway 101through numerous towns, all the way to San Jose. It now has access to three airports, includingSan Francisco International. It has launched a service inpartnership with Uberin Atlanta and Austin. It has expanded its operating domainto freewaysin three cities. And last month it opened its robotaxi service to the publicin Miami.\n\nWaymo tends to hold back on its latest ridership numbers. The last time it provided an update, Waymo said it was providing more than400,000rides per week, though the actual number is likely higher by now.\n\nThe company doesn’t appear to be slowing down, either. It is planning to launch robotaxi services in several more cities this year, including Denver,London, and Washington, D.C., to name a few. And it is now armed with an additional$16 billionraised in round led by Dragoneer Investment Group, DST Global, and Sequoia Capital that values Waymo at $126 billion.\n\nWaymo currently has a fleet of about 3,000 robotaxis that are spread across its six markets of Atlanta, Austin, Los Angeles, Miami, Phoenix, and the San Francisco Bay Area. That fleet size will likely grow with the addition of these four new cities, but don’t expect it to balloon immediately.\n\nWaymo spokesperson Chris Bonelli said it will have dozens of vehicles to start in these cities and will scale up in coordination with riders over the coming months.\n\nThe company’s workforce will also scale alongside this expansion. The staff who monitor the robotaxis and respond to specific requests for information from the Waymo self-driving system — for instance, if a robotaxi encounters a tricky scenario on public roads — may expand, although Waymo wouldn’t share specifics. The company said only that it has an extensive planning process to ensure that its operations are right-sized to its scale as it grows. Waymo recently revealed it employs about 70 of these workers, whom it describes as remote assistance workers, or RAs.\n\nAll of this is pushing toward a lofty goal Waymo co-CEO Tekedra Mawakana laid out last year — and one that hasn’t changed even as the company faces increased scrutiny and investigations by safety regulators. The National Highway Traffic Safety Administration opened an investigation after one of Waymo’s robotaxis last monthstruck a childat 6 miles per hour near a school in Santa Monica. The National Transportation Safety Board is also examining how Waymo robotaxisbehave around school buses.\n\n“Waymo is serving more riders than ever, as we are on track to serve over one million rides per week by the end of this year,” Mawakanasaid in a blog postTuesday, adding that the company is laying the groundwork for robotaxi service in more than 20 cities.",
      "excerpt": "Waymo is opening its robotaxi services to the public in Dallas, Houston, San Antonio, and Orlando, as the Alphabet-owned autonomous vehicle company quickens its pace of expansion.\n\nWaymo’s rollout will mimic its public launches in previous cities. Select riders who have downloaded the Waymo app will",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Meta AI security researcher said an OpenClaw agent ran amok on her inbox",
      "link": "https://techcrunch.com/2026/02/23/a-meta-ai-security-researcher-said-an-openclaw-agent-ran-amok-on-her-inbox/",
      "author": "Julie Bort",
      "date": "2026-02-23T16:57:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Y-Combinator-Crab.png?resize=1200,829",
      "category": "AI",
      "content": "Thenow-viral X postfrom Meta AI security researcher Summer Yue reads, at first, like satire. She told her OpenClaw AI agent to check her overstuffed email inbox and suggest what to delete or archive.\n\nThe agent proceeded to run amok. It started deleting all her email in a “speed run” while ignoring her commands from her phone telling it to stop.\n\n“I had to RUN to my Mac mini like I was defusing a bomb,” she wrote, posting images of the ignored stop prompts as receipts.\n\nThe Mac Mini, an affordable Apple computer that sits flat on a desk andfits in the palm of your hand, has become the favored device these days for running OpenClaw. (The Mini is selling “like hotcakes,” one “confused” Apple employee apparently toldfamed AI researcher Andrej Karpathywhen he bought one to run an OpenClaw alternative called NanoClaw.)\n\nOpenClawis, of course, the open source AI agent that achieved fame through Moltbook, an AI-only social network. OpenClaw agents were at the center of thatnow largely debunked episodeon Moltbook in which it looked like the AIs were plotting against humans.\n\nBut OpenClaw’s mission, according to itsGitHub page, is not focused on social networks. It aims to be a personal AI assistant that runs on your own devices.\n\nThe Silicon Valley in-crowd has fallen so in love with OpenClaw that “claw” and “claws” have become thebuzzwords of choicefor agents that run on personal hardware. Other such agents includeZeroClaw,IronClaw, andPicoClaw. Y Combinator’s podcast team even appeared on theirmost recent episodedressed in lobster costumes.\n\nBut Yue’s post serves as a warning. As others on X noted, if an AI security researcher could run into this problem, what hope do mere mortals have?\n\n“Were you intentionally testing its guardrails or did you make a rookie mistake?” a software developer asked her on X.\n\n“Rookie mistake tbh,” she replied. She had been testing her agent with a smaller “toy” inbox, as she called it, and it had been running well on less important email. It had earned her trust, so she thought she’d let it loose on the real thing.\n\nYue believes that the large amount of data in her real inbox “triggered compaction,” she wrote. Compaction happens when the context window — the running record of everything the AI has been told and has done in a session — grows too large, causing the agent to begin summarizing, compressing, and managing the conversation.\n\nAt that point, the AI may skip over instructions that the human considers quite important.\n\nIn this case, it may have skipped her last prompt — where she told it not to act — and reverted back to its instructions from the “toy” inbox.\n\nAs several otherson X pointed out,prompts can’t be trustedto act as security guardrails. Models may misconstrue or ignore them.\n\nVarious people offered suggestions that ranged from the exact syntax Yue should have used to stop the agent, to various methods to ensure better adherence to guardrails, like writing instructions to dedicated files or using other open source tools.\n\nIn the interest of full transparency, TechCrunch could not independently verify what happened to Yue’s inbox. (She didn’t respond to our request for comment, though she did respond to many questions and comments sent her way on X.)\n\nBut it doesn’t really matter.\n\nThe point of the tale is that agents aimed at knowledge workers, at their current stage of development, are risky. People who say they are using them successfully are cobbling together methods to protect themselves.\n\nOne day, perhaps soon (by 2027? 2028?), they may be ready for widespread use. Goodness knows many of us would love help with email, grocery orders, and scheduling dentist appointments. But that day has not yet come.",
      "excerpt": "Thenow-viral X postfrom Meta AI security researcher Summer Yue reads, at first, like satire. She told her OpenClaw AI agent to check her overstuffed email inbox and suggest what to delete or archive.\n\nThe agent proceeded to run amok. It started deleting all her email in a “speed run” while ignoring ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "5 days left to lock in the lowest TechCrunch Disrupt 2026 ticket rates",
      "link": "https://techcrunch.com/2026/02/23/5-days-left-to-lock-in-the-lowest-techcrunch-disrupt-2026-ticket-rates/",
      "author": "TechCrunch Events",
      "date": "2026-02-23T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/TCD26_5Days-16X9-Dark.png?resize=1200,675",
      "category": "Startups",
      "content": "We are officially down to the final 5 days tosave up to $680on yourTechCrunch Disrupt 2026ticket. These lowest rates of the year disappear on February 27 at 11:59 p.m. PT.\n\nIf you’ve been mapping out your 2026 tech event calendar, this isn’t the moment to wait.Register now to lock in your savings before prices increase.\n\nEach year,Disruptbrings together 10,000+ founders, tech leaders, and VCs at San Francisco’s Moscone West. From October 13–15, you’ll gain valuable takeaways and curated networking opportunities designed to elevate your startup trajectory, accelerate your career, or strengthen your portfolio.\n\nLast year, Disrupt featured 200+ onstage conversations with 250+ top voices shaping the tech ecosystem. Expect the same level of powerful, candid conversations this year. Highlights from 2025 include the following:\n\nKeep an eye on theevent pageas we roll out the 2026 agenda.\n\nLast year, more than 20,000 curated meetings took place across three days. This year, we’re rolling out improved networking technology to make those connections even more targeted and efficient.\n\nMeet the one person who can change the trajectory of your startup. It only takes one. You get:\n\nStartup Battlefieldis where 200 TechCrunch-selected, pre-Series A startups compete for $100,000 in equity-free funding, global visibility, and direct access to the industry’s top investors.\n\nThis iconic pitch competition has helped launch breakout companies like Discord, Cloudflare, and Trello.\n\nOver 300 startup exhibitorswill showcase innovations across the venue, especially in the Expo Hall, where foot traffic converges. Discover tomorrow’s breakthroughs and today’s solutions — all in one place.\n\nThroughout Disrupt Week, October 11–17, TechCrunch Disrupt Side Events will take place across the Bay Area beyond the main venue. Attend a post-event cocktail hour, grab breakfast before the day begins, or even host your own off-site panel. The opportunities to make powerful connections around Disrupt are endless.\n\nFive days remain to lock in the lowest rate of the year. Prices increase after February 27 at 11:59 p.m. PT.Register nowand secure your savings of up to $680 before they’re gone. Save up to 30% ongroup passes.",
      "excerpt": "We are officially down to the final 5 days tosave up to $680on yourTechCrunch Disrupt 2026ticket. These lowest rates of the year disappear on February 27 at 11:59 p.m. PT.\n\nIf you’ve been mapping out your 2026 tech event calendar, this isn’t the moment to wait.Register now to lock in your savings be",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Google’s new 1.9GW clean energy deal includes massive 100-hour battery",
      "link": "https://techcrunch.com/2026/02/24/googles-new-1-9gw-clean-energy-deal-includes-massive-100-hour-battery/",
      "author": "Tim De Chant",
      "date": "2026-02-24T13:32:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2177664491.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "GoogleannouncedTuesday that it will build a data center in Minnesota that’s backed by 1.9 gigawatts of clean power, including a massive 300-megawatt battery made by startup Form Energy.\n\nThe new data center, Google’s first in Minnesota, will be located in Pine Island, about an hour southeast of Minneapolis.\n\nThe tech company is working with Xcel Energy to build 1.4 gigawatts of wind power and 200 megawatts of solar power. Both will feed Form’s battery, which will be capable of delivering its rated power for 100 hours. At 30 gigawatt-hours, it will be the largest battery in the world, helping the data center operate on clean energy for longer periods of time.\n\nSuch long-duration batteries help renewable energy sources continue to provide power at night or during lulls, “firming” the power source, as experts call it.Grid-scale lithium-ion batteriesdo this already, though for shorter periods.\n\nForm Energy’s batteriesare unlike most other grid-scale batteries. Whereas a typical grid-scale battery today uses lithium-ion technology that’s been repurposed from chemistries used by the automotive industry, Form’s batteries store energy by rusting and deoxidizing iron.\n\nWhen oxygen from the air flows over pebbles of iron inside the battery, it rusts the iron, generating electricity in the process. To charge, electrical current deoxidizes the rust, turning it back into metallic iron and releasing oxygen in the process, which is drawn out of the battery.\n\nAs battery chemistries go, Form’s iron-air cells are heavy and not very efficient. Typical iron-air batteries can only deliver 50% to 70% of the energy used to charge them, compared with upwards of 90% for lithium-ion batteries. But for all their downsides, they come with one very large upside: they’re incredibly cheap. Form says 1 kilowatt-hour of storage will ultimately cost just $20 using their technology, which is at least three times cheaper than lithium-ion batteries.\n\nThe new project also introduces a wonky utility fee structure to Minnesota that’s intended to help utilities adopt clean technologies without running afoul of their regulators, which push utilities to use the cheapest source of electricity.\n\nGoogle first developed the concept in Nevada, where it’s buying power from enhanced geothermal startup Fervo. Alternately called the “clean transition tariff” or the “clean energy accelerator charge,” the agreement between Google and Xcel allows the utility to accept projects that might be considered risky by regulators, with the tech company paying a premium to ensure that regular ratepayers aren’t left holding the bag.\n\nSolar and wind are both proven technologies, but Form’s iron-air batteries are still relatively new. The startup’s first battery is currently being installed in Minnesota with cooperative utility Great River Energy, and it will store 150 megawatt-hours for 100 hours, sending 1.5 megawatts to the grid at its peak.\n\nForm makes its batteries at a factory in West Virginia. The company has raised $1.4 billion to date, according to PitchBook data.",
      "excerpt": "GoogleannouncedTuesday that it will build a data center in Minnesota that’s backed by 1.9 gigawatts of clean power, including a massive 300-megawatt battery made by startup Form Energy.\n\nThe new data center, Google’s first in Minnesota, will be located in Pine Island, about an hour southeast of Minn",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "CarGurus data breach affects 12.5 million accounts",
      "link": "https://techcrunch.com/2026/02/24/cargurus-data-breach-affects-12-5-million-accounts/",
      "author": "Kirsten Korosec",
      "date": "2026-02-24T13:27:42-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/cargurus-getty.jpg?resize=1200,800",
      "category": "",
      "content": "Automotive marketplace CarGurus was the target of a data breach in which the names, email addresses, phone numbers, and physical addresses of millions of customers were stolen.\n\nHave I Been Pwned, a data notification site provider by security researcher Troy Hunt, reported that12.5 million CarGurus accountswere compromised in the data breach.\n\nCarGurus, founded in 2006, operates an online marketplace that allows customers to buy, sell, and finance vehicle purchases.\n\nHave I Been Pwned attributed the breach to the ShinyHunters hacking group.\n\nThe ShinyHunters group is known for its social engineering skills, such as calling up helpdesks and pretending to be employees who need their password reset. The hackers have used their social engineering skills to steal reams of data fromseveral universities, overa billion recordsfrom Salesforce customers, includingGoogleandWorkday, and claimed recent hacks atPornhubandfintech lending giant Figure.\n\nTechCrunch has reached out to CarGurus for comment and will update this article if the company responds.\n\nThe customer data that was published included user account ID mappings, finance pre-qualification application data and dealer account and subscription information, according to Have I Been Pwned.\n\nThis is the second automotive-related data breach reported by Have I Been Pwned this year. Last month, data allegedly from CarMax was published following a failed extortion attempt,the data breach notification site reported. The data breach included about 431,000 unique email addresses along with names, phone numbers, and physical addresses.",
      "excerpt": "Automotive marketplace CarGurus was the target of a data breach in which the names, email addresses, phone numbers, and physical addresses of millions of customers were stolen.\n\nHave I Been Pwned, a data notification site provider by security researcher Troy Hunt, reported that12.5 million CarGurus ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}