{
  "last_updated": "2026-02-26T15:56:04.622721+00:00",
  "articles": [
    {
      "title": "Salesforce CEO Marc Benioff: This isn’t our first SaaSpocalypse",
      "link": "https://techcrunch.com/2026/02/25/salesforce-ceo-marc-benioff-this-isnt-our-first-saaspocalypse/",
      "author": "Julie Bort",
      "date": "2026-02-25T17:59:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2221463618.jpg?resize=1200,800",
      "category": "Enterprise",
      "content": "Salesforce pulled out all the stops to convince investors that the AI revolution won’t be its death when itannouncedfourth-quarter earnings on Wednesday.\n\nSalesforce reported a solid quarter of $10.7 billion in revenue, up 13% year-over-year. For the year, it reported $41.5 billion in revenue, up 10% over the previous year, with both results boosted by its $8 billion acquisition ofdata management companyInformaticalast May.\n\nNet income landed at $7.46 billion, and the company offered strong guidance for the year ahead, projecting revenue of $45.8 billion to $46.2 billion — a 10% to 11% increase. It also said its “remaining performance obligation,” or RPO, is over $72 billion. That’s a figure that shows revenue under contact that has not yet been delivered or recognized as earned revenue.\n\nThe numbers, though, could only do so much. Software-as-a-service stocks, withSalesforce as their poster child, have been getting hammered lately. Investors fear the rise of AI agents will undermine these companies, making their per-employee-seatbusiness models obsolete. The situation has been dubbed the “SaaSpocalypse.”\n\nThe concept hung so heavily in the air during the earnings call that CEO Marc Benioff mentioned the term at least six times.\n\n“You’ve heard about the SaaSpocalypse? And it isn’t our first. We’ve had a few of them,” he said, later adding, “If there is a SaaSpocalypse, it may be eaten by the Sasquatch because there are a lot of companies using a lot of SaaS because it just got better with agents.”\n\nIn an attempt to convince the world of its continued health, Salesforce threw everything and the kitchen sink into this earnings report. The company increased its dividend by nearly 6% to $0.44 per share. It launched a new $50 billion share buyback program. That’s always a favorite with shareholders because it both creates a sturdy buyer of shares and reduces the number of shares in circulation (which can boost the stock price).\n\nThe company also revamped the earnings call itself. It was part podcast, part infomercial, and part normal Q&A with a few questions from Wall Street analysts.\n\nInstead of running through the numbers, Benioff interviewed three Salesforce customers on camera to testify to their love of its new agentic options: the CEO of home appliance company SharkNinja; the CEO of Wyndham Hotels and Resorts; and, just to hammer the point, the CEO of SaaStr, the software industry conference and media company. We’ll truncate the interviews to the shortest summary: They all love Salesforce’s AI agent products.\n\nSalesforce also introduced a new metric for its agentic products: agentic work units (“AWU”). The idea here is that instead of simply counting “tokens” — the standard unit of AI processing volume — AWU attempts to measure something more meaningful: whether an agent actually completed a task. (Salesforce logged 19 trillion tokens last quarter, which sounds like a lot but reallyis notin the AI world.)\n\n“You can ask it a question and it can write you a poem, but that’s not really all that valuable in the enterprise world,” Salesforce president and CMO Patrick Stokes said on the call. So AWU is intended to measure when the agent writes to a record or does some other verifiable piece of work.\n\nOn top of that, Salesforce also presented its own architectural vision of the coming world of agents. It shows SaaS software like itselfowning most of the tech stack, with the AI model makers on the bottom as unseen, interchangeable, and commoditized work engines.\n\nThis was a direct counter to one of the causes of a SaaSpocalypse sell-off earlier this month, afterOpenAI released its enterprise agent, Frontier. OpenAI’s architectural vision shows OpenAI owning most of the stack, with systems-of-record SaaS providers (the databases and business-software platforms where companies store their core data)on the bottom as the unseen engines.\n\nAnd if all that wasn’t enough to influence investors: Benioff was dressed in a black leather jacket, echoing the signature look of the CEO clearly crushing it in the AI world: Nvidia’s Jensen Huang.",
      "excerpt": "Salesforce pulled out all the stops to convince investors that the AI revolution won’t be its death when itannouncedfourth-quarter earnings on Wednesday.\n\nSalesforce reported a solid quarter of $10.7 billion in revenue, up 13% year-over-year. For the year, it reported $41.5 billion in revenue, up 10",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Nvidia has another record quarter amid record capex spends",
      "link": "https://techcrunch.com/2026/02/25/nvidia-earnings-record-capex-spend-ai/",
      "author": "Russell Brandom",
      "date": "2026-02-25T15:04:42-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2219673294.jpg?resize=1200,750",
      "category": "AI",
      "content": "Chip giant and world’s most valuable company Nvidia reportedrecord profitsin its most recent quarter on Wednesday, as demand for AI compute continues to skyrocket.\n\n“The demand for tokens in the world has gone completely exponential,” CEO Jensen Huang said on a call with analysts following the results. “I think we’re all seeing that, to the point where even our six-year-old GPUs in the cloud are completely consumed and the pricing is going up.”\n\nThe company reported $68 billion in revenue in the most recent quarter, up 73% from the prior year, with $62 billion of that revenue coming from the company’s data center business.\n\nNotably, Nvidia divided the data center revenue into $51 billion in compute revenue (largely GPUs) and $11 billion in networking products like NVLink. The company reported $215 billion in revenue for the full year.\n\nAs in previous quarters, the company did not report any revenue from chip exports to China, despite the recent lifting of export restrictions by the U.S. government. “While small amounts of H200 products for China-based customers were approved by the U.S. government, they have yet to generate any revenue, and we do not know whether any imports will be allowed into China,” Colette Kress, the company’s chief financial officer, said.\n\n“Our competitors in China, bolstered by recent IPOs, are making progress,” she continued, in an apparent reference toMoore Threads’ IPO in December, “and have the potential to disrupt the structure of the global AI industry over the long term.”\n\nDuring the investor call, Huang also addressed the company’s pending investment in OpenAI, which has beenreported at $30 billion.\n\n“We continue to work with OpenAI toward a partnership agreement. We believe we are close,” Huang said. He also referenced partnerships with Anthropic, Meta, and Elon Musk’s xAI. However,statements Nvidia filedwith the U.S. Securities and Exchange Commission on Wednesday emphasized that there was “no assurance” an investment would take place.\n\nHuang also addressed concerns about the sustainability oftech companies’ capex commitments, saying he believed the compute investments would soon bring revenue.\n\n“In this new world of AI, computeisrevenue. Without compute, there’s no way to generate tokens. Without tokens, there’s no way to grow revenues,” Huang said. “We’ve reached the inflection point and we’re generating profitable tokens that are productive for customers and profitable for the cloud service providers”",
      "excerpt": "Chip giant and world’s most valuable company Nvidia reportedrecord profitsin its most recent quarter on Wednesday, as demand for AI compute continues to skyrocket.\n\n“The demand for tokens in the world has gone completely exponential,” CEO Jensen Huang said on a call with analysts following the resul",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic acquires computer-use AI startup Vercept after Meta poached one of its founders",
      "link": "https://techcrunch.com/2026/02/25/anthropic-acquires-vercept-ai-startup-agents-computer-use-founders-investors/",
      "author": "Julie Bort",
      "date": "2026-02-25T15:49:19-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/anthropic-image-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "Venture",
      "content": "Anthropic on Wednesdayannouncedthat it has acquired Vercept, an AI startup with deep roots to some of the biggest names in Seattle’s tech scene. The acquisition marks the latest after Anthropicacquired coding agent engine Bunin December to help scale Claude Code.\n\nVercept had created tools for more complex agentic tasks, including its product Vy, a computer-use agent in the cloud that could operate a remote Apple MacBook. Vercept is one of the many startups working on re-imagining the personal computer for the age of AI agents. As part of the deal, Anthropic is shuttering Vercept’s product on March 25.\n\nThe startup was a grad of Seattle’s AI-focusedincubatorAI2,which spawned from the longstanding Allen Institute for AI. Vercept’s co-founders had roots with the Allen Institute, as well, and were previously researchers there. One co-founder, Matt Deitke, made news last year as one of the AI researcherswho negotiated a monster $250 million salaryfrom Meta to join its Superintelligence Lab. On Wednesday, Deitke congratulated his former colleaguesin a post on X.\n\nCongrats to@ehsanik,@LucaWeihs, and@inkynumbers!Happy for you all :) 🚀https://t.co/n3WTq4CAAs\n\nVercept was a relatively high-profile AI startup in the region. In aLinkedIn postannouncing the acquisition by Anthropic, Vercept CEO Kiana Ehsani said the startup had raised a total of $50 million. She called out Fifty Years’ Seth Bannon, a board member, as the lead investor. Vercept previously announced it had raised a$16 million seed roundlast January.\n\nThe list of angel investors was impressive, too, and included former Google CEO Eric Schmidt, Google DeepMind chief scientist Jeff Dean, Cruise founder Kyle Vogt, and Dropbox co-founder Arash Ferdowsi,GeekWire reported.\n\nIn Anthropic’s announcement of the acquisition, the company named co-founders Ehsani, Luca Weihs, and Ross Girshick as some of the team brought on to join Anthropic in the acquisition. However, not all of Vercept’s co-founders are joining the Claude maker.\n\nOren Etzioni, who haspreviously been namedas a co-founder of Vercept and investor in the startup, is well known in Seattle as the founding leader of the Allen Institute for AI. Along with Deitke, he is also not joining Anthropic, and was vocally less pleased about the acqui-hire. He postedon LinkedIn: “After a little bit more than a year,Verceptis throwing in the towel and giving their customers 30 days to get off the platform. Sad. A fantastic team is joining Anthropic. I wish them the very best!”\n\nEtzioni is also a professor at the University of Washington and known forother startupshe’s founded and backed as a VC. He did not respond to a request for comment.\n\nOn Etzioni’s LinkedIn post, he accused Bannon, the Vercept lead investor, of being “partly responsible” for Vercept not hiring the correct business people. A back and forth ensued between the investors, withBannon condemningEtzioni’s remarks: “… you disparaged the heroic work of the founders for achieving an outcome most could only dream of,” Bannon replied in the LinkedIn string. They also accused each other of other less savory things like lying and legal threats.\n\nWhile public spats between investors are entertaining, and essentially meaningless, the underlying motivation is notable. The stakes are high to build the next big AI winner, and now a promising startup that raised a decently sized war chest will be tucked into Anthropic.\n\nWhile the terms of the deal were not disclosed, Etzioni says he got a return on his money. Anthropic clearly wanted these researchers (perhaps — especially — with another of them at Meta).\n\nStill, Etzioni told GeekWire that he remains bummed. “I’m pleased to have gotten a positive return but obviously disappointed that after just a little over a year with so much traction, and such a fantastic team, we’re basically throwing in the towel,” he said.\n\nThe founders joining Anthropic, however, appear happy, according to CEO’s Ehsani’s LinkedIn post. “The choices were clear: we could build independently and work toward the same vision as two separate versions of it, or join forces with an incredible team and accelerate that vision into reality. The decision became an easy choice,” she said of joining Anthropic.\n\nCorrection: Steve Bannon is a VC with Fifty Years, not AI2. The story has been corrected and we apologize for the error.",
      "excerpt": "Anthropic on Wednesdayannouncedthat it has acquired Vercept, an AI startup with deep roots to some of the biggest names in Seattle’s tech scene. The acquisition marks the latest after Anthropicacquired coding agent engine Bunin December to help scale Claude Code.\n\nVercept had created tools for more ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Inside the story of the US defense contractor who leaked hacking tools to Russia",
      "link": "https://techcrunch.com/2026/02/25/inside-the-story-of-the-us-defense-contractor-who-leaked-hacking-tools-to-russia/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-25T11:30:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/l3harris-logo-illustration.jpg?resize=1200,800",
      "category": "Security",
      "content": "A veteran cybersecurity executive who prosecutors said “betrayed” the United States will spend at least the next seven years behind bars, after pleading guilty to stealing and selling hacking and surveillance tools to a Russian firm.\n\nPeter Williams, a former executive at U.S. defense contractor L3Harris,was sentenced on Tuesday to 87 months in prisonfor leaking his former company’s trade secrets in exchange for $1.3 million in crypto between 2022 and 2025. Williams sold the exploits to Operation Zero, which the U.S. government calls “one of the world’s most nefarious exploit brokers.”\n\nThe successful conviction of Williams follows one of the most high-profile leaks of sensitive Western-made hacking tools in recent years. Even now that the case is over, there are still unanswered questions.\n\nWilliams, a 39-year-old Australian citizen who resided in Washington, D.C., was the general manager of Trenchant, the division of L3Harris that develops hacking and surveillance tools for the U.S. government and its closest global intelligence partners. Prosecutors sayWilliams took advantage of having “full access” to the company’s secure networksto download the hacking tools onto a portable hard drive, and later to his computer. Williams contacted Operation Zero under a pseudonym though, so it’s unclear if Operation Zero ever knew Williams’ real identity.\n\nTrenchant is a crew of hackers and bug hunters who dig deep into other popular software made by companies like Google and Apple, identify flaws in those millions of lines of code, then devise techniques to turn those flaws into workable exploits that can be used to reliably hack into those products. These tools are typically calledzero-dayexploits because they take advantage of software flaws unknown to its developer, whichcan be worth millions of dollars.\n\nTheU.S. Department of Justice allegedthat the hacking tools Williams sold could have allowed whoever used them to “potentially access millions of computers and devices around the world.”\n\nFor the past few months, I have been talking to sources and reporting on Williams’ story before news broke thathe had been arrested. But what I had heard was patchwork and at times conflicting. I had heard someone had been arrested, but given the secret nature of the work involved in exploit development, proving it would be challenging.\n\nContact UsDo you have more information about this case, and the alleged leak of Trenchant hacking tools? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, orby email.\n\nWhen I first heard of Williams, I wasn’t clear that I had even gotten his name right. At that point, his story was a rumor, moving through the hush-hush grapevine of zero-day exploit developers, sellers, and people with ties to the intelligence community.\n\nI heard that maybe he was called John, or perhaps Duggan? Or all the different ways you can spell that in English.\n\nSome of the first rumors I heard were contradictory. Apparently he stole zero-days from Trenchant, and maybe he sold them to Russia, or perhaps another enemy of the United States and its allies, like North Korea or China?\n\nIt took weeks just to confirm that there was indeed someone who even fit that description. (It turned out that Williams’ middle name is John, and Doogie is his nickname in hacker circles.)\n\nThen, as the weeks of reporting rolled on, things started to become much clearer.\n\nAsI first revealed in October, Trenchant fired an employee after Williams, who was still at the time head of Trenchant, accused the employee of stealing and leaking Chrome zero-days. The story was even more intriguing because the employee told me that after he was fired, Apple notified him that someone had targeted his personal iPhone.\n\nWhat I learned was just the tip of the iceberg. I had heard more from my sources, but we were still piecing parts of the story together.\n\nSoon after, prosecutors made their first formal accusation against a man named Peter Williams for stealing trade secrets, which first surfaced in the U.S. public court system. In that first court document, prosecutors confirmed that the buyer of these trade secrets was a buyer in Russia.\n\nHowever, there was no explicit reference to L3Harris nor Trenchant, nor the fact that the trade secrets that Williams stole were zero-days. Crucially, we still couldn’t confirm for certain that it was the same Peter Williams, who we thought would have access to highly sensitive exploits as Trenchant’s boss, and not some terrible case of mistaken identity.\n\nWestillweren’t there.\n\nOn a hunch and with nothing to lose, we contacted the Department of Justice to ask if they would confirm that the person in the document was in fact Peter Williams, the former boss of L3Harris Trenchant. A spokesperson confirmed.\n\nFinally,the story was out. A week later, Williams pleaded guilty.\n\nWhen I first heard of his story, while I trusted my sources, I remained skeptical. Why would someone like Williams do what the rumors claimed? But he did, and did so for money, prosecutors allege, which Williams then used to buy a house, jewelry, and luxury watches.\n\nIt was a remarkable fall from grace for Williams, once seen as an accomplished and brilliant hacker, and especially for someone who previously worked at Australia’s top foreign spy agency and served in the country’s military.\n\nWe still don’t know specifically which exploits and hacking tools Williams stole and sold. Trenchant estimated a loss of $35 million, per court documents. But Williams’ lawyers said the stolen tools were not classified as a government secret.\n\nWe can glean some insight based on the circumstances of the case.\n\nGiven that the Justice Department said the stolen tools could be used to hack “millions of computers and devices,” it’s likely the tools refer to zero-days in popular consumer software, such as Android devices, Apple’s iPhones and iPads, and web browsers.\n\nThere is some evidence pointing in their direction. During a hearing last year, prosecutors read out louda post published on Xby Operation Zero,according to independent cybersecurity reporter Kim Zetter, who attended the hearing.\n\n“Due to high demand on the market, we’re increasing payouts for top-tier mobile exploits,” read the post, which specifically mentioned Android and iOS. “As always, the end user is a non-NATO country.”\n\nOperation Zerooffers millions of dollarsfor details of security vulnerabilities in Android devices and iPhones, messaging appslike Telegram, as well asother kinds of software, such as Microsoft Windows, and hardware vendors, such as several brands of servers and routers.\n\nOperation Zeroclaimsto work with the Russian government. At the time Williams sold the exploits to the Russian broker, Putin’s full-scale invasion of Ukraine was already underway.\n\nOn the same day that Williams was sentenced, the U.S. Treasuryannounced it had imposed sanctionsagainst Operation Zero and its founder Sergey Zelenyuk, calling the company a national security threat. This was the government’s first confirmation that Williams had sold the exploits to Operation Zero.\n\nIn its statement, the Treasury said the broker “sold those stolen tools to at least one unauthorized user.” At this point we don’t know who this user is. The user could be a foreign intelligence service, or it could be a ransomware gang, given that the Treasury also sanctioned Oleg Vyacheslavovich Kucherov, an alleged member of the Trickbot gang, who also allegedly worked with Operation Zero.\n\nIn a court document, prosecutors said that L3Harris was able to figure out that “an unauthorized vendor was selling a component” of one of the stolen trade secrets “by comparing company-specific vendor data found on a stolen component that matched.”\n\nProsecutors also said that Williams “recognized code he wrote and sold” to Operation Zero “being utilized by a South Korean broker,” further suggesting that both L3Harris and prosecutors know which tools were stolen and sold to Operation Zero.\n\nAnother unanswered question is: Did anyone, either the U.S. government or L3Harris, alert Apple, Google, or whichever tech company’s products were affected by the zero-day flaws, now that the exploits had leaked?\n\nAny company or developer would want to know that someone could have used (or could still use) a zero-day against their users and customers so that they can patch the flaws as soon as possible. And at this point, the zero-days are of no use for L3Harris and its government customers.\n\nWhen I asked Apple and Google, neither company responded to my inquiries. L3Harris did not respond either.\n\nThen there’s the mystery of the scapegoat, who was fired after Williams accused him of stealing and leaking code.\n\nAt sentencing, Justice Department prosecutorsconfirmedthat the employee was fired, saying Williams “stood idly by while another employee of the company was essentially blamed for [his] own conduct.” In response, Williams’ attorney rebuffed prosecutors, claiming that the former employee “was fired for misconduct,” citing claims of dual-employment and improper handling of the company’s intellectual property.\n\nAccording to a court document submitted by Williams’ lawyers, as part of the L3Harris internal investigation, the company placed the employee on leave, seized his devices, transferred them to the U.S., and “offered them to the FBI.”\n\nWhen reached for comment, an unnamed FBI spokesperson said the bureau had nothing to add apart from the Justice Department’spress release.\n\nAfter being fired, that employee, whom we identified with the alias Jay Gibson, received a notification from Apple that his personal iPhone was targeted “with a mercenary spyware attack.”\n\nApplesendsthesenotificationsto users it thinks were the target of attacks using tools like those made by NSO Group or Intellexa.\n\nWho tried to hack Gibson? He received the notification on March 5, 2025, more than six months after the FBI investigation had begun. The FBI “regularly interacted with [Williams] in late 2024 through the summer of 2025,”according to a court document.\n\nGiven the nature of the leaked tools, it is plausible that the FBI, or perhaps even a U.S. intelligence agency, targeted Gibson as part of the investigation into Williams’ leaks. But we just don’t know, and there’s a chance that neither the public, nor Gibson, will ever find out.\n\nUpdated to clarify 22nd paragraph attributing the tools’ lack of classification to Williams’ lawyers.",
      "excerpt": "A veteran cybersecurity executive who prosecutors said “betrayed” the United States will spend at least the next seven years behind bars, after pleading guilty to stealing and selling hacking and surveillance tools to a Russian firm.\n\nPeter Williams, a former executive at U.S. defense contractor L3H",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Alphabet-owned robotics software company Intrinsic joins Google",
      "link": "https://techcrunch.com/2026/02/25/alphabet-owned-robotics-software-company-intrinsic-joins-google/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-25T12:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Intrinsic.jpg?resize=1200,1108",
      "category": "Robotics",
      "content": "Google is moving further into physical AI by bringing a familiar robotics software platform under its wing.\n\nAlphabet-owned Intrinsic, which builds AI models and software designed to make industrial robots more accessible, is joining Google, the companiesannounced on Wednesday. Intrinsic will remain a distinct entity within Google but will work closely with Google DeepMind and will tap into Google’s Gemini AI models and cloud services.\n\nAlphabet declined to share information regarding funding or purchase price.\n\nIntrinsic “graduated” into anindependent Alphabet-owned company in 2021after five years of development within Alphabet’s X, the company’s moonshot research division. Other companies that have graduated from X include robotaxi company Waymo and drone delivery company Wing.\n\nWendy Tan White has served as Intrinsic’s CEO since its spinout in 2021.\n\nThe company hit the ground running. A few months after announcing its independence,Intrinsic acquired Vicarious, a fellow robotics software company, in April 2022. While the purchase price wasn’t disclosed, Vicarious had raised about $250 million from VCs and tech bigwigs like Jeff Bezos.\n\nA few months later, Intrinsicacquired several for-profit divisionsof Open Robotics, a nonprofit organization that builds hardware and software platforms for the robotics industry.\n\nDespite this rapid expansion,Intrinsic laid off 20% of its workforcein January 2023.\n\nThe company announced its first product, Flowstate, just a few months later. Flowstate is a software platform fordeveloping robotics workflowsaimed at developers that don’t have deep robotics experience — aligning with the company’s mission to make robotics more accessible.\n\nSince then, the company has fine-tuned the technology, improved its simulation capabilities, and released its Intrinsic Vision AI model in late 2025.\n\nIntrinsic announced ajoint venture with electronics manufacturer Foxconnin October 2025 that entails the two companies working together on general-purpose intelligent robots to transform how electronics are manufactured, with the goal of full factory automation.\n\nNow, the company is working toward those goals with closer collaboration with Google’s AI prowess.\n\n“Combined with Google’s incredible AI and infrastructure, we’re going to unlock the promise of physical AI for a much broader set of manufacturing businesses and developers. This will fundamentally shift production, from its economics to operations, and enable truly advanced manufacturing,” Tan White wrote in the company’s blog post.\n\nThis move makes a lot of sense for Google, as many tech leaders, includingNvidia’s Jensen HuangandQualcomm’s Cristiano Amon, see physical AI as the next natural step in the monetization and advancement of AI models and technology.",
      "excerpt": "Google is moving further into physical AI by bringing a familiar robotics software platform under its wing.\n\nAlphabet-owned Intrinsic, which builds AI models and software designed to make industrial robots more accessible, is joining Google, the companiesannounced on Wednesday. Intrinsic will remain",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The White House wants AI companies to cover rate hikes. Most have already said they would.",
      "link": "https://techcrunch.com/2026/02/25/the-white-house-wants-ai-companies-to-cover-rate-hikes-most-have-already-said-they-would/",
      "author": "Tim Fernholz",
      "date": "2026-02-25T12:42:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-692150220.jpeg?resize=1200,800",
      "category": "AI",
      "content": "The proliferation of AI data centers plugging into the national electrical grid has helped increase consumer electricity prices, driving up the average national electricity price by more than 6% in the last year.\n\nThat’s not a good look for the incumbents ahead of this fall’s elections, and President Donald Trump addressed the challenge in his State of the Union speech last night.\n\n“We’re telling the major tech companies that they have the obligation to provide for their own power needs,” Trump said. “They can build their own power plants as part of their factory, so that no one’s prices will go up.”\n\nThe  hyperscalers in question don’t need to be told. They have already made public commitments in recent weeks to cover electricity costs by building their own power sources, paying higher rates, or both, part of a broader effort to solve PR problems around data center expansion and win over skeptical communities.\n\nOn January 11, Microsoftannouncedits policy “to ensure that the electricity cost of serving our datacenters is not passed on to residential customers.” On January 26, OpenAIcommittedto “paying its own way on energy, so that our operations don’t increase your energy prices.” On February 11, Anthropic made thesame pledgeto “cover electricity price increases that consumers face from our data centers.” Yesterday, Googleannouncedthe largest battery project in the world to support a data center in Minnesota.\n\nWhat these commitments mean in practice, and who will determine which data centers are responsible for which price increases, remains unknown. The White House has not released the text of the proposed pledge.\n\n“A handshake agreement with Big Tech over data center costs isn’t good enough,” Arizona Democratic Senator Mark Kellysaidon social media. “Americans need a guarantee that energy prices won’t soar and communities have a say.”\n\nWhite House spokesperson Taylor Rodgerssaidthat next week, companies will send representatives to formally sign the pledge at the White House. Amazon, Google, Meta, Microsoft, xAI, Oracle, and OpenAI are reportedly among those set to attend. However, none of the companies have confirmed their attendance.\n\nEven if tech companies commit to taking on electricity costs, on-site power plants may not be a panacea — they can still have adverse impacts on thesurrounding environment, and will stress supply chains for natural gas, turbines, photovoltaics, and batteries, depending on how companies aim to power their compute.",
      "excerpt": "The proliferation of AI data centers plugging into the national electrical grid has helped increase consumer electricity prices, driving up the average national electricity price by more than 6% in the last year.\n\nThat’s not a good look for the incumbents ahead of this fall’s elections, and Presiden",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "3 days left: Save up to $680 on your TechCrunch Disrupt 2026 ticket",
      "link": "https://techcrunch.com/2026/02/25/3-days-left-save-up-to-680-on-your-techcrunch-disrupt-2026-ticket/",
      "author": "TechCrunch Events",
      "date": "2026-02-25T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/TCD26_3Days-16X9-Dark.png?resize=1200,675",
      "category": "Startups",
      "content": "Time is running out! Just 3 days left before Super Early Bird pricing ends on February 27 at 11:59 p.m. PT. This is your last chance to secure the lowest ticket rates forTechCrunch Disrupt 2026. If 2026 is your year to fundraise, hire, scale, or launch, you cannot afford to miss it.\n\nLock in your pass nowbefore prices jump. This is the moment to act.\n\nFrom October 13–15 at Moscone West in San Francisco, 10,000+ founders, operators, and investors gather for three days of high-signal conversations, deal-making, and actionable insights. Disrupt is not just content — it’s access to accelerated growth.\n\nYou don’t attendDisruptto sit in the audience. You go to gain leverage. Every session, every conversation, and every connection is designed to accelerate your growth and compound your momentum. You’ll get:\n\nLast year, more than 20,000 curated meetings took place on-site. In 2026, upgraded tools will make those connections even more targeted and efficient. One conversation can change your trajectory — and at Disrupt, that is the point.\n\nDisrupt has long been the stage for founders and investors who define eras. Past speakers have included category-defining leaders and top-tier VCs, such as:\n\nIn 2025, Disrupt featured 200+ onstage conversations with 250+ tech and VC leaders across AI, hardware, space, startup growth, and venture. Expect the same high-caliber content this year and check theevent pageas the 2026 agenda rolls out.\n\nStartup Battlefieldreturns with 200 pre-Series A companies competing for $100,000 in equity-free funding, global visibility, and direct investor access. Alumni include Discord, Cloudflare, and Trello.\n\nIf you want to see what’s next and hear directly from top VCs on scaling a viable startup, the Disrupt Stage is where it happens first.\n\nWith300+ startup exhibitors, the venue, especially the Expo Hall, is where deal flow and discovery collide. You won’t just observe trends; you’ll see them before they scale. You’ll be able to:\n\nFrom October 11 to 17, Disrupt Side Events take place across the Bay Area, including breakfasts, cocktail hours, panels, and founder meetups that extend the connections beyond the main stage. The main event is powerful. The surrounding ecosystem makes it even stronger.\n\nSuper Early Bird pricing ends this Friday, February 27, at 11:59 p.m. PT. If you want to be in the room where capital moves, companies scale, and ideas turn into breakthroughs, now is the time to lock in your discounted ticket.\n\nRegister now before it’s too late. Save up to $680 on yourindividual pass, or up to 30% ongroup passes.",
      "excerpt": "Time is running out! Just 3 days left before Super Early Bird pricing ends on February 27 at 11:59 p.m. PT. This is your last chance to secure the lowest ticket rates forTechCrunch Disrupt 2026. If 2026 is your year to fundraise, hire, scale, or launch, you cannot afford to miss it.\n\nLock in your pa",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "US cybersecurity agency CISA reportedly in dire shape amid Trump cuts and layoffs",
      "link": "https://techcrunch.com/2026/02/25/us-cybersecurity-agency-cisa-reportedly-in-dire-shape-amid-trump-cuts-and-layoffs/",
      "author": "Zack Whittaker",
      "date": "2026-02-25T12:26:57-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/DHS-Getty.jpg?resize=1200,800",
      "category": "Security",
      "content": "U.S. cybersecurity agencyCISAisreportedly in dire shape, according to bipartisan lawmakers and industry leaders who fear that the agency’s ability to perform its core mission has been diminished and left it unprepared for a cybersecurity crisis.\n\nNews siteCyberscoop’sTim Starks spoke with sources across Congress, the private cyber industry, and beyond, and what came back reflected a general consensus that CISA has suffered under cuts and layoffs during the Trump administration’s first year.\n\nOver that time, CISA has lost around one-third of its staff, which cost it programs, personnel, and expertise, including the agency’s counter-ransomware initiative and efforts to promote secure software development. Some of these haveincluded several members of its election security team, TechCrunch reported last year. CISA is the federal agency responsible for election security. Some warned that Trump’s ongoing obsession with promoting false claims about the 2020 election has led to the administration deprioritizing CISA.\n\nCISAalsoreassignedhundreds of other staffersto aid other agencies within the Department of Homeland Security as part of the Trump administration’s broad immigration crackdown.\n\nMany of Cyberscoop’s sources blame the Trump administration, Congress, or both. Others singled out CISA’s acting director, Madhu Gottumukkala, as having struggled to lead the agency and reportedly causedsecurity headachesas a result.\n\nCISA has beenwithout a permanent directorsince Trump entered office in 2025.\n\nThe cybersecurity agency is said to be currently operatingat around 38% staff levelsas the partial U.S. federal government shutdown, which began on February 14, drags on. Lawmakers have declined to continue funding federal immigration authorities amid widespread criticism following the killing of two U.S. citizens by federal agents.\n\nWhen reached for comment, CISA’s Gottumukkala told TechCrunch that the agency “remains unwavering in its commitment to protect our federal networks from malicious cyber threat actors despite the multi-week government shutdown” of Homeland Security.",
      "excerpt": "U.S. cybersecurity agencyCISAisreportedly in dire shape, according to bipartisan lawmakers and industry leaders who fear that the agency’s ability to perform its core mission has been diminished and left it unprepared for a cybersecurity crisis.\n\nNews siteCyberscoop’sTim Starks spoke with sources ac",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Spyware maker sentenced to prison in Greece for wiretapping politicians and journalists",
      "link": "https://techcrunch.com/2026/02/26/spyware-maker-sentenced-to-prison-in-greece-for-wiretapping-politicians-and-journalists/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-26T07:45:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/06/stalkerware-spyware-lms-non-vignette.jpg?resize=1200,800",
      "category": "",
      "content": "A Greek court on Thursday sentenced the founder of Intellexa, a collective of spyware makers, to eight years in prison for illegal wiretapping and privacy violations,accordingtoseveralreports.\n\nTal Dilian and three otherIntellexaexecutives were tried for their role in a scandal dubbed “Greek Watergate,” which dates back to 2022. The Greek government was accused of wiretapping the phones of politicians, journalists, businesspeople, and military officials with spyware developed by Intellexa.\n\nThe other people sentenced today include Dilian’s business partner Sara Aleksandra Fayssal Hamou; his former deputy administrator and shareholder of Intellexa, Felix Bitzios; and Yiannis Lavranos, who owned a company linked to Intellexa.\n\nDilian did not respond to TechCrunch’s request for comment.\n\nThis is the first known time a spyware maker has been sentenced to jail following the misuse of their technology.\n\nIn 2024,the U.S. government sanctioned Intellexaand several of its linked companies, Dilian, and Hamou, for their role in developing its spyware, known as Predator, used in the targeting of Americans, including government officials and journalists.\n\nThe court ordered authorities to further investigate, and stayed the sentence pending appeal.",
      "excerpt": "A Greek court on Thursday sentenced the founder of Intellexa, a collective of spyware makers, to eight years in prison for illegal wiretapping and privacy violations,accordingtoseveralreports.\n\nTal Dilian and three otherIntellexaexecutives were tried for their role in a scandal dubbed “Greek Waterga",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "X tries wooing advertisers by letting them reuse creatives made for other platforms",
      "link": "https://techcrunch.com/2026/02/26/x-tries-wooing-advertisers-by-letting-them-reuse-creative-assets-from-other-platforms/",
      "author": "Sarah Perez",
      "date": "2026-02-26T07:41:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/08/twitter-x-logo-musk-1.jpg?resize=1200,675",
      "category": "",
      "content": "Elon Musk’s X is making it easier for advertisers to bring their creative campaigns from other social sites to its platform.\n\nOn Thursday, the company launched an expanded set of aspect ratio support for both image and video ads, which means advertisers can now reuse the material they’ve created for other platforms without having to reformat, crop, or rebuild their assets.\n\nWhile AI has been helping advertisers automate the process of resizing creative assets for different platforms, it’s easier if advertisers don’t have to take that extra step at all.\n\nSo X is now allowing advertisers to upload the same assets they’re using elsewhere on social media to its own X Ads Manager via Media Studio or its Campaign Form.\n\nSeamlessly reuse existing social media creatives directly on X with new expanded ratios – no reformatting required.pic.twitter.com/qevOyL8jPd\n\nThe change signals the continued importance of X’s ad business, which suffered declines after the company, then known as Twitter, was acquired by Musk. Whilead sales improvedunder former CEO Linda Yaccarino, its 2025 revenueswere still lowerthan they were prior to Musk’s acquisition.\n\nAccording toeMarketer’sforecast last May, X’s ad business was expected to start revitalizing sometime last year, whichBloombergconfirmed, but would remain half the size it was before the sale.\n\nX says the new aspect ratios now being supported include 4:5 (1440 x 1800 pixels) and 2:3 (1080 × 1620 pixels). The company already supports other formats, including 1:1 (1080 × 1080 pixels), 16:9 (1920 × 1080 pixels), 9:16 (1080 × 1920 pixels), and 1.91:1 (2064 × 1080 pixels).\n\n“We’re committed to empowering advertisers to hit their performance goals with greater ease and impact,” said Monique Pintarelli, head of global advertising at xAI, in a statement. (xAIacquiredX last year.)\n\n“With full aspect ratio support, brands can now repurpose creatives directly on X—eliminating reformatting, duplication, or compromise—while unlocking faster testing, brand consistency, and incremental reach among our highly engaged, real-time audience for superior results,” she added.",
      "excerpt": "Elon Musk’s X is making it easier for advertisers to bring their creative campaigns from other social sites to its platform.\n\nOn Thursday, the company launched an expanded set of aspect ratio support for both image and video ads, which means advertisers can now reuse the material they’ve created for",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}