{
  "last_updated": "2026-02-04T22:32:27.250410+00:00",
  "articles": [
    {
      "title": "Meet Gizmo: a TikTok for interactive, vibe-coded mini apps",
      "link": "https://techcrunch.com/2026/02/04/meet-gizmo-a-tiktok-for-interactive-vibe-coded-mini-apps/",
      "author": "Sarah Perez",
      "date": "2026-02-04T13:45:32-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/gizmo-app.jpg?resize=1200,764",
      "category": "Apps",
      "content": "Gizmo, a TikTok-like app for vibe-coded mini applications, is offering a new way to create interactive media. The relatively new mobile app from the startupAtma Scienceslets anyone create experiences using text, photos, sound, and touch, which are then displayed in a vertical feed, similar to TikTok or Reels. But unlike traditional short-form video apps, you don’t just watch and scroll in Gizmo — you play.\n\nDepending on the type of “Gizmo” you encounter, you might poke the screen, swipe, tap, draw, drag, and more to interact with the mini app. These Gizmos aren’t just games but are more like digital toys — things that could include interactive puzzles, memes, art, animation, or anything else a creator can dream up.\n\nThe result is an engaging, playful feed, where you can like and comment on the tiny creations and even remix existing Gizmos to create your own version, if you choose.\n\nWhat’s more, you don’t need to know how to code or even vibe code to get started. Instead, you can simply type out an AI prompt to explain your idea using natural language.\n\nThe app then leverages AI coding technology to turn your idea into an interactive experience by generating the code that makes it work. As part of this process, Gizmo will also render your idea visually to ensure that each app functions properly and runs smoothly. Apps are also vetted using AI and human moderation to ensure user safety, a companyFAQnotes.\n\nEvery post on gizmo is a mini app#brainrot#robloxmemes#lebronjamesedit\n\nGizmo hails from a New York-based startup calledAtma Sciences, co-founded by Rudd Fawcett and Brandon Francis, along with CEO Josh Siegel and CTO Daniel Amitay. The company last year raised a $5.49 million seed round from First Round Capital and others, according to data fromPitchBook. On the company’s website (which is also silly and interactive), the team explains their focus is on combining “powerful technology with simple, elegant foundations,” starting with their creativity app, Gizmo.\n\nNon",
      "excerpt": "Gizmo, a TikTok-like app for vibe-coded mini applications, is offering a new way to create interactive media. The relatively new mobile app from the startupAtma Scienceslets anyone create experiences using text, photos, sound, and touch, which are then displayed in a vertical feed, similar to TikTok",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hackers publish personal information stolen during Harvard, UPenn data breaches",
      "link": "https://techcrunch.com/2026/02/04/hackers-publish-personal-information-stolen-during-harvard-upenn-data-breaches/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-04T09:56:37-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/harvard-university-campus-2025.jpg?resize=1200,770",
      "category": "Security",
      "content": "A notorious hacking group has claimed responsibility for last year’s data breaches at Harvard University and the University of Pennsylvania (UPenn) and published the data that they claim to have stolen from the two schools.\n\nOn Wednesday, the group known asShinyHunterspublished what it claims are more than 1 million records from each university on the group’s dedicated leak site, which the gang uses to extort its victims.\n\nIn November,UPenn confirmed a data breachof “a select group of information systems related to Penn’s development and alumni activities.” At the time, the hackers also sent alumni emails announcing the hack fromofficial university addresses.\n\nThe university blamed the breach onsocial engineering, an attack that often relies on hackers impersonating someone and tricking them into doing something they would not normally do. In itsofficial breach disclosure web page, which has since been taken offline, UPenn did not say exactly what type of data the hackers stole, simply saying the cybercriminals accessed “systems related to Penn’s development and alumni activities.”\n\nContact UsDo you have more information about these breaches, or similar attacks? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, oremail.\n\nTechCrunch verified a portion of the dataset by confirming with alumni and public records, such as matching the data against student ID numbers.\n\nLater in November, Harvard University also confirmed a breach on its alumni systems, blaming it on a voicephishingattack, meaning an attack where hackers tricked the targets into clicking on a link or opening an attachment with a voice call.\n\nHarvardsaidthat the stolen data included email addresses, phone numbers, home and business addresses, event attendance, details of donations to the university, and other biographical information relating to the university’s fundraising and alumni engagement activit",
      "excerpt": "A notorious hacking group has claimed responsibility for last year’s data breaches at Harvard University and the University of Pennsylvania (UPenn) and published the data that they claim to have stolen from the two schools.\n\nOn Wednesday, the group known asShinyHunterspublished what it claims are mo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Tinder looks to AI to help fight ‘swipe fatigue’ and dating app burnout",
      "link": "https://techcrunch.com/2026/02/04/tinder-looks-to-ai-to-help-fight-swipe-fatigue-and-dating-app-burnout/",
      "author": "Sarah Perez",
      "date": "2026-02-04T10:08:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2197117084.jpg?resize=1200,843",
      "category": "Apps",
      "content": "Tinder is turning to a new AI-powered feature, Chemistry, to help it reduce so-called “swipe fatigue,” a growing problem among online dating users who are feeling burned out and are in search of better outcomes.\n\nIntroduced last quarter, the Match-owned dating app said that Chemistry leverages AI to get to know users through questions and, with permission, accesses their Camera Roll on their phone to learn more about their interests and personality.\n\nOn Match’s Q4 2026 earnings call, one analyst from Morgan Stanley asked for an update on the product’s success so far.\n\nMatch CEO Spencer Rascoff noted that Chemistry was still only being tested in Australia for the time being, but said that the feature offered users an “AI way to interact with Tinder.” He explained that users could choose to answer questions to then “get just a single drop or two, rather than swiping through many, many profiles.”\n\nIn addition to Chemistry’s Q&A and Camera Roll features, the company plans to use the AI feature in other ways going forward, the CEO also hinted.\n\nMost importantly, Rascoff said the feature is designed to combat swipe fatigue — a complaint from users who say they have to swipe through too many profiles to find a potential match.\n\nThe company’s turn toward AI comes as Tinder and other dating apps have been experiencing paying subscriber declines, user burnout, and declines in new sign-ups.\n\nIn the fourth quarter, new registrations on Tinder were still down 5% year-over-year, and its monthly active users were down 9%. These numbers show some slight improvements over prior quarters, which Match attributes to AI-driven recommendations that change the order of profiles shown to women, and other product experiments.\n\nMatch said that this year, it aims to address common Gen Z pain points, including better relevance, authenticity, and trust. To do so, the company said it is redesigning discovery to make it less repetitive and is using other features, likeFace Check— a facial recogni",
      "excerpt": "Tinder is turning to a new AI-powered feature, Chemistry, to help it reduce so-called “swipe fatigue,” a growing problem among online dating users who are feeling burned out and are in search of better outcomes.\n\nIntroduced last quarter, the Match-owned dating app said that Chemistry leverages AI to",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "ElevenLabs raises $500M from Sequoia at an $11 billion valuation",
      "link": "https://techcrunch.com/2026/02/04/elevenlabs-raises-500m-from-sequioia-at-a-11-billion-valuation/",
      "author": "Ivan Mehta",
      "date": "2026-02-04T07:33:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/ElevenLabs-feat.jpg?resize=1200,669",
      "category": "Venture",
      "content": "Voice AI company ElevenLabs said today it raised $500 million in a new funding round led by Sequoia Capital, which was an investor inthe startup’s last secondary round through a tender. Sequoia partner Andrew Reed is joining the company’s board.\n\nThe startup is now valued at $11 billion, more than three times its valuation inits last round in January 2025. Earlier in the year, theFinancial Timesreported that the startup was looking to raise at that valuation.\n\nThe company said that existing investor a16z quadrupled its investment amount, and Iconiq, which led the last round, tripled it. Some prior investors, like BroadLight, NFDG, Valor Capital, AMP Coalition, and Smash Capital, also joined the round. New investors for the funding included Lightspeed Venture Partners, EvanticCapital, and Bond.\n\nElevenLabs said that it will disclose some investors later in February, which might be strategic partners. The company has raised over $781 million to date. It said that it will use the funding for research and product development, along with expansion in international markets like India, Japan, Singapore, Brazil, and Mexico.\n\nThe company’s co-founder, Mati Staniszewski, indicated that ElevenLabs might work on agents beyond voice and incorporate video. In January, the company announceda partnership with LTX to produce audio-to-video content.\n\n“The intersection of models and products is critical – and our team has proven, time and again, how to translate research into real-world experiences. This funding helps us go beyond voice alone to transform how we interact with technology altogether. We plan to expand our Creative offering – helping creators combine our best-in-class audio with video and Agents – enabling businesses to build agents that can talk, type, and take action,” he said in a statement.\n\nThe company has seen good growth momentum as it closed the year at $330 million ARR. In an interview withBloombergearlier this year, Staniszewski said that it took ElevenLabs fiv",
      "excerpt": "Voice AI company ElevenLabs said today it raised $500 million in a new funding round led by Sequoia Capital, which was an investor inthe startup’s last secondary round through a tender. Sequoia partner Andrew Reed is joining the company’s board.\n\nThe startup is now valued at $11 billion, more than t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Uber appoints new CFO as its AV plans accelerate",
      "link": "https://techcrunch.com/2026/02/04/uber-appoints-new-cfo-as-its-av-plans-accelerate/",
      "author": "Ram Iyer",
      "date": "2026-02-04T06:15:34-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/07/GettyImages-2043993878-e1722276196662.jpg?resize=1200,676",
      "category": "Transportation",
      "content": "Uber is promoting Balaji Krishnamurthy, its VP of strategic finance and investor relations, to be its CFO, replacing its current finance chief Prashanth Mahendra-Rajah.\n\nKrishnamurthy has been at Uber for over six years, spending most of his tenure in the company in its investor relations division. He often posts about the company’s autonomous ride-hailing efforts, and has a board seat at AV company Waabi — so the appointment may be a signal of the company’s plans to expand its driverless investments and operations.\n\nIndeed, on the company’s fourth-quarter earnings call on Wednesday, Krishnamurthysaidthe company would invest capital in its AV software partners, work with AV makers by investing equity or via offtake agreements, and “support our AV infrastructure partners.”\n\n“With large and growing free cash flows, over the coming years we will invest with discipline across a multitude of opportunities, including positioning Uber to win in an AV future,” Krishnamurthy wrote in astatementdetailing the company’s Q4 results.\n\nUber’s CEO Dara Khosrowshahi said on the call that he was convinced autonomous vehicles would “unlock a multitrillion-dollar opportunity,” for the company, adding that autonomy “fundamentally amplifies” the strengths of the company’s platform.\n\n“By the end of 2026, we expect to be facilitating AV trips in as many as 15 cities globally, with a roughly even split of U.S. and international cities. And by 2029, we intend to be the largest facilitator of AV trips in the world,” Khosrowshahi said.\n\nOver the past two years, Uber has amassed partnerships with at least 20 autonomous vehicle companies across a variety of use cases, including sidewalk delivery robots, robotaxis, and trucking. Waymo is perhaps its highest profile partner with shared robotaxi operations in Atlanta and Austin. It has also struck deals withAvride, UK-based Wayve, Chinese companiesWeRide,Momenta, andVolkswagen, among others.\n\nIt has made direct investments in AV startups as well. W",
      "excerpt": "Uber is promoting Balaji Krishnamurthy, its VP of strategic finance and investor relations, to be its CFO, replacing its current finance chief Prashanth Mahendra-Rajah.\n\nKrishnamurthy has been at Uber for over six years, spending most of his tenure in the company in its investor relations division. ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Lunar Energy raises $232M to deploy home batteries that prop up the grid",
      "link": "https://techcrunch.com/2026/02/04/lunar-energy-raises-232m-to-deploy-home-batteries-that-prop-up-the-grid/",
      "author": "Tim De Chant",
      "date": "2026-02-04T09:56:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Lunar-System_KM-1.jpg?resize=1200,673",
      "category": "Climate",
      "content": "Forget EVs — stationary batteries aregetting all the buzz, and investment, in the U.S. these days.\n\nStartupLunar Energyis the latest example. The six-year-old company, which builds battery packs for homeowners in California, Georgia, and Washington, said Wednesday it has completed two large funding rounds. The startup shared it raised a previously unannounced $130 million Series C and a $102 million Series D. The Series C was led by Activate Capital, while the Series D was led by B Capital and Prelude Ventures.\n\nThe startup plans to use the funds to scale manufacturing to 20,000 units by the end of this year before ramping up to 100,000 by the end of 2028. In total, Lunar has raised more than $500 million from investors.\n\nStationary storage has become a bright spot for battery manufacturers that have been subject to policy whiplash after the Trump administration and GOP-controlled Congressgutted large parts of the Inflation Reduction Act, which had incentivized companies to build batteries in the U.S. to supply the automotive industry.\n\nAs the grid strains under the weight of an increasingly electrified economy — along with the boom in data center demand — grid-connected batteries have become one of the most versatile ways to boost its resiliency.\n\nLunar can call on its fleet of batteries, which come in 5 kilowatt-hour modules between 15 kilowatt-hours and 30 kilowatt-hours, to deliver juice to the grid when needed. Its virtual power plant (VPP) software can also control EV chargers and appliances, allowing it to both supply electrons while tamping down demand.\n\nSuch VPPs areexpectedto be able to replace costly and polluting peaking power plants in a matter of years.\n\nCompetition in the space has been heating up lately. In October,Base Power raised $1 billion, less than six months after raising a $200 million round for its residential battery-based VPP. Tesla operates its own Powerwall-based VPP, too.\n\nOutside of residential settings, Tesla’s storage business has be",
      "excerpt": "Forget EVs — stationary batteries aregetting all the buzz, and investment, in the U.S. these days.\n\nStartupLunar Energyis the latest example. The six-year-old company, which builds battery packs for homeowners in California, Georgia, and Washington, said Wednesday it has completed two large funding ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Exclusive: Positron raises $230M Series B to take on Nvidia’s AI chips",
      "link": "https://techcrunch.com/2026/02/04/exclusive-positron-raises-230m-series-b-to-take-on-nvidias-ai-chips/",
      "author": "Rebecca Bellan",
      "date": "2026-02-04T00:18:51-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/positron.jpg?w=1200",
      "category": "AI",
      "content": "Semiconductor startupPositronhas secured $230 million in Series B funding, TechCrunch has exclusively learned. The outfit plans to use the capital to speed up deployment of its high-speed memory chips, a critical component for the chips used for AI workloads, sources familiar with the matter told TechCrunch.\n\nThe round, which brought Positron to a $1 billion valuation, was co-led by Arena Private Wealth, Jump Trading, and Unless, with strategic investment from Qatar Investment Authority (QIA), the country’s sovereign wealth fund, which has been increasingly focused on building out AI infrastructure, the sources said.\n\nThe Reno-based startup’s Series B comes as hyperscalers and AI firms push to reduce their reliance on longstanding leader Nvidia. These firms include OpenAI, which, despite being one of Nvidia’s largest and most important customers, isreportedlyunsatisfied with some of the firm’s latest AI chips and has been seeking alternatives since last year.\n\nMeanwhile, Qatar, through QIA, has been accelerating a broader push into so-called “sovereign” AI infrastructure — a priority repeatedly underscored at Web Summit Qatar in Doha this week. Several sources told TechCrunch the country views compute capacity as critical to staying competitive on the global economic stage, and is positioning itself as a leading AI services hub in the Middle East, fueling interest in startups like Positron.\n\nThe strategy is already taking shape through major commitments, including a $20 billion AI infrastructurejoint venture with Brookfield Asset Managementthat was announced in December.\n\nPositron’s fundraise brings the three-year-old startup’s total capital raised to just over $300 million. The startup previously raised $75 million last year from investors including Valor Equity Partners, Atreides Management, DFJ Growth, Flume Ventures, and Resilience Reserve.\n\nThe company claims its first-generation chip, Atlas, manufactured in Arizona, can match the performance of Nvidia’s H100 G",
      "excerpt": "Semiconductor startupPositronhas secured $230 million in Series B funding, TechCrunch has exclusively learned. The outfit plans to use the capital to speed up deployment of its high-speed memory chips, a critical component for the chips used for AI workloads, sources familiar with the matter told Te",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "2026 plans: What’s next for Startup Battlefield 200",
      "link": "https://techcrunch.com/2026/02/03/looking-ahead-to-2026-whats-next-for-startup-battlefield-200/",
      "author": "Isabelle Johannessen",
      "date": "2026-02-03T10:57:30-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/11/54889460445_20c033b45a_o-2.jpg?resize=1200,800",
      "category": "Startups",
      "content": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unparalleled visibility, access to top-tier investors, and opportunities to grow.\n\nEarly-stage startups from around the world are joining theStartup Battlefield email listto be the first to know when applications open this month. Don’t miss a beat if you’re ready to join the action.\n\nStartup Battlefield 200is a highly selective startup launch program designed to prepare early-stage startups for visibility, investment, and scale. Each year, TechCrunch hand-selects 200 companies to gain unmatched exposure, credibility, and opportunities to scale faster than they ever imagined:\n\nStartup Battlefield’s track record is among the strongest in the industry — alumni represent1,700+ companiesthat have collectively raised over $32 billion and include well-known names such as:\n\nIn 2026,Startup Battlefield 200will once again bring together a global cohort of high-potential early-stage startups building across AI, climate, health, fintech, and beyond.\n\nApplications will open in the middle of this month and close in mid-June. Selected startups will be notified aroundSeptember 1, when the virtual preparation program begins — designed to help founders refine their story, sharpen their pitch, and get ready for the pitch of a lifetime on the TechCrunch Disrupt stage.\n\nFor founders and investors alike, Startup Battlefield 200 remains one of the most influential global early-stage startup stages — a place where breakout companies get seen, funded, and scaled.\n\nDon’t miss a moment of the action:Join the Startup Battlefield mailing listto be the first to know when applications open next month.",
      "excerpt": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unpara",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The Wayback Machine debuts a new plugin designed to fix the internet’s broken links problem",
      "link": "https://techcrunch.com/2026/02/04/the-wayback-machine-debuts-a-new-plugin-designed-to-fix-the-internets-broken-links-problem/",
      "author": "Lucas Ropek",
      "date": "2026-02-04T14:27:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-114847550.jpg?resize=1200,780",
      "category": "Gadgets",
      "content": "The Internet Archive is a non-profit that—as you might expect—is devoted to archiving the internet and preserving digital context for future generations. This week, the platform announced a new tool designed to expand on that mission by helping the world’s WordPress users keep their articles in peak digital health.\n\nThe Archive’sWayback Machine, which indexes the web through widespread snapshotting, has partnered with Automattic, thecompany behind WordPress. Together, the two organizations have launched a new WordPress plugin—the Link Fixer—that is designed to combat the scourge of “link rot.”\n\n“Link rot” is the unfortunate phenomenon whereby online articles become populated by broken links — URLs that once led to active pages but now result in error messages or dead ends. APew Research studyfrom 2024 showed that nearly 40% of links that existed in 2013 were no longer active. Such “digital decay” occurs across a broad diversity of webpages, from news and government sites to Wikipedia pages to tweets.\n\nAutomatticsays thatits new plugin works by scanning your WordPress posts for outbound links, then cross-referencing the Wayback Machine for archived versions of those links. If there are none, it will automatically take new snapshots of the articles in question. Should a linked webpage go offline, the new feature will then redirect readers to the archived versions, so that there is no drop in service. The tool also archives a user’s own posts, helping to ensure their longevity.\n\nThe tool is designed to keep a site’s visitors reading the best available version of a webpage. Indeed, Automattic’s plugin perpetually checks a webpage’s links and, if an original link that had gone offline is resurrected, the plugin will start redirecting the user to that original page again instead of the archived version.\n\nAwrite-up on Githubshows that the plugin’s controls are relatively easy to maneuver and offer convenient customization. For instance, users can specify how often they wan",
      "excerpt": "The Internet Archive is a non-profit that—as you might expect—is devoted to archiving the internet and preserving digital context for future generations. This week, the platform announced a new tool designed to expand on that mission by helping the world’s WordPress users keep their articles in peak",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Elon Musk’s SpaceX company town is getting a police department",
      "link": "https://techcrunch.com/2026/02/04/elon-musks-spacex-company-town-is-getting-a-police-department/",
      "author": "Sean O'Kane",
      "date": "2026-02-04T13:47:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2074390033.jpg?resize=1200,675",
      "category": "Space",
      "content": "Starbase, the company town that Elon Musk’s SpaceX created in South Texas, is forming its own police squad.\n\nThe city’s commission approved anordinanceduring a special meeting Tuesday that would create a municipal police department, subject to approval from the Texas Commission on Law Enforcement (TCOLE). The department will be run by a chief of police elected by the city’s commission, and is expected to hire eight officers, according to local news outletValley Central. It could be up and running in a few months.\n\n“There is a lot of assets here with the operations of SpaceX,” Starbase city administrator Kent Myers told the outlet. “Those assets need to be protected, and so the police department will play a critical part in protecting those assets.”\n\nIt’s not clear if Starbase has submitted its application to the TCOLE yet. The city and the TCOLE did not respond to requests for comment. Starbase reportedly hired security consulting firm Vision Quest Solutions to build out the department.\n\nStarbase is where SpaceX makes and tests its prototype Starship rocket. The city is small — it is currently home to just a few hundred residents, most of whom are SpaceX employees (or family of those workers). But it is geographically isolated. The closest neighboring town is Brownsville, which is about 10 miles away, though the drive can take 45 minutes or longer.\n\nA police department would be the latest addition to public services that have become available in Starbase since it was incorporatedas a city last year. In October, a handful of SpaceX employees who live at Starbasestarted a volunteer fire department. The city also created a fire marshal position and took on its own building inspections and permitting around that same time.\n\nStarbase initially tried to handle law enforcement within its city limits by contracting with the Cameron County sheriff’s office. The citystruck a $3.5 million, five-year contractwith the sheriff’s office that was supposed to see two deputies patrol",
      "excerpt": "Starbase, the company town that Elon Musk’s SpaceX created in South Texas, is forming its own police squad.\n\nThe city’s commission approved anordinanceduring a special meeting Tuesday that would create a municipal police department, subject to approval from the Texas Commission on Law Enforcement (T",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}