{
  "last_updated": "2026-02-05T17:51:01.451627+00:00",
  "articles": [
    {
      "title": "ElevenLabs CEO: Voice is the next interface for AI",
      "link": "https://techcrunch.com/2026/02/05/elevenlabs-ceo-voice-is-the-next-interface-for-ai/",
      "author": "Rebecca Bellan",
      "date": "2026-02-05T06:41:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Web-Summit-Doha-Staniszewski-Seth-Pierrepont.png?resize=1200,657",
      "category": "AI",
      "content": "ElevenLabs co-founder and CEO Mati Staniszewski says voice is becoming the next major interface for AI – the way people will increasingly interact with machines as models move beyond text and screens.\n\nSpeaking atWeb Summit in Doha, Staniszewski told TechCrunch voice models like those developed by ElevenLabs have recently moved beyond simply mimicking human speech — including emotion and intonation – to working in tandem with the reasoning capabilities of large language models. The result, he argued, is a shift in how people interact with technology.\n\nIn the years ahead, he said, “hopefully all our phones will go back in our pockets, and we can immerse ourselves in the real world around us, with voice as the mechanism that controls technology.”\n\nThat vision fueled ElevenLabs’s$500 million raisethis week at an $11 billion valuation, and it is increasingly shared across the AI industry.OpenAIandGooglehave both made voice a central focus of their next-generation models, while Apple appears to be quietly building voice-adjacent, always-on technologies throughacquisitions like Q.ai.As AI spreads into wearables, cars, and other new hardware, control is becoming less about tapping screens and more about speaking, making voice a key battleground for the next phase of AI development.\n\nIconiq Capital general partner Seth Pierrepont echoed that view onstage at Web Summit, arguing that while screens will continue to matter for gaming and entertainment, traditional input methods like keyboards are starting to feel “outdated.”\n\nAnd as AI systems become more agentic, Pierrepont said, the interaction itself will also change, with models gaining guardrails, integrations, and context needed to respond with less explicit prompting from users.\n\nStaniszewski pointed to that agentic shift as one of the biggest changes underway. Rather than spelling out every instruction, he said future voice systems will increasingly rely on persistent memory and context built up over time, making intera",
      "excerpt": "ElevenLabs co-founder and CEO Mati Staniszewski says voice is becoming the next major interface for AI – the way people will increasingly interact with machines as models move beyond text and screens.\n\nSpeaking atWeb Summit in Doha, Staniszewski told TechCrunch voice models like those developed by E",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Spotify ventures into physical book sales, adds new audiobook features",
      "link": "https://techcrunch.com/2026/02/05/spotify-ventures-into-physical-book-sales-adds-new-audiobook-features/",
      "author": "Lauren Forristal",
      "date": "2026-02-05T04:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Spotify_Physical_Books.png?w=1200",
      "category": "Apps",
      "content": "While Spotify users faceyet another price hike, book lovers have some exciting developments to look forward to that could help cushion the blow.\n\nSpotifyannouncedseveral updates for its audiobook business on Thursday, notably its expansion into physical books. Users in the U.S. and the UK will soon be able to purchase physical copies of their favorite audiobooks directly through the app, marking a significant pivot for the once digital-only platform.\n\nThe company also introduced two features designed to make the audiobook experience smoother and more flexible, including a new tool called “Page Match” that lets users scan a page from a physical book to instantly transition to that spot in the audiobook.\n\nAdditionally, “Audiobook Recaps”—a previously iOS-only feature—is coming to Android devices in the spring. This feature provides bite-sized recaps tailored to the last section users stopped listening to.\n\n​Spotify’s decision to sell physical books through its app positions it as a competitor to major booksellers, including Amazon and Barnes & Noble. The company also recognizes that many readers still value physical books, and by offering both print and digital formats, Spotify is trying to turn itself into a one-stop shop for book lovers.\n\nSpotify has partnered withBookshop.orgon the new offering, an online marketplace that supports local, independent bookstores. This partnership is great news for indie booksellers, as every purchase made via Spotify will directly benefit local book communities. Spotify then earns an affiliate fee on sales.\n\nThe ability to purchase physical books will roll out this spring and appear on audiobook pages in the app as a button labeled “Add to your bookshelf at home.” Clicking it takes users to Bookshop’s website, which handles the pricing, inventory, and shipping.\n\nTo bridge the gap between formats, Spotify is also launching a feature called Page Match, which is currently available to premium subscribers and will roll out to all audiobo",
      "excerpt": "While Spotify users faceyet another price hike, book lovers have some exciting developments to look forward to that could help cushion the blow.\n\nSpotifyannouncedseveral updates for its audiobook business on Thursday, notably its expansion into physical books. Users in the U.S. and the UK will soon ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Data breach at govtech giant Conduent balloons, affecting millions more Americans",
      "link": "https://techcrunch.com/2026/02/05/data-breach-at-govtech-giant-conduent-balloons-affecting-millions-more-americans/",
      "author": "Zack Whittaker",
      "date": "2026-02-05T07:25:38-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/12/data-breach-2024-roundup.jpg?resize=1200,675",
      "category": "Security",
      "content": "A data breach at government technology giant Conduent appears to affect far more people than first disclosed, with the number of victims potentially stretching to dozens of millions of people across the United States.\n\nThe January 2025 ransomware attack, whichknocked out Conduent’s operations for several days, is now known to affect at least 15.4 million people in Texas alone, accounting for about half of the state’s population. Conduent said in October that 4 million people across the state were affected.\n\nAnother 10.5 million people are affected across Oregon, per the state’s attorney general.\n\nConduent has also notified hundreds of thousands of people across Delaware, Massachusetts, New Hampshire, and other states, according to data breach notifications seen by TechCrunch.\n\nThe stolen data includes individuals’ names, Social Security numbers, medical data and health insurance information.\n\nOne of the largest government contractors today, Conduent handles and processes large amounts of personal and sensitive information on behalf of large corporations, government departments, andseveral U.S. states. The companysaysits technology and operational support services reach more than 100 million people in the United States across various government healthcare programs.\n\nWhen contacted with several questions about the data breach, Conduent spokesperson Sean Collins provided a boilerplate statement that did not address the questions, nor did they answer if Conduent knows how many individuals are affected by the cyberattack. The spokesperson would not say if the breach affects more than 100 million people.\n\nCollins said that the company has been working to “conduct a detailed analysis of the affected files to identify the personal information” taken in the breach, but would not say how many data breach notifications the company has sent out to date.\n\nLittle else is known about the breach, and the company has disclosed few details. Conduentdisclosed the cyberattack in April,",
      "excerpt": "A data breach at government technology giant Conduent appears to affect far more people than first disclosed, with the number of victims potentially stretching to dozens of millions of people across the United States.\n\nThe January 2025 ransomware attack, whichknocked out Conduent’s operations for se",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fundamental raises $255 million Series A with a new take on big data analysis",
      "link": "https://techcrunch.com/2026/02/05/fundamental-raises-255-million-series-a-with-a-new-take-on-big-data-analysis/",
      "author": "Russell Brandom",
      "date": "2026-02-05T07:00:02-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/CEO_3.jpg?resize=1200,800",
      "category": "AI",
      "content": "An AI lab calledFundamentalemerged from stealth on Thursday, offering a new foundation model to solve an old problem: how to draw insights from the huge quantities of structured data produced by enterprises. By combining the old systems of predictive AI with more contemporary tools, the company believes it can reshape how large enterprises analyze their data.\n\n“While LLMs have been great at working with unstructured data, like text, audio, video, and code, they don’t work well with structured data like tables,” CEO Jeremy Fraenkel told TechCrunch. “With our model Nexus, we have built the best foundation model to handle that type of data.”\n\nThe idea has already drawn significant interest from investors. The company is emerging from stealth with $255 million in funding at a $1.2 billion valuation. The bulk of it comes from the recent $225 million Series A round led by Oak HC/FT, Valor Equity Partners, Battery Ventures, and Salesforce Ventures; Hetz Ventures also participated in the Series A, with angel funding from Perplexity CEO Aravind Srinivas, Brex co-founder Henrique Dubugras, and Datadog CEO Olivier Pomel.\n\nCalled a Large Tabular Model (LTM) rather than a Large Language Model (LLM), Fundamental’s Nexus breaks from contemporary AI practices in a number of significant ways. The model is deterministic — that is, it will give the same answer every time it is asked a given question — and doesn’t rely onthe transformer architecturethat defines models from most contemporary AI labs. Fundamental calls it a foundation model because it goes through the normal steps of pre-training and fine-tuning, but the result is something profoundly different from what a client would get when partnering with OpenAI or Anthropic.\n\nThose differences are important because Fundamental is chasing a use-case where contemporary AI models often falter. Because Transformer-based AI models can only process data that’s within their context window, they often have trouble reasoning over extremely ",
      "excerpt": "An AI lab calledFundamentalemerged from stealth on Thursday, offering a new foundation model to solve an old problem: how to draw insights from the huge quantities of structured data produced by enterprises. By combining the old systems of predictive AI with more contemporary tools, the company beli",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Substack confirms data breach affects users’ email addresses and phone numbers",
      "link": "https://techcrunch.com/2026/02/05/substack-confirms-data-breach-affecting-email-addresses-and-phone-numbers/",
      "author": "Ivan Mehta",
      "date": "2026-02-05T06:55:02-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/05/substack-on-a-phone.jpg?resize=1200,800",
      "category": "Security",
      "content": "Newsletter platform Substack has confirmed a data breach in an email to users. The company said that in October, an “unauthorized third party” accessed user data, including email addresses, phone numbers, and other unspecified “internal metadata.”\n\nSubstack specified that more sensitive data, such as credit card numbers, passwords, and other financial information, was unaffected.\n\nIn an email sent to users, Substack chief executive Chris Best said that the company identified the issue in February that allowed someone to access its systems. Best said that the company has fixed the problem and started an investigation.\n\n“I’m reaching out to let you know about a security incident that resulted in the email address and phone number from your Substack account being shared without your permission,” said Best in the email to users. “I’m incredibly sorry this happened. We take our responsibility to protect your data and your privacy seriously, and we came up short here.”\n\nIt’s not clear what exactly the issue was with its systems, and the scope of the data that was accessed. It’s also not yet known why the company took five months to detect the breach, or if the company was contacted by hackers demanding a ransom. TechCrunch asked the company for more details, and we will update our story if we hear back.\n\nSubstack did not say how many users are affected. The company said that it doesn’t have any evidence that users’ data is being misused, but did not say what technical means, such as logs, it has to detect evidence of abuse. However, the company asked users to take caution with emails and texts without any particular indicators or direction.\n\nOn its website, Substack says that its site has more than 50 million active subscriptions, including 5 million paid subscriptions — a milestoneit reached last March. In July 2025, the company raised$100 million in Series C fundingled by BOND and The Chernin Group (TCG) with participation from a16z, Klutch Sports Group CEO Rich Paul, a",
      "excerpt": "Newsletter platform Substack has confirmed a data breach in an email to users. The company said that in October, an “unauthorized third party” accessed user data, including email addresses, phone numbers, and other unspecified “internal metadata.”\n\nSubstack specified that more sensitive data, such a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Alphabet won’t talk about the Google-Apple AI deal, even to investors",
      "link": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/",
      "author": "Sarah Perez",
      "date": "2026-02-04T15:28:31-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/imgi_38_mp840x830mattef8f8f8t-pad1000x1000f8f8f8.jpg?w=1000",
      "category": "AI",
      "content": "Alphabet declined to answer one of its investors during questions about Google’s AI deal with Apple on Wednesday’s fourth-quarter earnings call. Instead of responding to an analyst’s question about how the tech giant is thinking about AI partnerships, such as the one with Apple to power AI for Siri, the question was completely ignored.\n\nThat decision tells us something, though — Alphabet isn’t ready to talk about how this partnership will impact its core business, which is increasingly focused on AI.\n\nOver the years, the Google-Apple relationship has been mutually beneficial. The two companies’ search partnership saw the search giant paying the iPhone maker$20 billionto be the default search engine on Apple devices,filingsfrom the Department of Justice’s lawsuit against the search giant revealed. In turn, Google gained access to Apple’s massive customer base — the iPhone maker last quarterannouncedit has 2.5 billion active devices worldwide, to give you an idea of scale.\n\nThe latest Apple AI deal isrumored to cost Apple roughly $1 billion per year, but the payoff beyond that for Google isn’t as immediately obvious as it is with search. In Google Search, consumers see links to advertisers’ websites at the top of their search results. Ads in AI Mode, which could one day represent the future of Google’s search business, are still an “experiment” for now.\n\nThe company firstannouncedlast May that it would bring ads to AI Mode, the chatbot-style interface for Google Search, but these tests see the ads’ placement below or integrated into the chatbot’s responses. Google is also trying outagentic shopping,including Shop with AI Mode, to guide consumers with product-related queries to a seamless checkout experience from the AI interface.\n\nMeanwhile, Google’s AI competitor Anthropic is taking aim at ad-supported AI withits forthcoming Super Bowl ad,which challenges the business model being adopted by ChatGPT maker OpenAI and Google.\n\nHow this will all play out longer-term is s",
      "excerpt": "Alphabet declined to answer one of its investors during questions about Google’s AI deal with Apple on Wednesday’s fourth-quarter earnings call. Instead of responding to an analyst’s question about how the tech giant is thinking about AI partnerships, such as the one with Apple to power AI for Siri,",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Sam Altman got exceptionally testy over Claude Super Bowl ads",
      "link": "https://techcrunch.com/2026/02/04/sam-altman-got-exceptionally-testy-over-claude-super-bowl-ads/",
      "author": "Julie Bort",
      "date": "2026-02-04T16:45:11-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/Sam-Altman-OpenAI-DSC02881.jpg?resize=1200,800",
      "category": "AI",
      "content": "Anthropic’s Super Bowl commercial, one of four ads the AI lab droppedon Wednesday, begins with the word “BETRAYAL” splashed boldly across the screen. The camera pans to a man earnestly asking a chatbot (obviously intended to depict ChatGPT) for advice on how to talk to his mom.\n\nThe bot, portrayed by a blonde woman, offers some classic bits of advice. Start by listening. Try a nature walk! And then twists into an ad for a fictitious (we hope!) cougar-dating site called Golden Encounters. Anthropic finishes the spot by saying that while ads are coming to AI, they won’t be coming to its own chatbot, Claude.\n\nAnother commercialfeatures a slight young man looking for advice on building a six pack. After offering his height, age, and weight, the bot serves him an ad for height-boosting insoles.\n\nThe Anthropic commercials are cleverly aimed at OpenAI’s users, after that company’srecent announcementthat ads will be coming to ChatGPT’s free tier. And they caused an immediate stir, spawning headlines that Anthropic“mocks,”“skewers,”and“dunks on”OpenAI.\n\nThey are funny enough that even Sam Altmanadmitted on Xthat he laughed at them. But he clearly didn’t really find them funny. They inspired him to write a novella-sized rant that devolved into calling his rival “dishonest” and “authoritarian.”\n\nFirst, the good part of the Anthropic ads: they are funny, and I laughed.But I wonder why Anthropic would go for something so clearly dishonest. Our most important principle for ads says that we won’t do exactly this; we would obviously never run ads in the way Anthropic…\n\nIn that post, Altman explains that an ad-supported tier is intended to shoulder the burden of offering free ChatGPT to many of its millions of users. ChatGPTis still the most popular chatbot by a large margin.\n\nBut the OpenAI CEO insisted the ads were “dishonest” in implying that ChatGPT will twist a conversation to insert an ad (and possibly for an off-color product, to boot).”We would obviously never run ads in the",
      "excerpt": "Anthropic’s Super Bowl commercial, one of four ads the AI lab droppedon Wednesday, begins with the word “BETRAYAL” splashed boldly across the screen. The camera pans to a man earnestly asking a chatbot (obviously intended to depict ChatGPT) for advice on how to talk to his mom.\n\nThe bot, portrayed b",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meet Gizmo: A TikTok for interactive, vibe-coded mini apps",
      "link": "https://techcrunch.com/2026/02/04/meet-gizmo-a-tiktok-for-interactive-vibe-coded-mini-apps/",
      "author": "Sarah Perez",
      "date": "2026-02-04T13:45:32-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/gizmo-app.jpg?resize=1200,764",
      "category": "Apps",
      "content": "Gizmo, a TikTok-like app for vibe-coded mini applications, is offering a new way to create interactive media. The relatively new mobile app from the startupAtma Scienceslets anyone create experiences using text, photos, sound, and touch, which are then displayed in a vertical feed, similar to TikTok or Reels. But unlike traditional short-form video apps, you don’t just watch and scroll in Gizmo — you play.\n\nDepending on the type of “Gizmo” you encounter, you might poke the screen, swipe, tap, draw, drag, and more to interact with the mini app. These Gizmos aren’t just games but are more like digital toys — things that could include interactive puzzles, memes, art, animation, or anything else a creator can dream up.\n\nThe result is an engaging, playful feed, where you can like and comment on the tiny creations and even remix existing Gizmos to create your own version, if you choose.\n\nWhat’s more, you don’t need to know how to code or even vibe code to get started. Instead, you can simply type out an AI prompt to explain your idea using natural language.\n\nThe app then leverages AI coding technology to turn your idea into an interactive experience by generating the code that makes it work. As part of this process, Gizmo will also render your idea visually to ensure that each app functions properly and runs smoothly. Apps are also vetted using AI and human moderation to ensure user safety, a companyFAQnotes.\n\nEvery post on gizmo is a mini app#brainrot#robloxmemes#lebronjamesedit\n\nGizmo hails from a New York-based startup calledAtma Sciences, co-founded by Rudd Fawcett and Brandon Francis, along with CEO Josh Siegel and CTO Daniel Amitay. The company last year raised a $5.49 million seed round from First Round Capital and others, according to data fromPitchBook. On the company’s website (which is also silly and interactive), the team explains their focus is on combining “powerful technology with simple, elegant foundations,” starting with their creativity app, Gizmo.\n\nNon",
      "excerpt": "Gizmo, a TikTok-like app for vibe-coded mini applications, is offering a new way to create interactive media. The relatively new mobile app from the startupAtma Scienceslets anyone create experiences using text, photos, sound, and touch, which are then displayed in a vertical feed, similar to TikTok",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Secondary sales shift from founder windfalls to employee-retention tools",
      "link": "https://techcrunch.com/2026/02/05/secondary-sales-shift-from-founder-windfalls-to-employee-retention-tools/",
      "author": "Marina Temkin",
      "date": "2026-02-05T09:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/03/GettyImages-1481700067.jpg?resize=1200,821",
      "category": "Venture",
      "content": "In May, AI sales automation startup Clay said it was allowing most of its employees to sell some of their shares at a$1.5 billion valuation. Coming just months after its Series B, Clay’s offer of liquidity was a rarity in a market where tender offers, as these types of secondary transactions are known, were still uncommon for relatively young companies.\n\nSince then, several other newer, fast-growing startups have allowed their staff to convert some of their stock into cash. Linear, a six-year-old AI-powered Atlassian rival, completeda tender offerat the same valuation as the company’s $1.25 billion Series C. More recently, the three-year-old ElevenLabs authorized a $100 million secondary sale for staff, at a valuation of$6.6 billion,doubleits previous value.\n\nAnd just last week, Clay, which has tripled its annual recurring revenue (ARR) to $100 million in one year, decided it was again time for its employees to cash in on the company’s fast growth. The eight-year-old startup announced that its staff can sell stock at a valuation of$5 billion, a more than 60% increase from its$3.1 billionvaluation announced in August.\n\nThese secondary sales at increasingly higher valuations for young, perhaps still-unproven companies may initially appear to be a premature “cash out” reminiscent of the 2021 bubble. The most infamous example of that time was Hopin, whose founder, Johnny Boufarhat, reportedly sold $195 million worth of his company’s stock just two years before the company’s assets were sold for atiny fractionof its peak$7.7 billionvaluation.\n\nBut there is a critical distinction between the 2021 boom and today’s market.\n\nDuring the ZIRP era, a large portion of the secondary deals provided liquidity almost exclusively to founders of buzzy companies like Hopin. In contrast, the recent transactions from Clay, Linear, and ElevenLabs are structured as tender offers that also benefit employees.\n\nWhile investors these days largely frown upon the outsized founder payouts of the ",
      "excerpt": "In May, AI sales automation startup Clay said it was allowing most of its employees to sell some of their shares at a$1.5 billion valuation. Coming just months after its Series B, Clay’s offer of liquidity was a rarity in a market where tender offers, as these types of secondary transactions are kno",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta tests a standalone app for its AI-generated ‘Vibes’ videos",
      "link": "https://techcrunch.com/2026/02/05/meta-tests-a-standalone-app-for-its-ai-generated-vibes-videos/",
      "author": "Aisha Malik",
      "date": "2026-02-05T09:19:01-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=1024",
      "category": "Apps",
      "content": "Meta is testing a standalone Vibes app, the company confirmed to TechCrunch on Thursday. Launched last September,Vibeslets you create and share short-form AI-generated videos and access a dedicated feed that displays AI videos from others.\n\nThink TikTok or Instagram Reels, but every single video you come across is AI-generated. Until now, the feed has lived in the Meta AI app. By making Vibes available outside of the Meta AI app, the company is positioning it as a more direct competitor toSora, OpenAI’s AI-generated video and social appthat launched shortly after Vibes.\n\n“Following the strong early traction of Vibes within Meta AI, we are testing a standalone app to build on that momentum,” Meta said in an emailed statement. “We’ve seen that users are increasingly leaning into the format to create, discover, and share AI-generated video with friends. This standalone app provides a dedicated home for that experience, offering people a more focused and immersive environment. We will look to expand the app further based on what we learn from the community.”\n\nThe news was first reported byPlatformer.\n\nMeta says it doesn’t share specific numbers, but claims Vibes has performed well, with Meta AI usage continuing to grow steadily since its launch, which it believes signals demand for a standalone app.\n\nThe tech giant also notes that while users engage with content in Meta AI, a standalone app allows for a more focused experience for creation and engagement.\n\nVibes lets users generate a video from scratch or remix a video that they see on their feed. Before publishing, you can add new visuals, layer in music, and adjust styles. You can then post the video directly to the Vibes feed, DM it to others, or cross-post to Instagram and Facebook Stories and Reels.\n\nMeta says collaboration and sharing are on the rise, with many Vibes videos being messaged to friends, which the company says mirrors how people use Reels.\n\nIt’s worth noting thatMeta told TechCrunchlast week that, in ",
      "excerpt": "Meta is testing a standalone Vibes app, the company confirmed to TechCrunch on Thursday. Launched last September,Vibeslets you create and share short-form AI-generated videos and access a dedicated feed that displays AI videos from others.\n\nThink TikTok or Instagram Reels, but every single video you",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}