{
  "last_updated": "2026-02-24T17:57:06.461721+00:00",
  "articles": [
    {
      "title": "It’s time to pull the plug on plug-in hybrids",
      "link": "https://techcrunch.com/2026/02/24/its-time-to-pull-the-plug-on-plug-in-hybrids/",
      "author": "Tim De Chant",
      "date": "2026-02-24T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/porsche-cayenne-plug-in-hybrid.jpg?resize=1200,676",
      "category": "Transportation",
      "content": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’ onboard computers shows that’s often not the case.\n\nUsing that data, the Fraunhofer Institute could determine how much of that energy came from charging when plugged in. Itfound thatless than a third of 1 million PHEVs in Germany plugged in either occasionally or not at all.\n\nU.S. automakers that are pushing future PHEV models as appealing alternatives for American drivers should take note. By blending gas with electricity, these automakers hope to boost fleet-wide efficiency without a wide rollout of EVs.\n\n“We’re looking to make CO2reductions across our lineup, but we’re doing it in a very efficient way,” Ford CEO Jim Farleysaid this monthin an earnings call.\n\nYet the new study shows that PHEVs seldom deliver on their efficiency promises.\n\nAt best, Toyota drivers used electricity for 44% of the energy used for driving, suggesting they plugged in the most frequently. The worst? Porsche drivers, at just 0.8%, an average of 7 kilowatt-hours over two years. In other words, the average Porsche PHEV driver charged their battery less than 50% of its capacity — once.\n\nStudies have previously shown that PHEVs produce about3.5 times more emissionsthan their official ratings would suggest. This new study explains why since it directly assesses how much electricity the vehicles gained from charging. (PHEVs, like all hybrids, can operate in a mixed mode, using both gas and electricity. The study used data straight off the vehicles to disentangle the two.)\n\nOne of PHEV’s many shortcomings are their anemic batteries, capable of powering the vehicle for short distances. Some can only traverse a handful of miles, while many sold in recent years can operate on battery power for about 20 to30 miles. Regulators in Europe and automakers have been proposing longer ranges for future models, hoping that a more capable battery will encourage people to charge their batteries more frequently.\n\nThat’s not guaranteed, though. The vehicles are likely to remain compromised when driving on electrons. That’s because most PHEVs are based on fossil fuel platforms — the electric motors and power electronics aren’t capable of delivering 100% of the vehicle’s power needs. When a driver floors it, the gas engine has to kick in. In other vehicles, the engine turns on in cold weather to heat the cabin. When that happens, “why bother plugging in” is apparently a question most PHEV drivers have asked themselves.\n\nWhich raises another question: why bother with PHEVs at all?\n\nPHEVs have been touted as a way to ease cautious consumers into full EVs. The argument goes something like this: Drivers will become habituated with plugging in while EV charging networks are built out. By the time they’re ready for their next vehicle, the networks will be ready and customers can ease into an EV.\n\nBut if nobody is plugging in their PHEVs, they’re definitely not developing the habit. Without full charges, the electric drivetrain isn’t benefitting anyone. The public still suffer from worse air pollution; and drivers are carting around hundreds of pounds of weight and enduringmore recallsand costlier service visits as a result of the complex drivetrain.\n\nTweaking the PHEV formula to make them more reliant on batteries could help. The interim solution is called an extended-range electric vehicle (EREV), and it’s designed to run on battery power until the charge is depleted, at which point the fossil fuel engine recharges it. So far, no EREV has required the owner to plug in — they could easily drive the vehicle for its lifetime on gas. BMW used to make an EREV in the i3, but it stopped production years ago. Ford and Stellantis have both announced EREV pickup trucks, which have yet to go on sale.\n\nMeanwhile, EV charging networkscontinue to expand. It’s possible that by the time automakers are making PHEVs and EREVs in large quantities, drivers will no longer need a comfort blanket in the form of a gas engine. (My household came to that conclusion two years ago. After a decade split between a BMW i3 EREV and a Chrysler Pacifica Hybrid PHEV, we traded up for a Kia EV9.)\n\nLegacy automakers, which have second guessed their electrification strategies more times than I care to count, could be forced to change tacks once more.\n\nPHEVs might have been a nifty solution on paper, but they’ve failed to deliver in the real world.",
      "excerpt": "Plug-in hybrid vehicles are often touted as a bridge to battery-electric vehicles, promising to slash emissions by operating as EVs for short trips while relying on fossil fuels for longer ones.\n\nThey only deliver on that promise if they’re regularly charged. Real-world data drawn from the vehicles’",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Conduent data breach grows, affecting at least 25M people",
      "link": "https://techcrunch.com/2026/02/24/conduent-data-breach-grows-affecting-at-least-25m-people/",
      "author": "Zack Whittaker",
      "date": "2026-02-24T06:09:11-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/conduent-630849206.jpg?w=1024",
      "category": "Security",
      "content": "The spillover from a ransomware attack on one of the largest government contractors in the United Stateskeeps getting bigger: more than 25 million people have now had personal data stolen in the hack.\n\nConduent provides printing, mailroom services, and document and payment processing services for state government benefit operations, such as food assistance, as well as workplace and unemployment benefits for large corporations. As such, the company handles a large amount of personal information belonging to a large swath of the United States. Conduentsaysits technology and operational support services reach more than 100 million people.\n\nBut since the January 2025 cyberattack attack, which a ransomware group claimed credit for, the corporate giant has said little about the data breach, such as how it was caused and how many people are affected.\n\nAn update tothe state of Wisconsin’s data breach notification pagenow shows the Conduent breach affects at least 25 million people across the United States.\n\nTechCrunch’s ongoing tally from various data breach notification letters that we have seen also amounts to about 25 million people, with Oregon (10.5 million) and Texas (15.4 million) accounting for the majority of those affected. Other data breach notices seen by TechCrunch include another few hundred thousand individuals across Massachusetts, New Hampshire and Washington.\n\nThe breach is known to have compromised individuals’ names, dates of birth, addresses, Social Security numbers, health insurance information, and medical data.\n\nConduent has said little outside of its data breach notifications, and in some cases has made it more difficult for affected individuals to learn about the breach.\n\nA page on Conduent’s website, titled“Incident Notice”that was published in October 2025 at the same time as its first data breach notification, does not explicitly mention a cybersecurity incident. The page contains a hidden “noindex” tag in its source code, which tells search engines to not list the page in search results, making it difficult for anyone searching the web to find it.\n\nWhen reached by TechCrunch, Conduent spokesperson Sean Collins would not say how many notifications the company has sent to date, or why the company is hiding its incident notice from search engines.\n\nConduent’s breach has been billed as one of the “largest ever,” but likely trails behind the Change Healthcare hack, whichaffected more than 190 million peoplefollowing a ransomware attack in February 2024. A Russian-speaking ransomware gang stole reams of health and medical data from Change Healthcare using astolen credentialthat wasn’t protected with multi-factor authentication, prompting the healthcare tech giant to pay at least two ransoms to keepmost of the stolen dataoff the internet.",
      "excerpt": "The spillover from a ransomware attack on one of the largest government contractors in the United Stateskeeps getting bigger: more than 25 million people have now had personal data stolen in the hack.\n\nConduent provides printing, mailroom services, and document and payment processing services for st",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Waymo robotaxis are now operating in 10 US cities",
      "link": "https://techcrunch.com/2026/02/24/waymo-robotaxis-are-now-operating-in-10-us-cities/",
      "author": "Kirsten Korosec",
      "date": "2026-02-24T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-GettyImages.jpg?resize=1200,796",
      "category": "Transportation",
      "content": "Waymo is opening its robotaxi services to the public in Dallas, Houston, San Antonio, and Orlando, as the Alphabet-owned autonomous vehicle company quickens its pace of expansion.\n\nWaymo’s rollout will mimic its public launches in previous cities. Select riders who have downloaded the Waymo app will receive an invitation to take their first rides, starting Tuesday. New riders will be added on a rolling basis, and eventually anyone who downloads the app will be able to hail a ride.\n\nThe addition of the new cities adds a striking dimension to Waymo’s fast-paced push to expand. Last February, Waymo was operating commercial robotaxi services in Phoenix and some of its surrounding suburbs, parts of Los Angeles, and San Francisco. At the time, Alphabet CEO Sundar Pichai said Waymo was providingmore than 200,000 ridesevery week.\n\nOver the past 12 months, Waymo has expanded in its existing markets, particularly in San Francisco, where its service area nowstretches down Highway 101through numerous towns, all the way to San Jose. It now has access to three airports, includingSan Francisco International. It has launched a service inpartnership with Uberin Atlanta and Austin. It has expanded its operating domainto freewaysin three cities. And last month it opened its robotaxi service to the publicin Miami.\n\nWaymo tends to hold back on its latest ridership numbers. The last time it provided an update, Waymo said it was providing more than400,000rides per week, though the actual number is likely higher by now.\n\nWaymo doesn’t appear to be slowing down, either. It is planning to launch robotaxi services in several more cities this year, including Denver,London, and Washington, D.C., to name a few. And it is now armed with an additional$16 billionraised in round led by Dragoneer Investment Group, DST Global, and Sequoia Capital that values Waymo at $126 billion.\n\nWaymo currently has a fleet of about 3,000 robotaxis that are spread across its six markets of Atlanta, Austin, Los Angeles, Miami, Phoenix, and the San Francisco Bay Area. That fleet size will likely grow with the addition of these four new cities, but don’t expect it to balloon immediately.\n\nWaymo spokesperson Chris Bonelli said it will have dozens of vehicles to start in these cities, and will scale up in coordination with riders over the coming months.\n\nThe company’s workforce will also scale alongside this expansion. The staff who monitor the robotaxis and respond to specific requests for information from the Waymo self-driving system — for instance, if a robotaxi encounters a tricky scenario on public roads — may expand, although Waymo wouldn’t share specifics. The company said only that it has an extensive planning process to ensure that its operations are right-sized to its scale as it grows. Waymo recently revealed it employs about 70 of these workers, whom it describes as remote assistance workers, or RAs.\n\nAll of this is pushing toward a lofty goal Waymo co-CEO Tekedra Mawakana laid out last year — and one that hasn’t changed even as the company faces increased scrutiny and investigations by safety regulators. The National Highway Traffic Safety Administration opened an investigation after one of Waymo’s robotaxis last monthstruck a childat 6 miles per hour near a school in Santa Monica. The National Transportation Safety Board is also examining how Waymo robotaxisbehave around school buses.\n\n“Waymo is serving more riders than ever, as we are on track to serve over one million rides per week by the end of this year,” said Mawakanasaid in a blog postTuesday, adding that the company is laying the groundwork for robotaxi service in more than 20 cities.",
      "excerpt": "Waymo is opening its robotaxi services to the public in Dallas, Houston, San Antonio, and Orlando, as the Alphabet-owned autonomous vehicle company quickens its pace of expansion.\n\nWaymo’s rollout will mimic its public launches in previous cities. Select riders who have downloaded the Waymo app will",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Meta AI security researcher said an OpenClaw agent ran amok on her inbox",
      "link": "https://techcrunch.com/2026/02/23/a-meta-ai-security-researcher-said-an-openclaw-agent-ran-amok-on-her-inbox/",
      "author": "Julie Bort",
      "date": "2026-02-23T16:57:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Y-Combinator-Crab.png?resize=1200,829",
      "category": "AI",
      "content": "Thenow-viral X postfrom Meta AI security researcher Summer Yue reads, at first, like satire. She told her OpenClaw AI agent to check her overstuffed email inbox and suggest what to delete or archive.\n\nThe agent proceeded to run amok. It started deleting all her email in a “speed run” while ignoring her commands from her phone telling it to stop.\n\n“I had to RUN to my Mac mini like I was defusing a bomb,” she wrote, posting images of the ignored stop prompts as receipts.\n\nThe Mac Mini, an affordable Apple computer that sits flat on a desk andfits in the palm of your hand, has become the favored device these days for running OpenClaw. (The Mini is selling “like hotcakes,” one “confused” Apple employee apparently toldfamed AI researcher Andrej Karpathywhen he bought one to run an OpenClaw alternative called NanoClaw.)\n\nOpenClawis, of course, the open source AI agent that achieved fame through Moltbook, an AI-only social network. OpenClaw agents were at the center of thatnow largely debunked episodeon Moltbook in which it looked like the AIs were plotting against humans.\n\nBut OpenClaw’s mission, according to itsGitHub page, is not focused on social networks. It aims to be a personal AI assistant that runs on your own devices.\n\nThe Silicon Valley in-crowd has fallen so in love with OpenClaw that “claw” and “claws” have become thebuzzwords of choicefor agents that run on personal hardware. Other such agents includeZeroClaw,IronClaw, andPicoClaw. Y Combinator’s podcast team even appeared on theirmost recent episodedressed in lobster costumes.\n\nBut Yue’s post serves as a warning. As others on X noted, if an AI security researcher could run into this problem, what hope do mere mortals have?\n\n“Were you intentionally testing its guardrails or did you make a rookie mistake?” a software developer asked her on X.\n\n“Rookie mistake tbh,” she replied. She had been testing her agent with a smaller “toy” inbox, as she called it, and it had been running well on less important email. It had earned her trust, so she thought she’d let it loose on the real thing.\n\nYue believes that the large amount of data in her real inbox “triggered compaction,” she wrote. Compaction happens when the context window — the running record of everything the AI has been told and has done in a session — grows too large, causing the agent to begin summarizing, compressing, and managing the conversation.\n\nAt that point, the AI may skip over instructions that the human considers quite important.\n\nIn this case, it may have skipped her last prompt — where she told it not to act — and reverted back to its instructions from the “toy” inbox.\n\nAs several otherson X pointed out,prompts can’t be trustedto act as security guardrails. Models may misconstrue or ignore them.\n\nVarious people offered suggestions that ranged from the exact syntax Yue should have used to stop the agent, to various methods to ensure better adherence to guardrails, like writing instructions to dedicated files or using other open source tools.\n\nIn the interest of full transparency, TechCrunch could not independently verify what happened to Yue’s inbox. (She didn’t respond to our request for comment, though she did respond to many questions and comments sent her way on X.)\n\nBut it doesn’t really matter.\n\nThe point of the tale is that agents aimed at knowledge workers, at their current stage of development, are risky. People who say they are using them successfully are cobbling together methods to protect themselves.\n\nOne day, perhaps soon (by 2027? 2028?), they may be ready for widespread use. Goodness knows many of us would love help with email, grocery orders, and scheduling dentist appointments. But that day has not yet come.",
      "excerpt": "Thenow-viral X postfrom Meta AI security researcher Summer Yue reads, at first, like satire. She told her OpenClaw AI agent to check her overstuffed email inbox and suggest what to delete or archive.\n\nThe agent proceeded to run amok. It started deleting all her email in a “speed run” while ignoring ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Uber wants to be a Swiss Army Knife for robotaxis",
      "link": "https://techcrunch.com/2026/02/23/uber-autonomous-solutions-av-robotaxi-delivery-robots/",
      "author": "Kirsten Korosec",
      "date": "2026-02-23T11:54:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/uber-lucid.jpg?resize=1200,801",
      "category": "Transportation",
      "content": "Uber has a pitch for autonomous vehicle makers: we got this.\n\nThe ride-hailing and food delivery company has launched a new division called Uber Autonomous Solutions designed to take on all the tasks associated with operating a robotaxi, self-driving truck, or sidewalk delivery robot business, including software and support services.\n\nThe initiative, announced Monday, formalizes what Uber has been not so quietly working on for several years now.\n\nUber has amassed partnerships with nearly two dozen autonomous vehicle technology companies across every use case, from robotaxis and trucking to sidewalk delivery robots and drones. Uber has backed many of these companies —Lucid and Nuro,Waabi, and China’sWeRide— invested $100 million to build fast-charging, autonomous-vehicle charging stations, and even launchedUber AV Labs, a specialized engineering team that will gather data for robotaxi partners.\n\nUber has made the partnerships and investments; now it wants to make itself indispensable.\n\n“AV tech teams should be able to focus on what they do best: building software that can safely power an autonomous world,” said Sarfraz Maredia, Uber’s global head of autonomous mobility and delivery, who will be leading the initiative. The idea, he said, is to add “operational depth wherever they need it,” including demand generation, rider experience, customer support, or managing the day-to-day fleet operations.\n\nThe end goal is to help these companies reduce their costs per mile and increase the speed to market. Uber said it plans to help these partners scale robotaxi deployments tomore than 15 cities by the end of this year.\n\n“What’s going to determine the success or failure of autonomous in the world is whether it can be commercialized, and Uber is going to be the thing that makes autonomy commercially viable,” Uber President and COO Andrew MacDonald said.\n\nFor Uber that means handling infrastructure like training data and mapping, fleet financing, regulatory services, and managing how robotaxis and other AVs navigate complex events and venues. The company said it is using a fleet of specially equipped Lucid vehicles to collect data that can be shared with partners so they can train their AI systems.\n\nThe new division also plans to tackle user experience, including customer support. Notably, Uber wants to take over fleet management, which would include remote assistance — an issue that recently received attention from federal lawmakers over concernsWaymo uses workers overseas. Fleet management would also cover insurance and employing the humans who might need to support these AVs when they’re out in the world.\n\nUber’s move is both existential and opportunistic. The company sold its in-house AV development unit known as Uber ATG in 2020, following two years of internal struggles and pressure after one of its test vehicles killed a pedestrian. (Uber sold off the division in acomplex deal with Aurora.)\n\nIt has tried to shore up its position through partnerships and investments. And there have been plenty. Uber and Waymo have a shared robotaxi service in Atlanta and Austin. The company has also locked up partnerships with Chinese firms Baidu, Momenta, and Pony.ai, sidewalk delivery bot companies Cartken, Starship, and Serve, and the U.K.-based automated driving tech startup Wayve, as well as robotaxi developers AVride and Motional, to name a few. It has plans to launch a robotaxi service with Volkswagen in Los Angeles by the end of 2026 — although it won’t be driverless until 2027.\n\nThese do provide Uber with some protection, but it doesn’t provide a replacement to any revenue lost if these companies erode its own ride-hailing and food delivery business that is today powered by human drivers. Uber is hoping this new division will.\n\nLoading the player…",
      "excerpt": "Uber has a pitch for autonomous vehicle makers: we got this.\n\nThe ride-hailing and food delivery company has launched a new division called Uber Autonomous Solutions designed to take on all the tasks associated with operating a robotaxi, self-driving truck, or sidewalk delivery robot business, inclu",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Americans are destroying Flock surveillance cameras",
      "link": "https://techcrunch.com/2026/02/23/americans-are-destroying-flock-surveillance-cameras/",
      "author": "Zack Whittaker",
      "date": "2026-02-23T10:49:49-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/flock-camera-2259453437.jpg?resize=1200,862",
      "category": "Security",
      "content": "Brian Merchant, writing forBlood in the Machine, reports that people across the United States are dismantling and destroying Flock surveillance cameras, amid rising public anger that the license plate readers aid U.S. immigration authorities and deportations.\n\nFlock is the Atlanta-based surveillance startupvalued at $7.5 billion a year agoand a maker of license plate readers. It has faced criticism for allowing federal authorities access to its massive network of nationwide license plate readers and databases at a time when U.S. Immigration and Customs Enforcement is increasinglyrelying on datato raid communities as part of the Trump administration’s immigration crackdown.\n\nFlock cameras allow authorities to track where people go and when by taking photos of their license plates from thousands of cameras located across the United States. Flock claims it doesn’t share data with ICE directly, but reports show that local police have shared their own access to Flock cameras and its databases with federal authorities.\n\nWhile some communities are calling on their cities toend their contracts with Flock, others are taking matters into their own hands.\n\nMerchant reports instances of broken and smashed Flock cameras in La Mesa, California, just weeks after the city council approved the continuation of Flock cameras deployed in the city, despite a clear majority of attendees favoring their shutdown. Alocal reportcited strong opposition to the surveillance technology, with residents raising privacy concerns.\n\nOther cases of vandalism have stretched from California and Connecticut to Illinois and Virginia. InOregon, six license plate-scanning cameras on poles were cut down and at least one spray-painted. A note left at the base of the severed poles said, “Hahaha get wrecked ya surveilling fucks,”reports Merchant.\n\nAccording toDeFlock, a project aimed at mapping license plate readers, there are close to 80,000 cameras across the United States. Dozens of cities have so far rejected the use of Flock’s cameras, and some police departments havesince blockedfederal authorities from using their resources.\n\nA Flock spokesperson did not say, when reached by TechCrunch, if the company keeps track of how many cameras have been destroyed since being deployed.",
      "excerpt": "Brian Merchant, writing forBlood in the Machine, reports that people across the United States are dismantling and destroying Flock surveillance cameras, amid rising public anger that the license plate readers aid U.S. immigration authorities and deportations.\n\nFlock is the Atlanta-based surveillance",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Tesla’s battle with the California Department of Motor Vehicles isn’t over after all",
      "link": "https://techcrunch.com/2026/02/23/teslas-battle-with-the-california-department-of-motor-vehicles-isnt-over-after-all/",
      "author": "Kirsten Korosec",
      "date": "2026-02-23T16:36:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/tesla-california-getty.jpg?resize=1200,831",
      "category": "",
      "content": "Tesla has filed a lawsuit against the California Department of Motor Vehicles in an attempt to overturn an agency ruling. The state DMV ruled that Tesla used deceptive marketing to overstate the automated driving capabilities of its vehicles, thereby violating state law.\n\nThe lawsuit reignites an issue that appeared to be resolved last week when the DMV said itwould notsuspend Tesla’s sales and manufacturing licenses for 30 days. This was because the EV maker complied with the ruling and stopped using the term “Autopilot” in its California marketing materials. CNBC was first toreport the lawsuit.\n\nThe DMV could have taken action against Tesla. It chose not to even though an administrative law judge agreed with the DMV’s request to suspend Tesla’s licenses for 30 days as a penalty. Instead of pulling its licenses, the state regulator gave Tesla 60 days to comply.\n\nAnd Tesla did, although in the most extreme ways. Tesla didn’t just stop using the term Autopilot; in January itdiscontinued Autopilotaltogether in the U.S. and Canada. Perhaps it regrets that decision and is looking for a way to bring it back.",
      "excerpt": "Tesla has filed a lawsuit against the California Department of Motor Vehicles in an attempt to overturn an agency ruling. The state DMV ruled that Tesla used deceptive marketing to overstate the automated driving capabilities of its vehicles, thereby violating state law.\n\nThe lawsuit reignites an is",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "5 days left to lock in the lowest TechCrunch Disrupt 2026 ticket rates",
      "link": "https://techcrunch.com/2026/02/23/5-days-left-to-lock-in-the-lowest-techcrunch-disrupt-2026-ticket-rates/",
      "author": "TechCrunch Events",
      "date": "2026-02-23T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/TCD26_5Days-16X9-Dark.png?resize=1200,675",
      "category": "Startups",
      "content": "We are officially down to the final 5 days tosave up to $680on yourTechCrunch Disrupt 2026ticket. These lowest rates of the year disappear on February 27 at 11:59 p.m. PT.\n\nIf you’ve been mapping out your 2026 tech event calendar, this isn’t the moment to wait.Register now to lock in your savings before prices increase.\n\nEach year,Disruptbrings together 10,000+ founders, tech leaders, and VCs at San Francisco’s Moscone West. From October 13–15, you’ll gain valuable takeaways and curated networking opportunities designed to elevate your startup trajectory, accelerate your career, or strengthen your portfolio.\n\nLast year, Disrupt featured 200+ onstage conversations with 250+ top voices shaping the tech ecosystem. Expect the same level of powerful, candid conversations this year. Highlights from 2025 include the following:\n\nKeep an eye on theevent pageas we roll out the 2026 agenda.\n\nLast year, more than 20,000 curated meetings took place across three days. This year, we’re rolling out improved networking technology to make those connections even more targeted and efficient.\n\nMeet the one person who can change the trajectory of your startup. It only takes one. You get:\n\nStartup Battlefieldis where 200 TechCrunch-selected, pre-Series A startups compete for $100,000 in equity-free funding, global visibility, and direct access to the industry’s top investors.\n\nThis iconic pitch competition has helped launch breakout companies like Discord, Cloudflare, and Trello.\n\nOver 300 startup exhibitorswill showcase innovations across the venue, especially in the Expo Hall, where foot traffic converges. Discover tomorrow’s breakthroughs and today’s solutions — all in one place.\n\nThroughout Disrupt Week, October 11–17, TechCrunch Disrupt Side Events will take place across the Bay Area beyond the main venue. Attend a post-event cocktail hour, grab breakfast before the day begins, or even host your own off-site panel. The opportunities to make powerful connections around Disrupt are endless.\n\nFive days remain to lock in the lowest rate of the year. Prices increase after February 27 at 11:59 p.m. PT.Register nowand secure your savings of up to $680 before they’re gone. Save up to 30% ongroup passes.",
      "excerpt": "We are officially down to the final 5 days tosave up to $680on yourTechCrunch Disrupt 2026ticket. These lowest rates of the year disappear on February 27 at 11:59 p.m. PT.\n\nIf you’ve been mapping out your 2026 tech event calendar, this isn’t the moment to wait.Register now to lock in your savings be",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI COO says ‘we have not yet really seen AI penetrate enterprise business processes’",
      "link": "https://techcrunch.com/2026/02/24/openai-coo-says-we-have-not-yet-really-seen-ai-penetrate-enterprise-business-processes/",
      "author": "Ivan Mehta",
      "date": "2026-02-24T09:44:34-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/brad-lightcap-GettyImages-2147824375-1.jpg?w=1024",
      "category": "AI",
      "content": "Earlier this month, OpenAI launched a new platform calledOpenAI Frontier for enterprises to build and manage agents, but OpenAI COO Brad Lightcap said that businesses haven’t yet seen AI adoption at scale.\n\n“One of the interesting things and some of the inspiration for the work we’ve been doing lately around OpenAI Frontier is we have not yet really seen enterprise AI penetrate enterprise business process,” the AI exec said on the sidelines of theIndia AI summit held last week in New Delhi.\n\n“You’ve got really powerful AI systems that any person can use in their individual capacity. And enterprises are these highly complex organizations with a lot of people, teams, all having to work together, a lot of context. There are very complex goals that have to be achieved using a lot of different systems and tools.”\n\nThere is a lot of talk aroundAI agentstaking over business processesand claiming that“SaaS is dead”.While these predictions have moved SaaS stocks at times, they haven’t really come true. In fact, Lightcap said OpenAI wasa massive Slack user last year, indicating how much AI firms are still reliant on traditional enterprise software.\n\nIn January,OpenAI CFO Sarah Friar posted that the company’s revenue is on the rise, with the startup ending 2025 with over $20 billion in annualized revenue. Lightcap said that demand is strong, without sharing any numbers.\n\n“We almost always find ourselves having to manage too much demand. We are still an organization that is growing, and so there is this global demand factor that we would love to be able to meet, and we are working as best as we can to be able to meet,” Lightcap said.\n\nAt the same time, OpenAI is thinking about how to quantify success in the enterprise. Lightcap said that OpenAI will try to measure Frontier’s impact based on “business outcomes, not on seat licenses.” (The comapny hasn’t yet shared pricing for Frontier.)\n\n“Frontier is a way for us to experiment iteratively with how to actually bring AI into the really messy and complex areas of businesses that I think if we get that right, we’re going to learn a lot about both businesses and also AI systems,” Lightcap noted.\n\nDays after TechCrunch’s conversation, OpenAI partnered with consultancies likeBoston Consulting Group (BCG), McKinsey, Accenture, and Capgeminito deploy its technology in an enterprise push. Even rival Anthropic launched plugins for finance, engineering, and design for enterprises to build agents based on Claude.\n\nMeanwhile, the company doesn’t have a clear path of integrating recently acquired open-source tool OpenClaw, but Lightcap said that it gives OpenAI “a glimpse into the future” where agents can do “almost anything you want them to be able to do on a computer.”\n\nIn keeping with the India AI summit, OpenAI has made a number of recent announcements around its business in the world’s largest market. The company said India was the second biggest user base of ChatGPT outside the U.S., withmore than 100 million weekly users. Lightcap said that voice as a modality is picking up in India and enabling OpenAI to reach more people.\n\n“Voice is so important here. And voice models now feel good enough and also good enough to run in low-latency and low-bandwidth environments, where you really can start to enable access to technology for a group of people who maybe were more disenfranchised than not,” Lightcap said.\n\nThe company also signed an enterprise contract for the usage of its tools and to deploy compute. Lightcap noted India is fourth in India in terms of enterprise seats in Asia, which is low for a populous country, and OpenAI has a lot of scope to expand here.\n\nThe AI company is also set to open two new offices in India in Mumbai and Bengaluru. However, these are likely to be sales and go-to-market offices. When I asked Lightcap if these offices would include technical talent, he said, “Never say never.”\n\nThere is also a fear of job impact, especially in countries like India, where the IT services and BPO (Business Process Outsourcing) industry is prominent, as AI tools automate some of the tasks. In the past few weeks, Indian IT companystocks have dippedas the market is taking into account the fact that areas like coding might require fewer humans. Lightcap said that the company is being “grounded” in what it has observed in terms of jobs market.\n\n“Our view is that over time, jobs will change. I think we don’t yet know where, how, or what, but it seems inevitable that work will look different in the future than it looks today. And that’s natural, that’s part of the business cycle. It’s part of the global and dynamic economy that we live in. And so I think what we have to do is be able to obviously have empathy for where jobs are changing at a high rate,” he noted.",
      "excerpt": "Earlier this month, OpenAI launched a new platform calledOpenAI Frontier for enterprises to build and manage agents, but OpenAI COO Brad Lightcap said that businesses haven’t yet seen AI adoption at scale.\n\n“One of the interesting things and some of the inspiration for the work we’ve been doing late",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Stripe’s valuation soars 74% to $159 billion",
      "link": "https://techcrunch.com/2026/02/24/stripes-valuation-soars-74-to-159-billion/",
      "author": "Julie Bort",
      "date": "2026-02-24T09:28:23-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/09/GettyImages-527013168.jpg?resize=1200,801",
      "category": "",
      "content": "Another year, another Stripe tender offer where investors buy shares from employees that values the company at an enormous step up.\n\nOn Tuesday, Stripeannouncedthat this latest secondary transaction now values the company at $159 billion. Investors buying the shares include Thrive Capital, Coatue, Andreessen Horowitz, and Stripe itself.\n\nIn February 2025,Stripe announced its previous tender offer, which valued the company at $91.5 billion. So that’s about a 74% increase in valuation over the year. The annual announcement isn’t by chance. Stripe has timed this news with its annual letter from founders Patrick and John Collison that showcases its year of product releases, and some insights into global usage of its products for a year.\n\nFor instance, Stripe says that stablecoin payments volume doubled worldwide to around$400 billionin 2025, 60% of which it estimates comes from B2B payments. That growth is one reason why Stripe has invested heavily in crypto foundations recently, acquiring crypto wallet service Privy in July, and unveiling its own blockchain for payments, Tempo, in September.\n\nCorrection: This story originally stated that the global stablecoin volume was on Stripe’s network and has now been corrected.",
      "excerpt": "Another year, another Stripe tender offer where investors buy shares from employees that values the company at an enormous step up.\n\nOn Tuesday, Stripeannouncedthat this latest secondary transaction now values the company at $159 billion. Investors buying the shares include Thrive Capital, Coatue, A",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}